[Survived] BlockStatement
application/components/animated-card/AnimatedCard.ts:11:90
 export class AnimatedCard {
   private card: Card;
 
-  constructor(private localStorage: BrowserLocalStorage, private messageBus: MessageBus) {
-    this.card = new Card({
-      animatedCardContainer: 'st-animated-card',
-      locale: localStorage.getItem('locale') ? localStorage.getItem('locale') : 'en_GB'
-    });
-    this.initSubscribers();
-  }
+  constructor(private localStorage: BrowserLocalStorage, private messageBus: MessageBus) {}
 
   private initSubscribers(): void {

[Survived] StringLiteral
application/components/animated-card/AnimatedCard.ts:14:36
   constructor(private localStorage: BrowserLocalStorage, private messageBus: MessageBus) {
     this.card = new Card({
       animatedCardContainer: 'st-animated-card',
-      locale: localStorage.getItem('locale') ? localStorage.getItem('locale') : 'en_GB'
+      locale: localStorage.getItem("") ? localStorage.getItem('locale') : 'en_GB'
     });
     this.initSubscribers();

[Survived] BlockStatement
application/components/animated-card/AnimatedCard.ts:19:35
     this.initSubscribers();
   }
 
-  private initSubscribers(): void {
-    this.messageBus.subscribe(MessageBus.EVENTS.CHANGE_CARD_NUMBER, (data: IFormFieldState) => {
-      const { value } = data;
-      this.card.onCardNumberChange(value, true);
-    });
-    this.messageBus.subscribe(MessageBus.EVENTS.CHANGE_EXPIRATION_DATE, (data: IFormFieldState) => {
-      const { value } = data;
-      this.card.onExpirationDateChange(value, true);
-    });
-    this.messageBus.subscribe(MessageBus.EVENTS.CHANGE_SECURITY_CODE, (data: IFormFieldState) => {
-      const { value } = data;
-      this.card.onSecurityCodeChange(value, true);
-    });
-    this.messageBus.subscribe(MessageBus.EVENTS.FOCUS_SECURITY_CODE, (data: IFormFieldState) => {
-      this.card.onFieldFocusOrBlur(data);
-    });
-    this.messageBus.subscribe(MessageBus.EVENTS.BLUR_SECURITY_CODE, (data: IFormFieldState) => {
-      this.card.onFieldFocusOrBlur(data);
-    });
-  }
+  private initSubscribers(): void {}
 }
 

[Survived] BlockStatement
application/components/animated-card/AnimatedCard.ts:20:96
   }
 
   private initSubscribers(): void {
-    this.messageBus.subscribe(MessageBus.EVENTS.CHANGE_CARD_NUMBER, (data: IFormFieldState) => {
-      const { value } = data;
-      this.card.onCardNumberChange(value, true);
-    });
+    this.messageBus.subscribe(MessageBus.EVENTS.CHANGE_CARD_NUMBER, (data: IFormFieldState) => {});
     this.messageBus.subscribe(MessageBus.EVENTS.CHANGE_EXPIRATION_DATE, (data: IFormFieldState) => {
       const { value } = data;

[Survived] BooleanLiteral
application/components/animated-card/AnimatedCard.ts:22:43
   private initSubscribers(): void {
     this.messageBus.subscribe(MessageBus.EVENTS.CHANGE_CARD_NUMBER, (data: IFormFieldState) => {
       const { value } = data;
-      this.card.onCardNumberChange(value, true);
+      this.card.onCardNumberChange(value, false);
     });
     this.messageBus.subscribe(MessageBus.EVENTS.CHANGE_EXPIRATION_DATE, (data: IFormFieldState) => {

[Survived] BlockStatement
application/components/animated-card/AnimatedCard.ts:24:100
       const { value } = data;
       this.card.onCardNumberChange(value, true);
     });
-    this.messageBus.subscribe(MessageBus.EVENTS.CHANGE_EXPIRATION_DATE, (data: IFormFieldState) => {
-      const { value } = data;
-      this.card.onExpirationDateChange(value, true);
-    });
+    this.messageBus.subscribe(MessageBus.EVENTS.CHANGE_EXPIRATION_DATE, (data: IFormFieldState) => {});
     this.messageBus.subscribe(MessageBus.EVENTS.CHANGE_SECURITY_CODE, (data: IFormFieldState) => {
       const { value } = data;

[Survived] BooleanLiteral
application/components/animated-card/AnimatedCard.ts:26:47
     });
     this.messageBus.subscribe(MessageBus.EVENTS.CHANGE_EXPIRATION_DATE, (data: IFormFieldState) => {
       const { value } = data;
-      this.card.onExpirationDateChange(value, true);
+      this.card.onExpirationDateChange(value, false);
     });
     this.messageBus.subscribe(MessageBus.EVENTS.CHANGE_SECURITY_CODE, (data: IFormFieldState) => {

[Survived] BlockStatement
application/components/animated-card/AnimatedCard.ts:28:98
       const { value } = data;
       this.card.onExpirationDateChange(value, true);
     });
-    this.messageBus.subscribe(MessageBus.EVENTS.CHANGE_SECURITY_CODE, (data: IFormFieldState) => {
-      const { value } = data;
-      this.card.onSecurityCodeChange(value, true);
-    });
+    this.messageBus.subscribe(MessageBus.EVENTS.CHANGE_SECURITY_CODE, (data: IFormFieldState) => {});
     this.messageBus.subscribe(MessageBus.EVENTS.FOCUS_SECURITY_CODE, (data: IFormFieldState) => {
       this.card.onFieldFocusOrBlur(data);

[Survived] BooleanLiteral
application/components/animated-card/AnimatedCard.ts:30:45
     });
     this.messageBus.subscribe(MessageBus.EVENTS.CHANGE_SECURITY_CODE, (data: IFormFieldState) => {
       const { value } = data;
-      this.card.onSecurityCodeChange(value, true);
+      this.card.onSecurityCodeChange(value, false);
     });
     this.messageBus.subscribe(MessageBus.EVENTS.FOCUS_SECURITY_CODE, (data: IFormFieldState) => {

[Survived] BlockStatement
application/components/animated-card/AnimatedCard.ts:32:97
       const { value } = data;
       this.card.onSecurityCodeChange(value, true);
     });
-    this.messageBus.subscribe(MessageBus.EVENTS.FOCUS_SECURITY_CODE, (data: IFormFieldState) => {
-      this.card.onFieldFocusOrBlur(data);
-    });
+    this.messageBus.subscribe(MessageBus.EVENTS.FOCUS_SECURITY_CODE, (data: IFormFieldState) => {});
     this.messageBus.subscribe(MessageBus.EVENTS.BLUR_SECURITY_CODE, (data: IFormFieldState) => {
       this.card.onFieldFocusOrBlur(data);

[Survived] BlockStatement
application/components/animated-card/AnimatedCard.ts:35:96
     this.messageBus.subscribe(MessageBus.EVENTS.FOCUS_SECURITY_CODE, (data: IFormFieldState) => {
       this.card.onFieldFocusOrBlur(data);
     });
-    this.messageBus.subscribe(MessageBus.EVENTS.BLUR_SECURITY_CODE, (data: IFormFieldState) => {
-      this.card.onFieldFocusOrBlur(data);
-    });
+    this.messageBus.subscribe(MessageBus.EVENTS.BLUR_SECURITY_CODE, (data: IFormFieldState) => {});
   }
 }
