[Survived] BlockStatement
application/components/animated-card/animated-card.ts:10:8
 import { AnimatedCard } from './AnimatedCard';
 import { ANIMATED_CARD_COMPONENT_IFRAME } from '../../core/models/constants/Selectors';
 
-(() => {
-  if (Card && document.URL.includes('animated')) {
-    Container.get(ComponentBootstrap).run(ANIMATED_CARD_COMPONENT_IFRAME, AnimatedCard);
-  }
-})();
+(() => {})();
 

[Survived] ConditionalExpression
application/components/animated-card/animated-card.ts:11:7
 import { ANIMATED_CARD_COMPONENT_IFRAME } from '../../core/models/constants/Selectors';
 
 (() => {
-  if (Card && document.URL.includes('animated')) {
+  if (false) {
     Container.get(ComponentBootstrap).run(ANIMATED_CARD_COMPONENT_IFRAME, AnimatedCard);
   }

[Survived] LogicalOperator
application/components/animated-card/animated-card.ts:11:7
 import { ANIMATED_CARD_COMPONENT_IFRAME } from '../../core/models/constants/Selectors';
 
 (() => {
-  if (Card && document.URL.includes('animated')) {
+  if (Card || document.URL.includes('animated')) {
     Container.get(ComponentBootstrap).run(ANIMATED_CARD_COMPONENT_IFRAME, AnimatedCard);
   }
