[Survived] ArrowFunction
application/components/card-number/CardNumber.ts:26:33
 
 @Service()
 export class CardNumber extends Input {
-  public static ifFieldExists = (): HTMLInputElement => document.getElementById(CARD_NUMBER_INPUT) as HTMLInputElement;
+  public static ifFieldExists = () => undefined;
 
   private static DISABLED_ATTRIBUTE: string = 'disabled';

[Survived] ArrayDeclaration
application/components/card-number/CardNumber.ts:30:43
 
   private static DISABLED_ATTRIBUTE: string = 'disabled';
   private static DISABLED_CLASS: string = 'st-input--disabled';
-  private static NO_CVV_CARDS: string[] = ['PIBA'];
+  private static NO_CVV_CARDS: string[] = [];
   private static STANDARD_CARD_LENGTH: number = 19;
   private static WHITESPACES_DECREASE_NUMBER: number = 2;

[Survived] ArrowFunction
application/components/card-number/CardNumber.ts:34:48
   private static STANDARD_CARD_LENGTH: number = 19;
   private static WHITESPACES_DECREASE_NUMBER: number = 2;
 
-  private static _getCardNumberForBinProcess = (cardNumber: string) => cardNumber.slice(0, 6);
+  private static _getCardNumberForBinProcess = () => undefined;
 
   public validation: Validation;

[Survived] BooleanLiteral
application/components/card-number/CardNumber.ts:55:31
     super(CARD_NUMBER_INPUT, CARD_NUMBER_MESSAGE, CARD_NUMBER_LABEL, CARD_NUMBER_WRAPPER);
     this._cardNumberField = document.getElementById(CARD_NUMBER_INPUT) as HTMLInputElement;
     this.validation = new Validation();
-    this._isCardNumberValid = true;
+    this._isCardNumberValid = false;
     this._cardNumberLength = CardNumber.STANDARD_CARD_LENGTH;
     this.placeholder = this.configProvider.getConfig().placeholders.pan || '';

[Survived] LogicalOperator
application/components/card-number/CardNumber.ts:57:24
     this.validation = new Validation();
     this._isCardNumberValid = true;
     this._cardNumberLength = CardNumber.STANDARD_CARD_LENGTH;
-    this.placeholder = this.configProvider.getConfig().placeholders.pan || '';
+    this.placeholder = this.configProvider.getConfig().placeholders.pan && '';
     this._panIcon = this.configProvider.getConfig().panIcon;
     this.setFocusListener();

[Survived] ConditionalExpression
application/components/card-number/CardNumber.ts:57:24
     this.validation = new Validation();
     this._isCardNumberValid = true;
     this._cardNumberLength = CardNumber.STANDARD_CARD_LENGTH;
-    this.placeholder = this.configProvider.getConfig().placeholders.pan || '';
+    this.placeholder = false;
     this._panIcon = this.configProvider.getConfig().panIcon;
     this.setFocusListener();

[Survived] BlockStatement
application/components/card-number/CardNumber.ts:70:69
     );
     this._sendState();
     this._inputElement.setAttribute(CardNumber.PLACEHOLDER_ATTRIBUTE, this.placeholder);
-    this.configProvider.getConfig$().subscribe((config: IConfig) => {
-      const styler: Styler = new Styler(this.getAllowedStyles(), this.frame.parseUrl().styles);
-      if (styler.isLinedUp(config.styles.cardNumber)) {
-        styler.lineUp(
-          'st-card-number',
-          'st-card-number-label',
-          ['st-card-number', 'st-card-number--lined-up'],
-          ['card-number__label', 'card-number__label--required', 'lined-up']
-        );
-      }
-    });
+    this.configProvider.getConfig$().subscribe((config: IConfig) => {});
   }
 

[Survived] ConditionalExpression
application/components/card-number/CardNumber.ts:72:11
     this._inputElement.setAttribute(CardNumber.PLACEHOLDER_ATTRIBUTE, this.placeholder);
     this.configProvider.getConfig$().subscribe((config: IConfig) => {
       const styler: Styler = new Styler(this.getAllowedStyles(), this.frame.parseUrl().styles);
-      if (styler.isLinedUp(config.styles.cardNumber)) {
+      if (false) {
         styler.lineUp(
           'st-card-number',

[Survived] ConditionalExpression
application/components/card-number/CardNumber.ts:72:11
     this._inputElement.setAttribute(CardNumber.PLACEHOLDER_ATTRIBUTE, this.placeholder);
     this.configProvider.getConfig$().subscribe((config: IConfig) => {
       const styler: Styler = new Styler(this.getAllowedStyles(), this.frame.parseUrl().styles);
-      if (styler.isLinedUp(config.styles.cardNumber)) {
+      if (true) {
         styler.lineUp(
           'st-card-number',

[Survived] StringLiteral
application/components/card-number/CardNumber.ts:74:11
       const styler: Styler = new Styler(this.getAllowedStyles(), this.frame.parseUrl().styles);
       if (styler.isLinedUp(config.styles.cardNumber)) {
         styler.lineUp(
-          'st-card-number',
+          "",
           'st-card-number-label',
           ['st-card-number', 'st-card-number--lined-up'],

[Survived] ArrayDeclaration
application/components/card-number/CardNumber.ts:76:11
         styler.lineUp(
           'st-card-number',
           'st-card-number-label',
-          ['st-card-number', 'st-card-number--lined-up'],
+          [],
           ['card-number__label', 'card-number__label--required', 'lined-up']
         );

[Survived] ArrayDeclaration
application/components/card-number/CardNumber.ts:77:11
           'st-card-number',
           'st-card-number-label',
           ['st-card-number', 'st-card-number--lined-up'],
-          ['card-number__label', 'card-number__label--required', 'lined-up']
+          []
         );
       }

[Survived] StringLiteral
application/components/card-number/CardNumber.ts:77:34
           'st-card-number',
           'st-card-number-label',
           ['st-card-number', 'st-card-number--lined-up'],
-          ['card-number__label', 'card-number__label--required', 'lined-up']
+          ['card-number__label', "", 'lined-up']
         );
       }

[Survived] BlockStatement
application/components/card-number/CardNumber.ts:83:32
     });
   }
 
-  protected getLabel(): string {
-    return LABEL_CARD_NUMBER;
-  }
+  protected getLabel(): string {}
 
   protected onBlur() {

[Survived] BlockStatement
application/components/card-number/CardNumber.ts:87:22
     return LABEL_CARD_NUMBER;
   }
 
-  protected onBlur() {
-    super.onBlur();
-    this.validation.luhnCheck(this._fieldInstance, this._inputElement, this._messageElement);
-    this._sendState();
-  }
+  protected onBlur() {}
 
   protected onFocus(event: Event) {

[Survived] BlockStatement
application/components/card-number/CardNumber.ts:93:35
     this._sendState();
   }
 
-  protected onFocus(event: Event) {
-    super.onFocus(event);
-    this._disableSecurityCodeField(this._inputElement.value);
-  }
+  protected onFocus(event: Event) {}
 
   protected onInput(event: Event) {

[Survived] BlockStatement
application/components/card-number/CardNumber.ts:98:35
     this._disableSecurityCodeField(this._inputElement.value);
   }
 
-  protected onInput(event: Event) {
-    super.onInput(event);
-    this._setInputValue();
-    this._sendState();
-  }
+  protected onInput(event: Event) {}
 
   protected onPaste(event: ClipboardEvent) {

[Survived] BlockStatement
application/components/card-number/CardNumber.ts:104:44
     this._sendState();
   }
 
-  protected onPaste(event: ClipboardEvent) {
-    super.onPaste(event);
-    this._setInputValue();
-    this._sendState();
-  }
+  protected onPaste(event: ClipboardEvent) {}
 
   protected onKeyPress(event: KeyboardEvent) {

[Survived] BlockStatement
application/components/card-number/CardNumber.ts:110:46
     this._sendState();
   }
 
-  protected onKeyPress(event: KeyboardEvent) {
-    super.onKeyPress(event);
-  }
+  protected onKeyPress(event: KeyboardEvent) {}
 
   protected onKeydown(event: KeyboardEvent) {

[Survived] BlockStatement
application/components/card-number/CardNumber.ts:114:45
     super.onKeyPress(event);
   }
 
-  protected onKeydown(event: KeyboardEvent) {
-    super.onKeydown(event);
-    if (Validation.isEnter(event)) {
-      this.validation.luhnCheck(this._cardNumberInput, this._inputElement, this._messageElement);
-      this._sendState();
-    }
-  }
+  protected onKeydown(event: KeyboardEvent) {}
 
   protected setFocusListener() {

[Survived] BlockStatement
application/components/card-number/CardNumber.ts:116:36
 
   protected onKeydown(event: KeyboardEvent) {
     super.onKeydown(event);
-    if (Validation.isEnter(event)) {
-      this.validation.luhnCheck(this._cardNumberInput, this._inputElement, this._messageElement);
-      this._sendState();
-    }
+    if (Validation.isEnter(event)) {}
   }
 

[Survived] ConditionalExpression
application/components/card-number/CardNumber.ts:116:9
 
   protected onKeydown(event: KeyboardEvent) {
     super.onKeydown(event);
-    if (Validation.isEnter(event)) {
+    if (false) {
       this.validation.luhnCheck(this._cardNumberInput, this._inputElement, this._messageElement);
       this._sendState();

[Survived] BlockStatement
application/components/card-number/CardNumber.ts:122:32
     }
   }
 
-  protected setFocusListener() {
-    super.setEventListener(MessageBus.EVENTS.FOCUS_CARD_NUMBER);
-  }
+  protected setFocusListener() {}
 
   protected setBlurListener() {

[Survived] BlockStatement
application/components/card-number/CardNumber.ts:126:31
     super.setEventListener(MessageBus.EVENTS.FOCUS_CARD_NUMBER);
   }
 
-  protected setBlurListener() {
-    super.setEventListener(MessageBus.EVENTS.BLUR_CARD_NUMBER);
-  }
+  protected setBlurListener() {}
 
   protected setSubmitListener() {

[Survived] BlockStatement
application/components/card-number/CardNumber.ts:130:33
     super.setEventListener(MessageBus.EVENTS.BLUR_CARD_NUMBER);
   }
 
-  protected setSubmitListener() {
-    super.setEventListener(MessageBus.EVENTS_PUBLIC.SUBMIT_FORM);
-  }
+  protected setSubmitListener() {}
 
   private _publishSecurityCodeLength() {

[Survived] BlockStatement
application/components/card-number/CardNumber.ts:134:40
     super.setEventListener(MessageBus.EVENTS_PUBLIC.SUBMIT_FORM);
   }
 
-  private _publishSecurityCodeLength() {
-    const { value } = this.getState();
-    const messageBusEvent: IMessageBusEvent = {
-      data: this._getSecurityCodeLength(value),
-      type: MessageBus.EVENTS.CHANGE_SECURITY_CODE_LENGTH
-    };
-    this.messageBus.publish(messageBusEvent);
-  }
+  private _publishSecurityCodeLength() {}
 
   private _getIcon(type: string): HTMLImageElement {

[Survived] BlockStatement
application/components/card-number/CardNumber.ts:143:52
     this.messageBus.publish(messageBusEvent);
   }
 
-  private _getIcon(type: string): HTMLImageElement {
-    if (!type) {
-      return;
-    }
-    return this._iconFactory.getIcon(type.toLowerCase());
-  }
+  private _getIcon(type: string): HTMLImageElement {}
 
   private _setIconImage(type: string, iconId: string): void {

[Survived] BooleanLiteral
application/components/card-number/CardNumber.ts:144:9
   }
 
   private _getIcon(type: string): HTMLImageElement {
-    if (!type) {
+    if (type) {
       return;
     }

[Survived] ConditionalExpression
application/components/card-number/CardNumber.ts:144:9
   }
 
   private _getIcon(type: string): HTMLImageElement {
-    if (!type) {
+    if (false) {
       return;
     }

[Survived] BlockStatement
application/components/card-number/CardNumber.ts:150:61
     return this._iconFactory.getIcon(type.toLowerCase());
   }
 
-  private _setIconImage(type: string, iconId: string): void {
-    const icon: HTMLImageElement = this._getIcon(type);
-    const iconInDom: HTMLElement = document.getElementById(iconId);
-
-    if (iconInDom) {
-      iconInDom.parentNode.removeChild(iconInDom);
-    }
-    if (icon) {
-      this._setIconInDom(icon);
-    }
-  }
+  private _setIconImage(type: string, iconId: string): void {}
 
   private _setIconInDom(element: HTMLElement): void {

[Survived] BlockStatement
application/components/card-number/CardNumber.ts:154:20
     const icon: HTMLImageElement = this._getIcon(type);
     const iconInDom: HTMLElement = document.getElementById(iconId);
 
-    if (iconInDom) {
-      iconInDom.parentNode.removeChild(iconInDom);
-    }
+    if (iconInDom) {}
     if (icon) {
       this._setIconInDom(icon);

[Survived] ConditionalExpression
application/components/card-number/CardNumber.ts:154:9
     const icon: HTMLImageElement = this._getIcon(type);
     const iconInDom: HTMLElement = document.getElementById(iconId);
 
-    if (iconInDom) {
+    if (false) {
       iconInDom.parentNode.removeChild(iconInDom);
     }

[Survived] ConditionalExpression
application/components/card-number/CardNumber.ts:157:9
     if (iconInDom) {
       iconInDom.parentNode.removeChild(iconInDom);
     }
-    if (icon) {
+    if (true) {
       this._setIconInDom(icon);
     }

[Survived] ConditionalExpression
application/components/card-number/CardNumber.ts:157:9
     if (iconInDom) {
       iconInDom.parentNode.removeChild(iconInDom);
     }
-    if (icon) {
+    if (false) {
       this._setIconInDom(icon);
     }

[Survived] BlockStatement
application/components/card-number/CardNumber.ts:162:53
     }
   }
 
-  private _setIconInDom(element: HTMLElement): void {
-    const input: HTMLElement = document.getElementById('st-card-number-wrapper');
-    input.insertBefore(element, input.childNodes[0]);
-  }
+  private _setIconInDom(element: HTMLElement): void {}
 
   private _getBinLookupDetails = (cardNumber: string) => {

[Survived] StringLiteral
application/components/card-number/CardNumber.ts:163:56
   }
 
   private _setIconInDom(element: HTMLElement): void {
-    const input: HTMLElement = document.getElementById('st-card-number-wrapper');
+    const input: HTMLElement = document.getElementById("");
     input.insertBefore(element, input.childNodes[0]);
   }

[Survived] BlockStatement
application/components/card-number/CardNumber.ts:167:58
     input.insertBefore(element, input.childNodes[0]);
   }
 
-  private _getBinLookupDetails = (cardNumber: string) => {
-    return iinLookup.lookup(cardNumber).type ? iinLookup.lookup(cardNumber) : undefined;
-  };
+  private _getBinLookupDetails = (cardNumber: string) => {};
 
   private _getCardFormat = (cardNumber: string) =>

[Survived] ArrowFunction
application/components/card-number/CardNumber.ts:171:28
     return iinLookup.lookup(cardNumber).type ? iinLookup.lookup(cardNumber) : undefined;
   };
 
-  private _getCardFormat = (cardNumber: string) =>
-    this._getBinLookupDetails(cardNumber) ? this._getBinLookupDetails(cardNumber).format : undefined;
+  private _getCardFormat = () => undefined;
 
   private _getPossibleCardLength = (cardNumber: string) =>

[Survived] ArrowFunction
application/components/card-number/CardNumber.ts:174:36
   private _getCardFormat = (cardNumber: string) =>
     this._getBinLookupDetails(cardNumber) ? this._getBinLookupDetails(cardNumber).format : undefined;
 
-  private _getPossibleCardLength = (cardNumber: string) =>
-    this._getBinLookupDetails(cardNumber) ? this._getBinLookupDetails(cardNumber).length : undefined;
+  private _getPossibleCardLength = () => undefined;
 
   private _getSecurityCodeLength = (cardNumber: string) =>

[Survived] ArrowFunction
application/components/card-number/CardNumber.ts:177:36
   private _getPossibleCardLength = (cardNumber: string) =>
     this._getBinLookupDetails(cardNumber) ? this._getBinLookupDetails(cardNumber).length : undefined;
 
-  private _getSecurityCodeLength = (cardNumber: string) =>
-    this._getBinLookupDetails(cardNumber) ? this._getBinLookupDetails(cardNumber).cvcLength[0] : undefined;
+  private _getSecurityCodeLength = () => undefined;
 
   private _getMaxLengthOfCardNumber() {

[Survived] BlockStatement
application/components/card-number/CardNumber.ts:180:39
   private _getSecurityCodeLength = (cardNumber: string) =>
     this._getBinLookupDetails(cardNumber) ? this._getBinLookupDetails(cardNumber).cvcLength[0] : undefined;
 
-  private _getMaxLengthOfCardNumber() {
-    const cardLengthFromBin = this._getPossibleCardLength(this._inputElement.value);
-    this._cardNumberValue = this._inputElement.value.replace(/\s/g, '');
-    const cardFormat = this._getCardFormat(this._cardNumberValue);
-    let numberOfWhitespaces;
-    if (cardFormat) {
-      numberOfWhitespaces = cardFormat.split('d').length - CardNumber.WHITESPACES_DECREASE_NUMBER;
-    } else {
-      numberOfWhitespaces = 0;
-    }
-    this._cardNumberLength =
-      Utils.getLastElementOfArray(cardLengthFromBin) + numberOfWhitespaces || CardNumber.STANDARD_CARD_LENGTH;
-    return this._cardNumberLength;
-  }
+  private _getMaxLengthOfCardNumber() {}
 
   private _getCardNumberFieldState(): IFormFieldState {

[Survived] StringLiteral
application/components/card-number/CardNumber.ts:182:69
 
   private _getMaxLengthOfCardNumber() {
     const cardLengthFromBin = this._getPossibleCardLength(this._inputElement.value);
-    this._cardNumberValue = this._inputElement.value.replace(/\s/g, '');
+    this._cardNumberValue = this._inputElement.value.replace(/\s/g, "Stryker was here!");
     const cardFormat = this._getCardFormat(this._cardNumberValue);
     let numberOfWhitespaces;

[Survived] ConditionalExpression
application/components/card-number/CardNumber.ts:185:9
     this._cardNumberValue = this._inputElement.value.replace(/\s/g, '');
     const cardFormat = this._getCardFormat(this._cardNumberValue);
     let numberOfWhitespaces;
-    if (cardFormat) {
+    if (true) {
       numberOfWhitespaces = cardFormat.split('d').length - CardNumber.WHITESPACES_DECREASE_NUMBER;
     } else {

[Survived] BlockStatement
application/components/card-number/CardNumber.ts:185:21
     this._cardNumberValue = this._inputElement.value.replace(/\s/g, '');
     const cardFormat = this._getCardFormat(this._cardNumberValue);
     let numberOfWhitespaces;
-    if (cardFormat) {
-      numberOfWhitespaces = cardFormat.split('d').length - CardNumber.WHITESPACES_DECREASE_NUMBER;
-    } else {
+    if (cardFormat) {} else {
       numberOfWhitespaces = 0;
     }

[Survived] ArithmeticOperator
application/components/card-number/CardNumber.ts:186:29
     const cardFormat = this._getCardFormat(this._cardNumberValue);
     let numberOfWhitespaces;
     if (cardFormat) {
-      numberOfWhitespaces = cardFormat.split('d').length - CardNumber.WHITESPACES_DECREASE_NUMBER;
+      numberOfWhitespaces = cardFormat.split('d').length + CardNumber.WHITESPACES_DECREASE_NUMBER;
     } else {
       numberOfWhitespaces = 0;

[Survived] BlockStatement
application/components/card-number/CardNumber.ts:187:12
     let numberOfWhitespaces;
     if (cardFormat) {
       numberOfWhitespaces = cardFormat.split('d').length - CardNumber.WHITESPACES_DECREASE_NUMBER;
-    } else {
-      numberOfWhitespaces = 0;
-    }
+    } else {}
     this._cardNumberLength =
       Utils.getLastElementOfArray(cardLengthFromBin) + numberOfWhitespaces || CardNumber.STANDARD_CARD_LENGTH;

[Survived] ConditionalExpression
application/components/card-number/CardNumber.ts:191:7
       numberOfWhitespaces = 0;
     }
     this._cardNumberLength =
-      Utils.getLastElementOfArray(cardLengthFromBin) + numberOfWhitespaces || CardNumber.STANDARD_CARD_LENGTH;
+      false;
     return this._cardNumberLength;
   }

[Survived] LogicalOperator
application/components/card-number/CardNumber.ts:191:7
       numberOfWhitespaces = 0;
     }
     this._cardNumberLength =
-      Utils.getLastElementOfArray(cardLengthFromBin) + numberOfWhitespaces || CardNumber.STANDARD_CARD_LENGTH;
+      Utils.getLastElementOfArray(cardLengthFromBin) + numberOfWhitespaces && CardNumber.STANDARD_CARD_LENGTH;
     return this._cardNumberLength;
   }

[Survived] BlockStatement
application/components/card-number/CardNumber.ts:195:55
     return this._cardNumberLength;
   }
 
-  private _getCardNumberFieldState(): IFormFieldState {
-    const { validity } = this.getState();
-    this._publishSecurityCodeLength();
-    return {
-      formattedValue: this._cardNumberFormatted,
-      validity,
-      value: this._cardNumberValue
-    };
-  }
+  private _getCardNumberFieldState(): IFormFieldState {}
 
   private _setInputValue() {

[Survived] BlockStatement
application/components/card-number/CardNumber.ts:205:28
     };
   }
 
-  private _setInputValue() {
-    this._getMaxLengthOfCardNumber();
-    this._disableSecurityCodeField(this._inputElement.value);
-    this._inputElement.value = this.validation.limitLength(this._inputElement.value, this._cardNumberLength);
-    const { formatted, nonformatted } = this._formatter.number(this._inputElement.value, CARD_NUMBER_INPUT);
-    this._inputElement.value = formatted;
-    this._cardNumberFormatted = formatted;
-    this._cardNumberValue = nonformatted;
-    this.validation.keepCursorsPosition(this._inputElement);
-    const type = this._getBinLookupDetails(this._cardNumberValue)
-      ? this._getBinLookupDetails(this._cardNumberValue).type
-      : null;
-    if (this._panIcon) {
-      this._setIconImage(type, 'card-icon');
-    }
-  }
+  private _setInputValue() {}
 
   private _setDisableListener() {

[Survived] ConditionalExpression
application/components/card-number/CardNumber.ts:217:9
     const type = this._getBinLookupDetails(this._cardNumberValue)
       ? this._getBinLookupDetails(this._cardNumberValue).type
       : null;
-    if (this._panIcon) {
+    if (false) {
       this._setIconImage(type, 'card-icon');
     }

[Survived] BlockStatement
application/components/card-number/CardNumber.ts:217:24
     const type = this._getBinLookupDetails(this._cardNumberValue)
       ? this._getBinLookupDetails(this._cardNumberValue).type
       : null;
-    if (this._panIcon) {
-      this._setIconImage(type, 'card-icon');
-    }
+    if (this._panIcon) {}
   }
 

[Survived] BlockStatement
application/components/card-number/CardNumber.ts:222:33
     }
   }
 
-  private _setDisableListener() {
-    this.messageBus.subscribe(MessageBus.EVENTS_PUBLIC.BLOCK_CARD_NUMBER, (state: FormState) => {
-      if (state !== FormState.AVAILABLE) {
-        this._inputElement.setAttribute(CardNumber.DISABLED_ATTRIBUTE, 'true');
-        this._inputElement.classList.add(CardNumber.DISABLED_CLASS);
-      } else {
-        // @ts-ignore
-        this._inputElement.removeAttribute(CardNumber.DISABLED_ATTRIBUTE);
-        this._inputElement.classList.remove(CardNumber.DISABLED_CLASS);
-      }
-    });
-  }
+  private _setDisableListener() {}
 
   private _disableSecurityCodeField(cardNumber: string) {

[Survived] BlockStatement
application/components/card-number/CardNumber.ts:223:97
   }
 
   private _setDisableListener() {
-    this.messageBus.subscribe(MessageBus.EVENTS_PUBLIC.BLOCK_CARD_NUMBER, (state: FormState) => {
-      if (state !== FormState.AVAILABLE) {
-        this._inputElement.setAttribute(CardNumber.DISABLED_ATTRIBUTE, 'true');
-        this._inputElement.classList.add(CardNumber.DISABLED_CLASS);
-      } else {
-        // @ts-ignore
-        this._inputElement.removeAttribute(CardNumber.DISABLED_ATTRIBUTE);
-        this._inputElement.classList.remove(CardNumber.DISABLED_CLASS);
-      }
-    });
+    this.messageBus.subscribe(MessageBus.EVENTS_PUBLIC.BLOCK_CARD_NUMBER, (state: FormState) => {});
   }
 

[Survived] ConditionalExpression
application/components/card-number/CardNumber.ts:224:11
 
   private _setDisableListener() {
     this.messageBus.subscribe(MessageBus.EVENTS_PUBLIC.BLOCK_CARD_NUMBER, (state: FormState) => {
-      if (state !== FormState.AVAILABLE) {
+      if (true) {
         this._inputElement.setAttribute(CardNumber.DISABLED_ATTRIBUTE, 'true');
         this._inputElement.classList.add(CardNumber.DISABLED_CLASS);

[Survived] BlockStatement
application/components/card-number/CardNumber.ts:224:42
 
   private _setDisableListener() {
     this.messageBus.subscribe(MessageBus.EVENTS_PUBLIC.BLOCK_CARD_NUMBER, (state: FormState) => {
-      if (state !== FormState.AVAILABLE) {
-        this._inputElement.setAttribute(CardNumber.DISABLED_ATTRIBUTE, 'true');
-        this._inputElement.classList.add(CardNumber.DISABLED_CLASS);
-      } else {
+      if (state !== FormState.AVAILABLE) {} else {
         // @ts-ignore
         this._inputElement.removeAttribute(CardNumber.DISABLED_ATTRIBUTE);

[Survived] BlockStatement
application/components/card-number/CardNumber.ts:227:14
       if (state !== FormState.AVAILABLE) {
         this._inputElement.setAttribute(CardNumber.DISABLED_ATTRIBUTE, 'true');
         this._inputElement.classList.add(CardNumber.DISABLED_CLASS);
-      } else {
-        // @ts-ignore
-        this._inputElement.removeAttribute(CardNumber.DISABLED_ATTRIBUTE);
-        this._inputElement.classList.remove(CardNumber.DISABLED_CLASS);
-      }
+      } else {}
     });
   }

[Survived] BlockStatement
application/components/card-number/CardNumber.ts:235:57
     });
   }
 
-  private _disableSecurityCodeField(cardNumber: string) {
-    const number: string = Validation.clearNonDigitsChars(cardNumber);
-    const isCardPiba: boolean = CardNumber.NO_CVV_CARDS.includes(iinLookup.lookup(number).type);
-    const formState = isCardPiba ? FormState.BLOCKED : FormState.AVAILABLE;
-    const messageBusEventPiba: IMessageBusEvent = {
-      data: { formState, isCardPiba },
-      type: MessageBus.EVENTS.IS_CARD_WITHOUT_CVV
-    };
-    this.messageBus.publish(messageBusEventPiba);
-  }
+  private _disableSecurityCodeField(cardNumber: string) {}
 
   private _sendState() {

[Survived] BlockStatement
application/components/card-number/CardNumber.ts:246:24
     this.messageBus.publish(messageBusEventPiba);
   }
 
-  private _sendState() {
-    const { value, validity } = this._getCardNumberFieldState();
-    const messageBusEvent: IMessageBusEvent = {
-      data: this._getCardNumberFieldState(),
-      type: MessageBus.EVENTS.CHANGE_CARD_NUMBER
-    };
-    if (validity) {
-      const binProcessEvent: IMessageBusEvent = {
-        data: CardNumber._getCardNumberForBinProcess(value),
-        type: MessageBus.EVENTS_PUBLIC.BIN_PROCESS
-      };
-      this.messageBus.publish(binProcessEvent, true);
-    }
-    this.messageBus.publish(messageBusEvent);
-  }
+  private _sendState() {}
 }
 

[Survived] ConditionalExpression
application/components/card-number/CardNumber.ts:252:9
       data: this._getCardNumberFieldState(),
       type: MessageBus.EVENTS.CHANGE_CARD_NUMBER
     };
-    if (validity) {
+    if (true) {
       const binProcessEvent: IMessageBusEvent = {
         data: CardNumber._getCardNumberForBinProcess(value),

[Survived] ConditionalExpression
application/components/card-number/CardNumber.ts:252:9
       data: this._getCardNumberFieldState(),
       type: MessageBus.EVENTS.CHANGE_CARD_NUMBER
     };
-    if (validity) {
+    if (false) {
       const binProcessEvent: IMessageBusEvent = {
         data: CardNumber._getCardNumberForBinProcess(value),

[Survived] BooleanLiteral
application/components/card-number/CardNumber.ts:257:48
         data: CardNumber._getCardNumberForBinProcess(value),
         type: MessageBus.EVENTS_PUBLIC.BIN_PROCESS
       };
-      this.messageBus.publish(binProcessEvent, true);
+      this.messageBus.publish(binProcessEvent, false);
     }
     this.messageBus.publish(messageBusEvent);
