[Survived] BlockStatement
application/components/card-number/card-number.ts:8:8
 import { Container } from 'typedi';
 import { CARD_NUMBER_IFRAME } from '../../core/models/constants/Selectors';
 
-(() => {
-  Container.get(ComponentBootstrap).run(CARD_NUMBER_IFRAME, CardNumber);
-})();
+(() => {})();
 
