[Survived] BlockStatement
application/components/control-frame/control-frame.ts:8:8
 import { Container } from 'typedi';
 import { CONTROL_FRAME_IFRAME } from '../../core/models/constants/Selectors';
 
-(() => {
-  Container.get(ComponentBootstrap).run(CONTROL_FRAME_IFRAME, ControlFrame);
-})();
+(() => {})();
 
