[Survived] ArrowFunction
application/components/expiration-date/ExpirationDate.ts:21:33
 
 @Service()
 export class ExpirationDate extends Input {
-  public static ifFieldExists = (): HTMLInputElement =>
-    document.getElementById(EXPIRATION_DATE_INPUT) as HTMLInputElement;
+  public static ifFieldExists = () => undefined;
   private static DISABLED_ATTRIBUTE: string = 'disabled';
   private static DISABLED_CLASS: string = 'st-input--disabled';

[Survived] StringLiteral
application/components/expiration-date/ExpirationDate.ts:24:43
   public static ifFieldExists = (): HTMLInputElement =>
     document.getElementById(EXPIRATION_DATE_INPUT) as HTMLInputElement;
   private static DISABLED_ATTRIBUTE: string = 'disabled';
-  private static DISABLED_CLASS: string = 'st-input--disabled';
+  private static DISABLED_CLASS: string = "";
   private static EXPIRATION_DATE_LENGTH: number = 5;
   private static INPUT_PATTERN: string = '^(0[1-9]|1[0-2])\\/([0-9]{2})$';

[Survived] StringLiteral
application/components/expiration-date/ExpirationDate.ts:26:42
   private static DISABLED_ATTRIBUTE: string = 'disabled';
   private static DISABLED_CLASS: string = 'st-input--disabled';
   private static EXPIRATION_DATE_LENGTH: number = 5;
-  private static INPUT_PATTERN: string = '^(0[1-9]|1[0-2])\\/([0-9]{2})$';
+  private static INPUT_PATTERN: string = "";
 
   private _currentKeyCode: number;

[Survived] BlockStatement
application/components/expiration-date/ExpirationDate.ts:40:70
   ) {
     super(EXPIRATION_DATE_INPUT, EXPIRATION_DATE_MESSAGE, EXPIRATION_DATE_LABEL, EXPIRATION_DATE_WRAPPER);
     this._init();
-    this._configProvider.getConfig$().subscribe((config: IConfig) => {
-      const styler: Styler = new Styler(this.getAllowedStyles(), this.frame.parseUrl().styles);
-      if (styler.isLinedUp(config.styles.expirationDate)) {
-        styler.lineUp(
-          'st-expiration-date',
-          'st-expiration-date-label',
-          ['st-expiration-date', 'st-expiration-date--lined-up'],
-          ['expiration-date__label', 'expiration-date__label--required', 'lined-up']
-        );
-      }
-    });
+    this._configProvider.getConfig$().subscribe((config: IConfig) => {});
   }
 

[Survived] BlockStatement
application/components/expiration-date/ExpirationDate.ts:42:59
     this._init();
     this._configProvider.getConfig$().subscribe((config: IConfig) => {
       const styler: Styler = new Styler(this.getAllowedStyles(), this.frame.parseUrl().styles);
-      if (styler.isLinedUp(config.styles.expirationDate)) {
-        styler.lineUp(
-          'st-expiration-date',
-          'st-expiration-date-label',
-          ['st-expiration-date', 'st-expiration-date--lined-up'],
-          ['expiration-date__label', 'expiration-date__label--required', 'lined-up']
-        );
-      }
+      if (styler.isLinedUp(config.styles.expirationDate)) {}
     });
   }

[Survived] ConditionalExpression
application/components/expiration-date/ExpirationDate.ts:42:11
     this._init();
     this._configProvider.getConfig$().subscribe((config: IConfig) => {
       const styler: Styler = new Styler(this.getAllowedStyles(), this.frame.parseUrl().styles);
-      if (styler.isLinedUp(config.styles.expirationDate)) {
+      if (false) {
         styler.lineUp(
           'st-expiration-date',

[Survived] StringLiteral
application/components/expiration-date/ExpirationDate.ts:44:11
       const styler: Styler = new Styler(this.getAllowedStyles(), this.frame.parseUrl().styles);
       if (styler.isLinedUp(config.styles.expirationDate)) {
         styler.lineUp(
-          'st-expiration-date',
+          "",
           'st-expiration-date-label',
           ['st-expiration-date', 'st-expiration-date--lined-up'],

[Survived] StringLiteral
application/components/expiration-date/ExpirationDate.ts:45:11
       if (styler.isLinedUp(config.styles.expirationDate)) {
         styler.lineUp(
           'st-expiration-date',
-          'st-expiration-date-label',
+          "",
           ['st-expiration-date', 'st-expiration-date--lined-up'],
           ['expiration-date__label', 'expiration-date__label--required', 'lined-up']

[Survived] StringLiteral
application/components/expiration-date/ExpirationDate.ts:47:38
           'st-expiration-date',
           'st-expiration-date-label',
           ['st-expiration-date', 'st-expiration-date--lined-up'],
-          ['expiration-date__label', 'expiration-date__label--required', 'lined-up']
+          ['expiration-date__label', "", 'lined-up']
         );
       }

[Survived] StringLiteral
application/components/expiration-date/ExpirationDate.ts:47:12
           'st-expiration-date',
           'st-expiration-date-label',
           ['st-expiration-date', 'st-expiration-date--lined-up'],
-          ['expiration-date__label', 'expiration-date__label--required', 'lined-up']
+          ["", 'expiration-date__label--required', 'lined-up']
         );
       }

[Survived] BlockStatement
application/components/expiration-date/ExpirationDate.ts:53:29
     });
   }
 
-  public getLabel(): string {
-    return LABEL_EXPIRATION_DATE;
-  }
+  public getLabel(): string {}
 
   public setDisableListener() {

[Survived] BlockStatement
application/components/expiration-date/ExpirationDate.ts:57:31
     return LABEL_EXPIRATION_DATE;
   }
 
-  public setDisableListener() {
-    this.messageBus.subscribe(MessageBus.EVENTS_PUBLIC.BLOCK_EXPIRATION_DATE, (state: FormState) => {
-      state !== FormState.AVAILABLE ? this._disableInputField() : this._enableInputField();
-    });
-  }
+  public setDisableListener() {}
 
   protected format(date: string) {

[Survived] BlockStatement
application/components/expiration-date/ExpirationDate.ts:58:101
   }
 
   public setDisableListener() {
-    this.messageBus.subscribe(MessageBus.EVENTS_PUBLIC.BLOCK_EXPIRATION_DATE, (state: FormState) => {
-      state !== FormState.AVAILABLE ? this._disableInputField() : this._enableInputField();
-    });
+    this.messageBus.subscribe(MessageBus.EVENTS_PUBLIC.BLOCK_EXPIRATION_DATE, (state: FormState) => {});
   }
 

[Survived] ConditionalExpression
application/components/expiration-date/ExpirationDate.ts:59:7
 
   public setDisableListener() {
     this.messageBus.subscribe(MessageBus.EVENTS_PUBLIC.BLOCK_EXPIRATION_DATE, (state: FormState) => {
-      state !== FormState.AVAILABLE ? this._disableInputField() : this._enableInputField();
+      false ? this._disableInputField() : this._enableInputField();
     });
   }

[Survived] ConditionalExpression
application/components/expiration-date/ExpirationDate.ts:59:7
 
   public setDisableListener() {
     this.messageBus.subscribe(MessageBus.EVENTS_PUBLIC.BLOCK_EXPIRATION_DATE, (state: FormState) => {
-      state !== FormState.AVAILABLE ? this._disableInputField() : this._enableInputField();
+      true ? this._disableInputField() : this._enableInputField();
     });
   }

[Survived] BlockStatement
application/components/expiration-date/ExpirationDate.ts:63:34
     });
   }
 
-  protected format(date: string) {
-    this.setValue(date);
-  }
+  protected format(date: string) {}
 
   protected onBlur() {

[Survived] BlockStatement
application/components/expiration-date/ExpirationDate.ts:67:22
     this.setValue(date);
   }
 
-  protected onBlur() {
-    super.onBlur();
-    this._inputElement.value = this._formatter.date(this._inputElement.value, EXPIRATION_DATE_INPUT);
-    this._sendState();
-  }
+  protected onBlur() {}
 
   protected onFocus(event: Event) {

[Survived] BlockStatement
application/components/expiration-date/ExpirationDate.ts:73:35
     this._sendState();
   }
 
-  protected onFocus(event: Event) {
-    super.onFocus(event);
-    this._inputElement.value = this._formatter.date(this._inputElement.value, EXPIRATION_DATE_INPUT);
-  }
+  protected onFocus(event: Event) {}
 
   protected onInput(event: Event) {

[Survived] BlockStatement
application/components/expiration-date/ExpirationDate.ts:78:35
     this._inputElement.value = this._formatter.date(this._inputElement.value, EXPIRATION_DATE_INPUT);
   }
 
-  protected onInput(event: Event) {
-    super.onInput(event);
-    this._inputElement.value = this.validation.limitLength(
-      this._inputElement.value,
-      ExpirationDate.EXPIRATION_DATE_LENGTH
-    );
-    this._inputElement.value = this._formatter.date(this._inputElement.value, EXPIRATION_DATE_INPUT);
-    this.validation.keepCursorsPosition(this._inputElement);
-    this._sendState();
-  }
+  protected onInput(event: Event) {}
 
   protected onKeydown(event: KeyboardEvent) {

[Survived] BlockStatement
application/components/expiration-date/ExpirationDate.ts:89:45
     this._sendState();
   }
 
-  protected onKeydown(event: KeyboardEvent) {
-    super.onKeydown(event);
-    this._currentKeyCode = event.keyCode;
-    this._inputSelectionStart = this._inputElement.selectionStart;
-    this._inputSelectionEnd = this._inputElement.selectionEnd;
-    return event;
-  }
+  protected onKeydown(event: KeyboardEvent) {}
 
   protected onKeyPress(event: KeyboardEvent) {

[Survived] BlockStatement
application/components/expiration-date/ExpirationDate.ts:97:46
     return event;
   }
 
-  protected onKeyPress(event: KeyboardEvent) {
-    super.onKeyPress(event);
-    this._inputElement.focus();
-  }
+  protected onKeyPress(event: KeyboardEvent) {}
 
   protected onPaste(event: ClipboardEvent) {

[Survived] BlockStatement
application/components/expiration-date/ExpirationDate.ts:102:44
     this._inputElement.focus();
   }
 
-  protected onPaste(event: ClipboardEvent) {
-    super.onPaste(event);
-    this._inputElement.value = this.validation.limitLength(
-      this._inputElement.value,
-      ExpirationDate.EXPIRATION_DATE_LENGTH
-    );
-    this._inputElement.value = this._formatter.date(this._inputElement.value, EXPIRATION_DATE_INPUT);
-    this._sendState();
-  }
+  protected onPaste(event: ClipboardEvent) {}
 
   private _init() {

[Survived] BlockStatement
application/components/expiration-date/ExpirationDate.ts:112:19
     this._sendState();
   }
 
-  private _init() {
-    super.setEventListener(MessageBus.EVENTS.BLUR_EXPIRATION_DATE);
-    super.setEventListener(MessageBus.EVENTS.FOCUS_EXPIRATION_DATE);
-    this.setAttributes({ pattern: ExpirationDate.INPUT_PATTERN });
-    this.placeholder = this._configProvider.getConfig().placeholders.expirydate || '';
-    this._inputElement.setAttribute(ExpirationDate.PLACEHOLDER_ATTRIBUTE, this.placeholder);
-    this.setDisableListener();
-    this.validation.backendValidation(
-      this._inputElement,
-      this._messageElement,
-      MessageBus.EVENTS.VALIDATE_EXPIRATION_DATE_FIELD
-    );
-  }
+  private _init() {}
 
   private _sendState() {

[Survived] ConditionalExpression
application/components/expiration-date/ExpirationDate.ts:116:24
     super.setEventListener(MessageBus.EVENTS.BLUR_EXPIRATION_DATE);
     super.setEventListener(MessageBus.EVENTS.FOCUS_EXPIRATION_DATE);
     this.setAttributes({ pattern: ExpirationDate.INPUT_PATTERN });
-    this.placeholder = this._configProvider.getConfig().placeholders.expirydate || '';
+    this.placeholder = true;
     this._inputElement.setAttribute(ExpirationDate.PLACEHOLDER_ATTRIBUTE, this.placeholder);
     this.setDisableListener();

[Survived] LogicalOperator
application/components/expiration-date/ExpirationDate.ts:116:24
     super.setEventListener(MessageBus.EVENTS.BLUR_EXPIRATION_DATE);
     super.setEventListener(MessageBus.EVENTS.FOCUS_EXPIRATION_DATE);
     this.setAttributes({ pattern: ExpirationDate.INPUT_PATTERN });
-    this.placeholder = this._configProvider.getConfig().placeholders.expirydate || '';
+    this.placeholder = this._configProvider.getConfig().placeholders.expirydate && '';
     this._inputElement.setAttribute(ExpirationDate.PLACEHOLDER_ATTRIBUTE, this.placeholder);
     this.setDisableListener();

[Survived] BlockStatement
application/components/expiration-date/ExpirationDate.ts:126:24
     );
   }
 
-  private _sendState() {
-    const messageBusEvent: IMessageBusEvent = this.setMessageBusEvent(MessageBus.EVENTS.CHANGE_EXPIRATION_DATE);
-    this.messageBus.publish(messageBusEvent);
-  }
+  private _sendState() {}
 
   private _disableInputField() {

[Survived] BlockStatement
application/components/expiration-date/ExpirationDate.ts:131:32
     this.messageBus.publish(messageBusEvent);
   }
 
-  private _disableInputField() {
-    this._inputElement.setAttribute(ExpirationDate.DISABLED_ATTRIBUTE, 'true');
-    this._inputElement.classList.add(ExpirationDate.DISABLED_CLASS);
-  }
+  private _disableInputField() {}
 
   private _enableInputField() {

[Survived] BlockStatement
application/components/expiration-date/ExpirationDate.ts:136:31
     this._inputElement.classList.add(ExpirationDate.DISABLED_CLASS);
   }
 
-  private _enableInputField() {
-    this._inputElement.removeAttribute(ExpirationDate.DISABLED_ATTRIBUTE);
-    this._inputElement.classList.remove(ExpirationDate.DISABLED_CLASS);
-  }
+  private _enableInputField() {}
 }
 
