[Survived] BlockStatement
application/components/expiration-date/expiration-date.ts:8:8
 import { Container } from 'typedi';
 import { EXPIRATION_DATE_IFRAME } from '../../core/models/constants/Selectors';
 
-(() => {
-  Container.get(ComponentBootstrap).run(EXPIRATION_DATE_IFRAME, ExpirationDate);
-})();
+(() => {})();
 
