[Survived] BlockStatement
application/core/component-bootstrap/ComponentBootstrap.ts:16:75
 export class ComponentBootstrap {
   constructor(private frameIdentifier: FrameIdentifier, private container: ContainerInstance) {}
 
-  run<T>(frameName: string, componentClass: new (...args: any[]) => T): T {
-    this.frameIdentifier.setFrameName(frameName);
-
-    this.container.get(MessageBus);
-    this.container.get(Store);
-    this.container.get(BrowserLocalStorage).init();
-    this.container.get(FramesHub).notifyReadyState();
-
-    if (this.frameIdentifier.isControlFrame()) {
-      this.container.get(MessageSubscriberRegistry).register(...this.container.getMany(MessageSubscriberToken));
-    }
-
-    const component = this.container.get(componentClass);
-
-    this.container.get(SentryService).init(environment.SENTRY_DSN, environment.SENTRY_WHITELIST_URLS);
-
-    return component;
-  }
+  run<T>(frameName: string, componentClass: new (...args: any[]) => T): T {}
 }
 

[Survived] ConditionalExpression
application/core/component-bootstrap/ComponentBootstrap.ts:24:9
     this.container.get(BrowserLocalStorage).init();
     this.container.get(FramesHub).notifyReadyState();
 
-    if (this.frameIdentifier.isControlFrame()) {
+    if (false) {
       this.container.get(MessageSubscriberRegistry).register(...this.container.getMany(MessageSubscriberToken));
     }

[Survived] BlockStatement
application/core/component-bootstrap/ComponentBootstrap.ts:24:48
     this.container.get(BrowserLocalStorage).init();
     this.container.get(FramesHub).notifyReadyState();
 
-    if (this.frameIdentifier.isControlFrame()) {
-      this.container.get(MessageSubscriberRegistry).register(...this.container.getMany(MessageSubscriberToken));
-    }
+    if (this.frameIdentifier.isControlFrame()) {}
 
     const component = this.container.get(componentClass);
