[Survived] StringLiteral
core/integrations/apple-pay/ApplePay.ts:29:10
 const ApplePayError = (window as any).ApplePayError;
 const ApplePayContactMap: any = {
   countryiso2a: 'countryCode',
-  email: 'emailAddress',
+  email: "",
   firstname: 'givenName',
   lastname: 'familyName',

[Survived] StringLiteral
core/integrations/apple-pay/ApplePay.ts:30:14
 const ApplePayContactMap: any = {
   countryiso2a: 'countryCode',
   email: 'emailAddress',
-  firstname: 'givenName',
+  firstname: "",
   lastname: 'familyName',
   postcode: 'postalCode',

[Survived] StringLiteral
core/integrations/apple-pay/ApplePay.ts:31:13
   countryiso2a: 'countryCode',
   email: 'emailAddress',
   firstname: 'givenName',
-  lastname: 'familyName',
+  lastname: "",
   postcode: 'postalCode',
   premise: 'addressLines',

[Survived] StringLiteral
core/integrations/apple-pay/ApplePay.ts:34:14
   lastname: 'familyName',
   postcode: 'postalCode',
   premise: 'addressLines',
-  telephone: 'phoneNumber',
+  telephone: "",
   town: 'locality'
 };

[Survived] StringLiteral
core/integrations/apple-pay/ApplePay.ts:35:9
   postcode: 'postalCode',
   premise: 'addressLines',
   telephone: 'phoneNumber',
-  town: 'locality'
+  town: ""
 };
 

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:64:34
  *     this.session.completePayment function or canceled it with this.session.oncancel handler.
  */
 export class ApplePay {
-  get applePayButtonProps(): any {
-    return this._applePayButtonProps;
-  }
+  get applePayButtonProps(): any {}
 
   get payment(): Payment {

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:68:26
     return this._applePayButtonProps;
   }
 
-  get payment(): Payment {
-    return this._payment;
-  }
+  get payment(): Payment {}
 
   set payment(value: Payment) {

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:72:31
     return this._payment;
   }
 
-  set payment(value: Payment) {
-    this._payment = value;
-  }
+  set payment(value: Payment) {}
 
   set jwt(value: string) {

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:76:26
     this._payment = value;
   }
 
-  set jwt(value: string) {
-    this._jwt = value;
-  }
+  set jwt(value: string) {}
 
   get jwt(): string {

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:80:21
     this._jwt = value;
   }
 
-  get jwt(): string {
-    return this._jwt;
-  }
+  get jwt(): string {}
 
   private static APPLE_PAY_BUTTON_ID: string = 'st-apple-pay';

[Survived] StringLiteral
core/integrations/apple-pay/ApplePay.ts:84:48
     return this._jwt;
   }
 
-  private static APPLE_PAY_BUTTON_ID: string = 'st-apple-pay';
+  private static APPLE_PAY_BUTTON_ID: string = "";
   private static APPLE_PAY_MIN_VERSION: number = 3;
   private static APPLE_PAY_MAX_VERSION: number = 5;

[Survived] ArrayDeclaration
core/integrations/apple-pay/ApplePay.ts:87:44
   private static APPLE_PAY_BUTTON_ID: string = 'st-apple-pay';
   private static APPLE_PAY_MIN_VERSION: number = 3;
   private static APPLE_PAY_MAX_VERSION: number = 5;
-  private static AVAILABLE_BUTTON_STYLES = ['black', 'white', 'white-outline'];
+  private static AVAILABLE_BUTTON_STYLES = [];
   private static AVAILABLE_BUTTON_TEXTS = ['plain', 'buy', 'book', 'donate', 'check-out', 'subscribe'];
   private static BASIC_SUPPORTED_NETWORKS = [

[Survived] StringLiteral
core/integrations/apple-pay/ApplePay.ts:87:45
   private static APPLE_PAY_BUTTON_ID: string = 'st-apple-pay';
   private static APPLE_PAY_MIN_VERSION: number = 3;
   private static APPLE_PAY_MAX_VERSION: number = 5;
-  private static AVAILABLE_BUTTON_STYLES = ['black', 'white', 'white-outline'];
+  private static AVAILABLE_BUTTON_STYLES = ["", 'white', 'white-outline'];
   private static AVAILABLE_BUTTON_TEXTS = ['plain', 'buy', 'book', 'donate', 'check-out', 'subscribe'];
   private static BASIC_SUPPORTED_NETWORKS = [

[Survived] StringLiteral
core/integrations/apple-pay/ApplePay.ts:88:91
   private static APPLE_PAY_MIN_VERSION: number = 3;
   private static APPLE_PAY_MAX_VERSION: number = 5;
   private static AVAILABLE_BUTTON_STYLES = ['black', 'white', 'white-outline'];
-  private static AVAILABLE_BUTTON_TEXTS = ['plain', 'buy', 'book', 'donate', 'check-out', 'subscribe'];
+  private static AVAILABLE_BUTTON_TEXTS = ['plain', 'buy', 'book', 'donate', 'check-out', ""];
   private static BASIC_SUPPORTED_NETWORKS = [
     'amex',

[Survived] ArrayDeclaration
core/integrations/apple-pay/ApplePay.ts:88:43
   private static APPLE_PAY_MIN_VERSION: number = 3;
   private static APPLE_PAY_MAX_VERSION: number = 5;
   private static AVAILABLE_BUTTON_STYLES = ['black', 'white', 'white-outline'];
-  private static AVAILABLE_BUTTON_TEXTS = ['plain', 'buy', 'book', 'donate', 'check-out', 'subscribe'];
+  private static AVAILABLE_BUTTON_TEXTS = [];
   private static BASIC_SUPPORTED_NETWORKS = [
     'amex',

[Survived] StringLiteral
core/integrations/apple-pay/ApplePay.ts:96:5
     'interac',
     'jcb',
     'masterCard',
-    'privateLabel',
+    "",
     'visa'
   ];

[Survived] StringLiteral
core/integrations/apple-pay/ApplePay.ts:101:5
   ];
   private static VERSION_4_SUPPORTED_NETWORKS = ApplePay.BASIC_SUPPORTED_NETWORKS.concat([
     'cartesBancaires',
-    'eftpos',
+    "",
     'electron',
     'maestro',

[Survived] StringLiteral
core/integrations/apple-pay/ApplePay.ts:103:5
     'cartesBancaires',
     'eftpos',
     'electron',
-    'maestro',
+    "",
     'vPay'
   ]);

[Survived] StringLiteral
core/integrations/apple-pay/ApplePay.ts:104:5
     'eftpos',
     'electron',
     'maestro',
-    'vPay'
+    ""
   ]);
   private static VERSION_5_SUPPORTED_NETWORKS = ApplePay.BASIC_SUPPORTED_NETWORKS.concat(['elo', 'mada']);

[Survived] ArrayDeclaration
core/integrations/apple-pay/ApplePay.ts:106:90
     'maestro',
     'vPay'
   ]);
-  private static VERSION_5_SUPPORTED_NETWORKS = ApplePay.BASIC_SUPPORTED_NETWORKS.concat(['elo', 'mada']);
+  private static VERSION_5_SUPPORTED_NETWORKS = ApplePay.BASIC_SUPPORTED_NETWORKS.concat([]);
 
   protected applePayVersion: number;

[Survived] StringLiteral
core/integrations/apple-pay/ApplePay.ts:120:19
   private _validateMerchantRequestData = {
     walletmerchantid: '',
     walletrequestdomain: window.location.hostname,
-    walletsource: 'APPLEPAY',
+    walletsource: "",
     walletvalidationurl: ''
   };

[Survived] BooleanLiteral
core/integrations/apple-pay/ApplePay.ts:139:40
   private _applePayConfig: IApplePay;
   private _datacenterurl: string;
   private _formId: string;
-  private _paymentCancelled: boolean = false;
+  private _paymentCancelled: boolean = true;
 
   constructor(private _configProvider: ConfigProvider, private _communicator: InterFrameCommunicator) {

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:148:39
 
     this._config$ = this._configProvider.getConfig$();
 
-    this._config$.subscribe(config => {
-      const { applePay, jwt, datacenterurl, formId } = config;
-      if (applePay) {
-        // @ts-ignore
-        this._applePayConfig = applePay;
-      }
-      this.jwt = jwt;
-      this._formId = formId;
-      this._datacenterurl = datacenterurl;
-      this._onInit(this._applePayConfig.buttonText, this._applePayConfig.buttonStyle);
-    });
+    this._config$.subscribe(config => {});
     this._localStorage.setItem('completePayment', '');
     this._completion = {

[Survived] ConditionalExpression
core/integrations/apple-pay/ApplePay.ts:150:11
 
     this._config$.subscribe(config => {
       const { applePay, jwt, datacenterurl, formId } = config;
-      if (applePay) {
+      if (false) {
         // @ts-ignore
         this._applePayConfig = applePay;

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:150:21
 
     this._config$.subscribe(config => {
       const { applePay, jwt, datacenterurl, formId } = config;
-      if (applePay) {
-        // @ts-ignore
-        this._applePayConfig = applePay;
-      }
+      if (applePay) {}
       this.jwt = jwt;
       this._formId = formId;

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:165:99
       status: ApplePaySession ? this.getPaymentSuccessStatus() : ''
     };
 
-    this._messageBus.subscribe(MessageBus.EVENTS_PUBLIC.UPDATE_JWT, (data: { newJwt: string }) => {
-      const { newJwt } = data;
-      this._configurePaymentProcess(newJwt);
-      this._setAmountAndCurrency();
-    });
+    this._messageBus.subscribe(MessageBus.EVENTS_PUBLIC.UPDATE_JWT, (data: { newJwt: string }) => {});
   }
 

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:172:37
     });
   }
 
-  protected ifApplePayIsAvailable() {
-    return !!ApplePaySession;
-  }
+  protected ifApplePayIsAvailable() {}
 
   protected setApplePayVersion() {

[Survived] BooleanLiteral
core/integrations/apple-pay/ApplePay.ts:173:12
   }
 
   protected ifApplePayIsAvailable() {
-    return !!ApplePaySession;
+    return !ApplePaySession;
   }
 

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:176:34
     return !!ApplePaySession;
   }
 
-  protected setApplePayVersion() {
-    for (let i = ApplePay.APPLE_PAY_MAX_VERSION; i >= ApplePay.APPLE_PAY_MIN_VERSION; --i) {
-      if (this._ifBrowserSupportsApplePayVersion(i)) {
-        this.applePayVersion = i;
-        return;
-      } else if (i === ApplePay.APPLE_PAY_MIN_VERSION) {
-        this.applePayVersion = ApplePay.APPLE_PAY_MIN_VERSION;
-        return;
-      }
-    }
-  }
+  protected setApplePayVersion() {}
 
   protected createApplePayButton() {

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:177:92
   }
 
   protected setApplePayVersion() {
-    for (let i = ApplePay.APPLE_PAY_MAX_VERSION; i >= ApplePay.APPLE_PAY_MIN_VERSION; --i) {
-      if (this._ifBrowserSupportsApplePayVersion(i)) {
-        this.applePayVersion = i;
-        return;
-      } else if (i === ApplePay.APPLE_PAY_MIN_VERSION) {
-        this.applePayVersion = ApplePay.APPLE_PAY_MIN_VERSION;
-        return;
-      }
-    }
+    for (let i = ApplePay.APPLE_PAY_MAX_VERSION; i >= ApplePay.APPLE_PAY_MIN_VERSION; --i) {}
   }
 

[Survived] ConditionalExpression
core/integrations/apple-pay/ApplePay.ts:177:50
   }
 
   protected setApplePayVersion() {
-    for (let i = ApplePay.APPLE_PAY_MAX_VERSION; i >= ApplePay.APPLE_PAY_MIN_VERSION; --i) {
+    for (let i = ApplePay.APPLE_PAY_MAX_VERSION; false; --i) {
       if (this._ifBrowserSupportsApplePayVersion(i)) {
         this.applePayVersion = i;

[Survived] ConditionalExpression
core/integrations/apple-pay/ApplePay.ts:178:11
 
   protected setApplePayVersion() {
     for (let i = ApplePay.APPLE_PAY_MAX_VERSION; i >= ApplePay.APPLE_PAY_MIN_VERSION; --i) {
-      if (this._ifBrowserSupportsApplePayVersion(i)) {
+      if (true) {
         this.applePayVersion = i;
         return;

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:178:54
 
   protected setApplePayVersion() {
     for (let i = ApplePay.APPLE_PAY_MAX_VERSION; i >= ApplePay.APPLE_PAY_MIN_VERSION; --i) {
-      if (this._ifBrowserSupportsApplePayVersion(i)) {
-        this.applePayVersion = i;
-        return;
-      } else if (i === ApplePay.APPLE_PAY_MIN_VERSION) {
+      if (this._ifBrowserSupportsApplePayVersion(i)) {} else if (i === ApplePay.APPLE_PAY_MIN_VERSION) {
         this.applePayVersion = ApplePay.APPLE_PAY_MIN_VERSION;
         return;

[Survived] EqualityOperator
core/integrations/apple-pay/ApplePay.ts:181:18
       if (this._ifBrowserSupportsApplePayVersion(i)) {
         this.applePayVersion = i;
         return;
-      } else if (i === ApplePay.APPLE_PAY_MIN_VERSION) {
+      } else if (i !== ApplePay.APPLE_PAY_MIN_VERSION) {
         this.applePayVersion = ApplePay.APPLE_PAY_MIN_VERSION;
         return;

[Survived] ConditionalExpression
core/integrations/apple-pay/ApplePay.ts:181:18
       if (this._ifBrowserSupportsApplePayVersion(i)) {
         this.applePayVersion = i;
         return;
-      } else if (i === ApplePay.APPLE_PAY_MIN_VERSION) {
+      } else if (true) {
         this.applePayVersion = ApplePay.APPLE_PAY_MIN_VERSION;
         return;

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:188:36
     }
   }
 
-  protected createApplePayButton() {
-    return DomMethods.createHtmlElement.apply(this, [this._applePayButtonProps, 'a']);
-  }
+  protected createApplePayButton() {}
 
   protected isUserLoggedToAppleAccount(): boolean {

[Survived] StringLiteral
core/integrations/apple-pay/ApplePay.ts:189:81
   }
 
   protected createApplePayButton() {
-    return DomMethods.createHtmlElement.apply(this, [this._applePayButtonProps, 'a']);
+    return DomMethods.createHtmlElement.apply(this, [this._applePayButtonProps, ""]);
   }
 

[Survived] ArrayDeclaration
core/integrations/apple-pay/ApplePay.ts:189:53
   }
 
   protected createApplePayButton() {
-    return DomMethods.createHtmlElement.apply(this, [this._applePayButtonProps, 'a']);
+    return DomMethods.createHtmlElement.apply(this, []);
   }
 

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:192:51
     return DomMethods.createHtmlElement.apply(this, [this._applePayButtonProps, 'a']);
   }
 
-  protected isUserLoggedToAppleAccount(): boolean {
-    return ApplePaySession.canMakePayments();
-  }
+  protected isUserLoggedToAppleAccount(): boolean {}
 
   protected checkApplePayWalletCardAvailability() {

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:196:51
     return ApplePaySession.canMakePayments();
   }
 
-  protected checkApplePayWalletCardAvailability() {
-    return ApplePaySession.canMakePaymentsWithActiveCard(this._merchantId);
-  }
+  protected checkApplePayWalletCardAvailability() {}
 
   protected getApplePaySessionObject() {

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:200:40
     return ApplePaySession.canMakePaymentsWithActiveCard(this._merchantId);
   }
 
-  protected getApplePaySessionObject() {
-    return new ApplePaySession(this.applePayVersion, this._paymentRequest);
-  }
+  protected getApplePaySessionObject() {}
 
   protected getPaymentSuccessStatus() {

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:204:39
     return new ApplePaySession(this.applePayVersion, this._paymentRequest);
   }
 
-  protected getPaymentSuccessStatus() {
-    return ApplePaySession.STATUS_SUCCESS;
-  }
+  protected getPaymentSuccessStatus() {}
 
   protected getPaymentFailureStatus() {

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:208:39
     return ApplePaySession.STATUS_SUCCESS;
   }
 
-  protected getPaymentFailureStatus() {
-    return ApplePaySession.STATUS_FAILURE;
-  }
+  protected getPaymentFailureStatus() {}
 
   private _configurePaymentProcess(jwt: string) {

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:212:49
     return ApplePaySession.STATUS_FAILURE;
   }
 
-  private _configurePaymentProcess(jwt: string) {
-    const { placement, paymentRequest, merchantId } = this._applePayConfig;
-    this._merchantId = merchantId;
-    this._placement = placement;
-    this.payment = new Payment();
-    this._paymentRequest = paymentRequest;
-    this._requestTypes = paymentRequest.requestTypes;
-    this._validateMerchantRequestData.walletmerchantid = merchantId;
-    this._stJwtInstance = new StJwt(jwt);
-    this._stTransportInstance = Container.get(StTransport);
-    this._translator = new Translator(this._stJwtInstance.locale);
-  }
+  private _configurePaymentProcess(jwt: string) {}
 
   private _setSupportedNetworks() {

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:225:35
     this._translator = new Translator(this._stJwtInstance.locale);
   }
 
-  private _setSupportedNetworks() {
-    let supportedNetworks;
-    if (this.applePayVersion <= ApplePay.APPLE_PAY_MIN_VERSION) {
-      supportedNetworks = ApplePay.BASIC_SUPPORTED_NETWORKS;
-    } else if (
-      this.applePayVersion > ApplePay.APPLE_PAY_MIN_VERSION &&
-      this.applePayVersion < ApplePay.APPLE_PAY_MAX_VERSION
-    ) {
-      supportedNetworks = ApplePay.VERSION_4_SUPPORTED_NETWORKS;
-    } else {
-      supportedNetworks = ApplePay.VERSION_5_SUPPORTED_NETWORKS;
-    }
-    if (this._paymentRequest.supportedNetworks.length > 0) {
-      const userDefinedSupportedNetworks: string[] = [];
-      let i;
-      for (i in supportedNetworks) {
-        if (this._paymentRequest.supportedNetworks.indexOf(supportedNetworks[i]) !== -1) {
-          userDefinedSupportedNetworks.push(supportedNetworks[i]);
-        }
-      }
-      this._paymentRequest.supportedNetworks = userDefinedSupportedNetworks;
-    } else {
-      this._paymentRequest.supportedNetworks = supportedNetworks;
-    }
-  }
+  private _setSupportedNetworks() {}
 
   private _setApplePayButtonProps(buttonText: string, buttonStyle: string) {

[Survived] EqualityOperator
core/integrations/apple-pay/ApplePay.ts:227:9
 
   private _setSupportedNetworks() {
     let supportedNetworks;
-    if (this.applePayVersion <= ApplePay.APPLE_PAY_MIN_VERSION) {
+    if (this.applePayVersion > ApplePay.APPLE_PAY_MIN_VERSION) {
       supportedNetworks = ApplePay.BASIC_SUPPORTED_NETWORKS;
     } else if (

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:227:65
 
   private _setSupportedNetworks() {
     let supportedNetworks;
-    if (this.applePayVersion <= ApplePay.APPLE_PAY_MIN_VERSION) {
-      supportedNetworks = ApplePay.BASIC_SUPPORTED_NETWORKS;
-    } else if (
+    if (this.applePayVersion <= ApplePay.APPLE_PAY_MIN_VERSION) {} else if (
       this.applePayVersion > ApplePay.APPLE_PAY_MIN_VERSION &&
       this.applePayVersion < ApplePay.APPLE_PAY_MAX_VERSION

[Survived] ConditionalExpression
core/integrations/apple-pay/ApplePay.ts:230:7
     if (this.applePayVersion <= ApplePay.APPLE_PAY_MIN_VERSION) {
       supportedNetworks = ApplePay.BASIC_SUPPORTED_NETWORKS;
     } else if (
-      this.applePayVersion > ApplePay.APPLE_PAY_MIN_VERSION &&
-      this.applePayVersion < ApplePay.APPLE_PAY_MAX_VERSION
+      false
     ) {
       supportedNetworks = ApplePay.VERSION_4_SUPPORTED_NETWORKS;

[Survived] ConditionalExpression
core/integrations/apple-pay/ApplePay.ts:230:7
     if (this.applePayVersion <= ApplePay.APPLE_PAY_MIN_VERSION) {
       supportedNetworks = ApplePay.BASIC_SUPPORTED_NETWORKS;
     } else if (
-      this.applePayVersion > ApplePay.APPLE_PAY_MIN_VERSION &&
+      false &&
       this.applePayVersion < ApplePay.APPLE_PAY_MAX_VERSION
     ) {

[Survived] ConditionalExpression
core/integrations/apple-pay/ApplePay.ts:231:7
       supportedNetworks = ApplePay.BASIC_SUPPORTED_NETWORKS;
     } else if (
       this.applePayVersion > ApplePay.APPLE_PAY_MIN_VERSION &&
-      this.applePayVersion < ApplePay.APPLE_PAY_MAX_VERSION
+      true
     ) {
       supportedNetworks = ApplePay.VERSION_4_SUPPORTED_NETWORKS;

[Survived] ConditionalExpression
core/integrations/apple-pay/ApplePay.ts:231:7
       supportedNetworks = ApplePay.BASIC_SUPPORTED_NETWORKS;
     } else if (
       this.applePayVersion > ApplePay.APPLE_PAY_MIN_VERSION &&
-      this.applePayVersion < ApplePay.APPLE_PAY_MAX_VERSION
+      false
     ) {
       supportedNetworks = ApplePay.VERSION_4_SUPPORTED_NETWORKS;

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:232:7
     } else if (
       this.applePayVersion > ApplePay.APPLE_PAY_MIN_VERSION &&
       this.applePayVersion < ApplePay.APPLE_PAY_MAX_VERSION
-    ) {
-      supportedNetworks = ApplePay.VERSION_4_SUPPORTED_NETWORKS;
-    } else {
+    ) {} else {
       supportedNetworks = ApplePay.VERSION_5_SUPPORTED_NETWORKS;
     }

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:234:12
       this.applePayVersion < ApplePay.APPLE_PAY_MAX_VERSION
     ) {
       supportedNetworks = ApplePay.VERSION_4_SUPPORTED_NETWORKS;
-    } else {
-      supportedNetworks = ApplePay.VERSION_5_SUPPORTED_NETWORKS;
-    }
+    } else {}
     if (this._paymentRequest.supportedNetworks.length > 0) {
       const userDefinedSupportedNetworks: string[] = [];

[Survived] ConditionalExpression
core/integrations/apple-pay/ApplePay.ts:237:9
     } else {
       supportedNetworks = ApplePay.VERSION_5_SUPPORTED_NETWORKS;
     }
-    if (this._paymentRequest.supportedNetworks.length > 0) {
+    if (true) {
       const userDefinedSupportedNetworks: string[] = [];
       let i;

[Survived] EqualityOperator
core/integrations/apple-pay/ApplePay.ts:237:9
     } else {
       supportedNetworks = ApplePay.VERSION_5_SUPPORTED_NETWORKS;
     }
-    if (this._paymentRequest.supportedNetworks.length > 0) {
+    if (this._paymentRequest.supportedNetworks.length <= 0) {
       const userDefinedSupportedNetworks: string[] = [];
       let i;

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:240:36
     if (this._paymentRequest.supportedNetworks.length > 0) {
       const userDefinedSupportedNetworks: string[] = [];
       let i;
-      for (i in supportedNetworks) {
-        if (this._paymentRequest.supportedNetworks.indexOf(supportedNetworks[i]) !== -1) {
-          userDefinedSupportedNetworks.push(supportedNetworks[i]);
-        }
-      }
+      for (i in supportedNetworks) {}
       this._paymentRequest.supportedNetworks = userDefinedSupportedNetworks;
     } else {

[Survived] ConditionalExpression
core/integrations/apple-pay/ApplePay.ts:241:13
       const userDefinedSupportedNetworks: string[] = [];
       let i;
       for (i in supportedNetworks) {
-        if (this._paymentRequest.supportedNetworks.indexOf(supportedNetworks[i]) !== -1) {
+        if (true) {
           userDefinedSupportedNetworks.push(supportedNetworks[i]);
         }

[Survived] UnaryOperator
core/integrations/apple-pay/ApplePay.ts:241:86
       const userDefinedSupportedNetworks: string[] = [];
       let i;
       for (i in supportedNetworks) {
-        if (this._paymentRequest.supportedNetworks.indexOf(supportedNetworks[i]) !== -1) {
+        if (this._paymentRequest.supportedNetworks.indexOf(supportedNetworks[i]) !== +1) {
           userDefinedSupportedNetworks.push(supportedNetworks[i]);
         }

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:246:12
         }
       }
       this._paymentRequest.supportedNetworks = userDefinedSupportedNetworks;
-    } else {
-      this._paymentRequest.supportedNetworks = supportedNetworks;
-    }
+    } else {}
   }
 

[Survived] ArrowFunction
core/integrations/apple-pay/ApplePay.ts:263:32
   }
 
-  private _addApplePayButton = () => DomMethods.appendChildIntoDOM(this._placement, this.createApplePayButton());
+  private _addApplePayButton = () => undefined;
 
   private _ifApplePayButtonTextIsValid = (buttonText: string) => ApplePay.AVAILABLE_BUTTON_TEXTS.includes(buttonText);

[Survived] ArrowFunction
core/integrations/apple-pay/ApplePay.ts:265:42
 
   private _addApplePayButton = () => DomMethods.appendChildIntoDOM(this._placement, this.createApplePayButton());
 
-  private _ifApplePayButtonTextIsValid = (buttonText: string) => ApplePay.AVAILABLE_BUTTON_TEXTS.includes(buttonText);
+  private _ifApplePayButtonTextIsValid = () => undefined;
 
   private _ifApplePayButtonStyleIsValid = (buttonStyle: string) =>

[Survived] ArrowFunction
core/integrations/apple-pay/ApplePay.ts:267:43
 
   private _ifApplePayButtonTextIsValid = (buttonText: string) => ApplePay.AVAILABLE_BUTTON_TEXTS.includes(buttonText);
 
-  private _ifApplePayButtonStyleIsValid = (buttonStyle: string) =>
-    ApplePay.AVAILABLE_BUTTON_STYLES.includes(buttonStyle);
+  private _ifApplePayButtonStyleIsValid = () => undefined;
 
   private _applePayButtonClickHandler() {

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:270:41
   private _ifApplePayButtonStyleIsValid = (buttonStyle: string) =>
     ApplePay.AVAILABLE_BUTTON_STYLES.includes(buttonStyle);
 
-  private _applePayButtonClickHandler() {
-    const button = document.getElementById(ApplePay.APPLE_PAY_BUTTON_ID);
-    const handler = () => {
-      this._paymentProcess();
-      button.removeEventListener('click', handler);
-    };
-
-    if (button) {
-      button.addEventListener('click', handler);
-    }
-  }
+  private _applePayButtonClickHandler() {}
 
   private _setAmountAndCurrency() {

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:272:27
 
   private _applePayButtonClickHandler() {
     const button = document.getElementById(ApplePay.APPLE_PAY_BUTTON_ID);
-    const handler = () => {
-      this._paymentProcess();
-      button.removeEventListener('click', handler);
-    };
+    const handler = () => {};
 
     if (button) {

[Survived] ConditionalExpression
core/integrations/apple-pay/ApplePay.ts:277:9
       button.removeEventListener('click', handler);
     };
 
-    if (button) {
+    if (true) {
       button.addEventListener('click', handler);
     }

[Survived] ConditionalExpression
core/integrations/apple-pay/ApplePay.ts:277:9
       button.removeEventListener('click', handler);
     };
 
-    if (button) {
+    if (false) {
       button.addEventListener('click', handler);
     }

[Survived] StringLiteral
core/integrations/apple-pay/ApplePay.ts:278:31
     };
 
     if (button) {
-      button.addEventListener('click', handler);
+      button.addEventListener("", handler);
     }
   }

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:282:35
     }
   }
 
-  private _setAmountAndCurrency() {
-    if (this._paymentRequest.total.amount && this._paymentRequest.currencyCode) {
-      this._paymentRequest.total.amount = this._stJwtInstance.mainamount;
-      this._paymentRequest.currencyCode = this._stJwtInstance.currencyiso3a;
-    } else {
-      this._notification.error(APPLE_PAY_AMOUNT_AND_CURRENCY);
-    }
-    return this._paymentRequest;
-  }
+  private _setAmountAndCurrency() {}
 
   private _onInit(buttonText: string, buttonStyle: string) {

[Survived] LogicalOperator
core/integrations/apple-pay/ApplePay.ts:283:9
   }
 
   private _setAmountAndCurrency() {
-    if (this._paymentRequest.total.amount && this._paymentRequest.currencyCode) {
+    if (this._paymentRequest.total.amount || this._paymentRequest.currencyCode) {
       this._paymentRequest.total.amount = this._stJwtInstance.mainamount;
       this._paymentRequest.currencyCode = this._stJwtInstance.currencyiso3a;

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:283:81
   }
 
   private _setAmountAndCurrency() {
-    if (this._paymentRequest.total.amount && this._paymentRequest.currencyCode) {
-      this._paymentRequest.total.amount = this._stJwtInstance.mainamount;
-      this._paymentRequest.currencyCode = this._stJwtInstance.currencyiso3a;
-    } else {
+    if (this._paymentRequest.total.amount && this._paymentRequest.currencyCode) {} else {
       this._notification.error(APPLE_PAY_AMOUNT_AND_CURRENCY);
     }

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:286:12
     if (this._paymentRequest.total.amount && this._paymentRequest.currencyCode) {
       this._paymentRequest.total.amount = this._stJwtInstance.mainamount;
       this._paymentRequest.currencyCode = this._stJwtInstance.currencyiso3a;
-    } else {
-      this._notification.error(APPLE_PAY_AMOUNT_AND_CURRENCY);
-    }
+    } else {}
     return this._paymentRequest;
   }

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:292:60
     return this._paymentRequest;
   }
 
-  private _onInit(buttonText: string, buttonStyle: string) {
-    if (this.ifApplePayIsAvailable()) {
-      this._configurePaymentProcess(this.jwt);
-      this.setApplePayVersion();
-      this._setSupportedNetworks();
-      this._setAmountAndCurrency();
-      this._setApplePayButtonProps(buttonText, buttonStyle);
-      this._addApplePayButton();
-      this._applePayProcess();
-    }
-  }
+  private _onInit(buttonText: string, buttonStyle: string) {}
 
   private _onValidateMerchantRequest() {

[Survived] ConditionalExpression
core/integrations/apple-pay/ApplePay.ts:293:9
   }
 
   private _onInit(buttonText: string, buttonStyle: string) {
-    if (this.ifApplePayIsAvailable()) {
+    if (true) {
       this._configurePaymentProcess(this.jwt);
       this.setApplePayVersion();

[Survived] ConditionalExpression
core/integrations/apple-pay/ApplePay.ts:293:9
   }
 
   private _onInit(buttonText: string, buttonStyle: string) {
-    if (this.ifApplePayIsAvailable()) {
+    if (false) {
       this._configurePaymentProcess(this.jwt);
       this.setApplePayVersion();

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:310:38
       this._validateMerchantRequestData.walletmerchantid = this._merchantId;
       return this.payment
         .walletVerify(this._validateMerchantRequestData)
-        .then(({ response }: any) => {
-          GoogleAnalytics.sendGaData('event', 'Apple Pay', 'merchant validation', 'Apple Pay merchant validated');
-          return this._onValidateMerchantResponseSuccess(response);
-        })
+        .then(({ response }: any) => {})
         .catch(error => {
           if (this._paymentCancelled) {
