[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:314:25
           GoogleAnalytics.sendGaData('event', 'Apple Pay', 'merchant validation', 'Apple Pay merchant validated');
           return this._onValidateMerchantResponseSuccess(response);
         })
-        .catch(error => {
-          if (this._paymentCancelled) {
-            return;
-          }
-          const { errorcode, errormessage } = error;
-          this._onValidateMerchantResponseFailure(error);
-          this._applePayButtonClickHandler();
-          this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_ERROR_CALLBACK }, true);
-          this._notification.error(`${errorcode}: ${errormessage}`);
-          GoogleAnalytics.sendGaData(
-            'event',
-            'Apple Pay',
-            'merchant validation',
-            'Apple Pay merchant validation failure'
-          );
-        });
+        .catch(error => {});
     };
   }

[Survived] ConditionalExpression
core/integrations/apple-pay/ApplePay.ts:315:15
           return this._onValidateMerchantResponseSuccess(response);
         })
         .catch(error => {
-          if (this._paymentCancelled) {
+          if (true) {
             return;
           }

[Survived] ConditionalExpression
core/integrations/apple-pay/ApplePay.ts:315:15
           return this._onValidateMerchantResponseSuccess(response);
         })
         .catch(error => {
-          if (this._paymentCancelled) {
+          if (false) {
             return;
           }

[Survived] BooleanLiteral
core/integrations/apple-pay/ApplePay.ts:321:101
           const { errorcode, errormessage } = error;
           this._onValidateMerchantResponseFailure(error);
           this._applePayButtonClickHandler();
-          this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_ERROR_CALLBACK }, true);
+          this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_ERROR_CALLBACK }, false);
           this._notification.error(`${errorcode}: ${errormessage}`);
           GoogleAnalytics.sendGaData(

[Survived] ObjectLiteral
core/integrations/apple-pay/ApplePay.ts:339:11
       return this.payment
         .processPayment(
           this._requestTypes,
-          {
-            walletsource: this._validateMerchantRequestData.walletsource,
-            wallettoken: this.paymentDetails
-          },
+          {},
           DomMethods.parseForm(this._formId)
         )

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:345:34
           },
           DomMethods.parseForm(this._formId)
         )
-        .then((response: any) => {
-          const { errorcode, errormessage } = response.response;
-          this._handleApplePayError(response.response);
-          this._session.completePayment(this._completion);
-          this._displayNotification(errorcode, errormessage);
-          GoogleAnalytics.sendGaData('event', 'Apple Pay', 'payment', 'Apple Pay payment completed');
-          this._localStorage.setItem('completePayment', 'true');
-        })
+        .then((response: any) => {})
         .catch(() => {
           this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_ERROR_CALLBACK }, true);

[Survived] StringLiteral
core/integrations/apple-pay/ApplePay.ts:350:47
           this._handleApplePayError(response.response);
           this._session.completePayment(this._completion);
           this._displayNotification(errorcode, errormessage);
-          GoogleAnalytics.sendGaData('event', 'Apple Pay', 'payment', 'Apple Pay payment completed');
+          GoogleAnalytics.sendGaData('event', "", 'payment', 'Apple Pay payment completed');
           this._localStorage.setItem('completePayment', 'true');
         })

[Survived] StringLiteral
core/integrations/apple-pay/ApplePay.ts:351:38
           this._session.completePayment(this._completion);
           this._displayNotification(errorcode, errormessage);
           GoogleAnalytics.sendGaData('event', 'Apple Pay', 'payment', 'Apple Pay payment completed');
-          this._localStorage.setItem('completePayment', 'true');
+          this._localStorage.setItem("", 'true');
         })
         .catch(() => {

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:353:22
           GoogleAnalytics.sendGaData('event', 'Apple Pay', 'payment', 'Apple Pay payment completed');
           this._localStorage.setItem('completePayment', 'true');
         })
-        .catch(() => {
-          this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_ERROR_CALLBACK }, true);
-          this._notification.error(PAYMENT_ERROR);
-          this._session.completePayment({ status: this.getPaymentFailureStatus(), errors: [] });
-          this._applePayButtonClickHandler();
-          this._localStorage.setItem('completePayment', 'true');
-        });
+        .catch(() => {});
     };
   }

[Survived] BooleanLiteral
core/integrations/apple-pay/ApplePay.ts:354:101
           this._localStorage.setItem('completePayment', 'true');
         })
         .catch(() => {
-          this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_ERROR_CALLBACK }, true);
+          this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_ERROR_CALLBACK }, false);
           this._notification.error(PAYMENT_ERROR);
           this._session.completePayment({ status: this.getPaymentFailureStatus(), errors: [] });

[Survived] ObjectLiteral
core/integrations/apple-pay/ApplePay.ts:356:41
         .catch(() => {
           this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_ERROR_CALLBACK }, true);
           this._notification.error(PAYMENT_ERROR);
-          this._session.completePayment({ status: this.getPaymentFailureStatus(), errors: [] });
+          this._session.completePayment({});
           this._applePayButtonClickHandler();
           this._localStorage.setItem('completePayment', 'true');

[Survived] StringLiteral
core/integrations/apple-pay/ApplePay.ts:358:38
           this._notification.error(PAYMENT_ERROR);
           this._session.completePayment({ status: this.getPaymentFailureStatus(), errors: [] });
           this._applePayButtonClickHandler();
-          this._localStorage.setItem('completePayment', 'true');
+          this._localStorage.setItem("", 'true');
         });
     };

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:363:68
     };
   }
 
-  private _ifBrowserSupportsApplePayVersion = (version: number) => {
-    return ApplePaySession.supportsVersion(version);
-  };
+  private _ifBrowserSupportsApplePayVersion = (version: number) => {};
 
   private _onPaymentCanceled() {

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:367:32
     return ApplePaySession.supportsVersion(version);
   };
 
-  private _onPaymentCanceled() {
-    this._session.oncancel = (event: any) => {
-      this._paymentCancelled = true;
-      this._notification.cancel(PAYMENT_CANCELLED);
-      this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_CANCEL_CALLBACK }, true);
-      this._messageBus.publish(
-        {
-          type: MessageBus.EVENTS_PUBLIC.TRANSACTION_COMPLETE,
-          data: { errorcode: 'cancelled' }
-        },
-        true
-      );
-      this._applePayButtonClickHandler();
-      GoogleAnalytics.sendGaData('event', 'Apple Pay', 'payment status', 'Apple Pay payment cancelled');
-    };
-  }
+  private _onPaymentCanceled() {}
 
   private _onValidateMerchantResponseSuccess(response: any): Promise<any> {

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:368:46
   };
 
   private _onPaymentCanceled() {
-    this._session.oncancel = (event: any) => {
-      this._paymentCancelled = true;
-      this._notification.cancel(PAYMENT_CANCELLED);
-      this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_CANCEL_CALLBACK }, true);
-      this._messageBus.publish(
-        {
-          type: MessageBus.EVENTS_PUBLIC.TRANSACTION_COMPLETE,
-          data: { errorcode: 'cancelled' }
-        },
-        true
-      );
-      this._applePayButtonClickHandler();
-      GoogleAnalytics.sendGaData('event', 'Apple Pay', 'payment status', 'Apple Pay payment cancelled');
-    };
+    this._session.oncancel = (event: any) => {};
   }
 

[Survived] BooleanLiteral
core/integrations/apple-pay/ApplePay.ts:369:32
 
   private _onPaymentCanceled() {
     this._session.oncancel = (event: any) => {
-      this._paymentCancelled = true;
+      this._paymentCancelled = false;
       this._notification.cancel(PAYMENT_CANCELLED);
       this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_CANCEL_CALLBACK }, true);

[Survived] BooleanLiteral
core/integrations/apple-pay/ApplePay.ts:371:98
     this._session.oncancel = (event: any) => {
       this._paymentCancelled = true;
       this._notification.cancel(PAYMENT_CANCELLED);
-      this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_CANCEL_CALLBACK }, true);
+      this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_CANCEL_CALLBACK }, false);
       this._messageBus.publish(
         {

[Survived] ObjectLiteral
core/integrations/apple-pay/ApplePay.ts:371:32
     this._session.oncancel = (event: any) => {
       this._paymentCancelled = true;
       this._notification.cancel(PAYMENT_CANCELLED);
-      this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_CANCEL_CALLBACK }, true);
+      this._messageBus.publish({}, true);
       this._messageBus.publish(
         {

[Survived] StringLiteral
core/integrations/apple-pay/ApplePay.ts:375:30
       this._messageBus.publish(
         {
           type: MessageBus.EVENTS_PUBLIC.TRANSACTION_COMPLETE,
-          data: { errorcode: 'cancelled' }
+          data: { errorcode: "" }
         },
         true

[Survived] BooleanLiteral
core/integrations/apple-pay/ApplePay.ts:377:9
           type: MessageBus.EVENTS_PUBLIC.TRANSACTION_COMPLETE,
           data: { errorcode: 'cancelled' }
         },
-        true
+        false
       );
       this._applePayButtonClickHandler();

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:384:75
     };
   }
 
-  private _onValidateMerchantResponseSuccess(response: any): Promise<any> {
-    const { requestid, walletsession } = response;
-    if (this._paymentCancelled) {
-      return Promise.reject(requestid);
-    }
-    return new Promise((resolve, reject) => {
-      if (walletsession) {
-        try {
-          this._session.completeMerchantValidation(JSON.parse(walletsession));
-          resolve();
-        } catch (error) {
-          console.warn(error);
-          reject(requestid);
-        }
-      } else {
-        reject(requestid);
-      }
-    });
-  }
+  private _onValidateMerchantResponseSuccess(response: any): Promise<any> {}
 
   private _onValidateMerchantResponseFailure(error: any) {

[Survived] ConditionalExpression
core/integrations/apple-pay/ApplePay.ts:386:9
 
   private _onValidateMerchantResponseSuccess(response: any): Promise<any> {
     const { requestid, walletsession } = response;
-    if (this._paymentCancelled) {
+    if (true) {
       return Promise.reject(requestid);
     }

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:386:33
 
   private _onValidateMerchantResponseSuccess(response: any): Promise<any> {
     const { requestid, walletsession } = response;
-    if (this._paymentCancelled) {
-      return Promise.reject(requestid);
-    }
+    if (this._paymentCancelled) {}
     return new Promise((resolve, reject) => {
       if (walletsession) {

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:389:45
     if (this._paymentCancelled) {
       return Promise.reject(requestid);
     }
-    return new Promise((resolve, reject) => {
-      if (walletsession) {
-        try {
-          this._session.completeMerchantValidation(JSON.parse(walletsession));
-          resolve();
-        } catch (error) {
-          console.warn(error);
-          reject(requestid);
-        }
-      } else {
-        reject(requestid);
-      }
-    });
+    return new Promise((resolve, reject) => {});
   }
 

[Survived] ConditionalExpression
core/integrations/apple-pay/ApplePay.ts:390:11
       return Promise.reject(requestid);
     }
     return new Promise((resolve, reject) => {
-      if (walletsession) {
+      if (false) {
         try {
           this._session.completeMerchantValidation(JSON.parse(walletsession));

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:390:26
       return Promise.reject(requestid);
     }
     return new Promise((resolve, reject) => {
-      if (walletsession) {
-        try {
-          this._session.completeMerchantValidation(JSON.parse(walletsession));
-          resolve();
-        } catch (error) {
-          console.warn(error);
-          reject(requestid);
-        }
-      } else {
+      if (walletsession) {} else {
         reject(requestid);
       }

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:391:13
     }
     return new Promise((resolve, reject) => {
       if (walletsession) {
-        try {
-          this._session.completeMerchantValidation(JSON.parse(walletsession));
-          resolve();
-        } catch (error) {
+        try {} catch (error) {
           console.warn(error);
           reject(requestid);

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:394:25
         try {
           this._session.completeMerchantValidation(JSON.parse(walletsession));
           resolve();
-        } catch (error) {
-          console.warn(error);
-          reject(requestid);
-        }
+        } catch (error) {}
       } else {
         reject(requestid);

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:398:14
           console.warn(error);
           reject(requestid);
         }
-      } else {
-        reject(requestid);
-      }
+      } else {}
     });
   }

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:404:58
     });
   }
 
-  private _onValidateMerchantResponseFailure(error: any) {
-    try {
-      this._session.abort();
-    } catch (error) {
-      console.warn(error);
-    }
-    this._notification.error(MERCHANT_VALIDATION_FAILURE);
-  }
+  private _onValidateMerchantResponseFailure(error: any) {}
 
   private _subscribeStatusHandlers() {

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:405:9
   }
 
   private _onValidateMerchantResponseFailure(error: any) {
-    try {
-      this._session.abort();
-    } catch (error) {
+    try {} catch (error) {
       console.warn(error);
     }

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:407:21
   private _onValidateMerchantResponseFailure(error: any) {
     try {
       this._session.abort();
-    } catch (error) {
-      console.warn(error);
-    }
+    } catch (error) {}
     this._notification.error(MERCHANT_VALIDATION_FAILURE);
   }

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:413:38
     this._notification.error(MERCHANT_VALIDATION_FAILURE);
   }
 
-  private _subscribeStatusHandlers() {
-    this._session.onpaymentmethodselected = (event: any) => {
-      this._session.completePaymentMethodSelection({
-        newTotal: {
-          amount: this._paymentRequest.total.amount,
-          label: this._paymentRequest.total.label,
-          type: 'final'
-        }
-      });
-    };
-
-    this._session.onshippingmethodselected = (event: any) => {
-      this._session.completeShippingMethodSelection({
-        newTotal: { label: this._paymentRequest.total.label, amount: this._paymentRequest.total.amount, type: 'final' }
-      });
-    };
-
-    this._session.onshippingcontactselected = (event: any) => {
-      this._session.completeShippingContactSelection({
-        newTotal: { label: this._paymentRequest.total.label, amount: this._paymentRequest.total.amount, type: 'final' }
-      });
-    };
-  }
+  private _subscribeStatusHandlers() {}
 
   private _paymentProcess() {

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:414:61
   }
 
   private _subscribeStatusHandlers() {
-    this._session.onpaymentmethodselected = (event: any) => {
-      this._session.completePaymentMethodSelection({
-        newTotal: {
-          amount: this._paymentRequest.total.amount,
-          label: this._paymentRequest.total.label,
-          type: 'final'
-        }
-      });
-    };
+    this._session.onpaymentmethodselected = (event: any) => {};
 
     this._session.onshippingmethodselected = (event: any) => {

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:424:62
       });
     };
 
-    this._session.onshippingmethodselected = (event: any) => {
-      this._session.completeShippingMethodSelection({
-        newTotal: { label: this._paymentRequest.total.label, amount: this._paymentRequest.total.amount, type: 'final' }
-      });
-    };
+    this._session.onshippingmethodselected = (event: any) => {};
 
     this._session.onshippingcontactselected = (event: any) => {

[Survived] StringLiteral
core/integrations/apple-pay/ApplePay.ts:426:111
 
     this._session.onshippingmethodselected = (event: any) => {
       this._session.completeShippingMethodSelection({
-        newTotal: { label: this._paymentRequest.total.label, amount: this._paymentRequest.total.amount, type: 'final' }
+        newTotal: { label: this._paymentRequest.total.label, amount: this._paymentRequest.total.amount, type: "" }
       });
     };

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:430:63
       });
     };
 
-    this._session.onshippingcontactselected = (event: any) => {
-      this._session.completeShippingContactSelection({
-        newTotal: { label: this._paymentRequest.total.label, amount: this._paymentRequest.total.amount, type: 'final' }
-      });
-    };
+    this._session.onshippingcontactselected = (event: any) => {};
   }
 

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:437:29
     };
   }
 
-  private _paymentProcess() {
-    this._paymentCancelled = false;
-    this._localStorage.setItem('completePayment', 'false');
-    this._session = this.getApplePaySessionObject();
-    this._onPaymentCanceled();
-    this._subscribeStatusHandlers();
-    this._onPaymentAuthorized();
-    this._onValidateMerchantRequest();
-    try {
-      this._session.begin();
-    } catch (error) {
-      console.warn(error);
-    }
-  }
+  private _paymentProcess() {}
 
   private _applePayProcess() {

[Survived] BooleanLiteral
core/integrations/apple-pay/ApplePay.ts:438:30
   }
 
   private _paymentProcess() {
-    this._paymentCancelled = false;
+    this._paymentCancelled = true;
     this._localStorage.setItem('completePayment', 'false');
     this._session = this.getApplePaySessionObject();

[Survived] StringLiteral
core/integrations/apple-pay/ApplePay.ts:439:32
 
   private _paymentProcess() {
     this._paymentCancelled = false;
-    this._localStorage.setItem('completePayment', 'false');
+    this._localStorage.setItem("", 'false');
     this._session = this.getApplePaySessionObject();
     this._onPaymentCanceled();

[Survived] StringLiteral
core/integrations/apple-pay/ApplePay.ts:439:51
 
   private _paymentProcess() {
     this._paymentCancelled = false;
-    this._localStorage.setItem('completePayment', 'false');
+    this._localStorage.setItem('completePayment', "");
     this._session = this.getApplePaySessionObject();
     this._onPaymentCanceled();

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:445:9
     this._subscribeStatusHandlers();
     this._onPaymentAuthorized();
     this._onValidateMerchantRequest();
-    try {
-      this._session.begin();
-    } catch (error) {
+    try {} catch (error) {
       console.warn(error);
     }

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:447:21
     this._onValidateMerchantRequest();
     try {
       this._session.begin();
-    } catch (error) {
-      console.warn(error);
-    }
+    } catch (error) {}
   }
 

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:452:30
     }
   }
 
-  private _applePayProcess() {
-    if (ApplePaySession) {
-      if (this.isUserLoggedToAppleAccount()) {
-        this.checkApplePayWalletCardAvailability().then(() => {
-          this._applePayButtonClickHandler();
-          GoogleAnalytics.sendGaData('event', 'Apple Pay', 'init', 'Apple Pay can make payments');
-        });
-      } else {
-        this._addButtonHandler(ApplePay.APPLE_PAY_BUTTON_ID, 'click', 'error', APPLE_PAY_NOT_LOGGED);
-      }
-    }
-  }
+  private _applePayProcess() {}
 
   private _handleApplePayError(errorObject: any) {

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:453:26
   }
 
   private _applePayProcess() {
-    if (ApplePaySession) {
-      if (this.isUserLoggedToAppleAccount()) {
-        this.checkApplePayWalletCardAvailability().then(() => {
-          this._applePayButtonClickHandler();
-          GoogleAnalytics.sendGaData('event', 'Apple Pay', 'init', 'Apple Pay can make payments');
-        });
-      } else {
-        this._addButtonHandler(ApplePay.APPLE_PAY_BUTTON_ID, 'click', 'error', APPLE_PAY_NOT_LOGGED);
-      }
-    }
+    if (ApplePaySession) {}
   }
 

[Survived] ConditionalExpression
core/integrations/apple-pay/ApplePay.ts:453:9
   }
 
   private _applePayProcess() {
-    if (ApplePaySession) {
+    if (true) {
       if (this.isUserLoggedToAppleAccount()) {
         this.checkApplePayWalletCardAvailability().then(() => {

[Survived] ConditionalExpression
core/integrations/apple-pay/ApplePay.ts:454:11
 
   private _applePayProcess() {
     if (ApplePaySession) {
-      if (this.isUserLoggedToAppleAccount()) {
+      if (true) {
         this.checkApplePayWalletCardAvailability().then(() => {
           this._applePayButtonClickHandler();

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:454:46
 
   private _applePayProcess() {
     if (ApplePaySession) {
-      if (this.isUserLoggedToAppleAccount()) {
-        this.checkApplePayWalletCardAvailability().then(() => {
-          this._applePayButtonClickHandler();
-          GoogleAnalytics.sendGaData('event', 'Apple Pay', 'init', 'Apple Pay can make payments');
-        });
-      } else {
+      if (this.isUserLoggedToAppleAccount()) {} else {
         this._addButtonHandler(ApplePay.APPLE_PAY_BUTTON_ID, 'click', 'error', APPLE_PAY_NOT_LOGGED);
       }

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:455:63
   private _applePayProcess() {
     if (ApplePaySession) {
       if (this.isUserLoggedToAppleAccount()) {
-        this.checkApplePayWalletCardAvailability().then(() => {
-          this._applePayButtonClickHandler();
-          GoogleAnalytics.sendGaData('event', 'Apple Pay', 'init', 'Apple Pay can make payments');
-        });
+        this.checkApplePayWalletCardAvailability().then(() => {});
       } else {
         this._addButtonHandler(ApplePay.APPLE_PAY_BUTTON_ID, 'click', 'error', APPLE_PAY_NOT_LOGGED);

[Survived] StringLiteral
core/integrations/apple-pay/ApplePay.ts:457:47
       if (this.isUserLoggedToAppleAccount()) {
         this.checkApplePayWalletCardAvailability().then(() => {
           this._applePayButtonClickHandler();
-          GoogleAnalytics.sendGaData('event', 'Apple Pay', 'init', 'Apple Pay can make payments');
+          GoogleAnalytics.sendGaData('event', "", 'init', 'Apple Pay can make payments');
         });
       } else {

[Survived] StringLiteral
core/integrations/apple-pay/ApplePay.ts:457:60
       if (this.isUserLoggedToAppleAccount()) {
         this.checkApplePayWalletCardAvailability().then(() => {
           this._applePayButtonClickHandler();
-          GoogleAnalytics.sendGaData('event', 'Apple Pay', 'init', 'Apple Pay can make payments');
+          GoogleAnalytics.sendGaData('event', 'Apple Pay', "", 'Apple Pay can make payments');
         });
       } else {

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:459:14
           this._applePayButtonClickHandler();
           GoogleAnalytics.sendGaData('event', 'Apple Pay', 'init', 'Apple Pay can make payments');
         });
-      } else {
-        this._addButtonHandler(ApplePay.APPLE_PAY_BUTTON_ID, 'click', 'error', APPLE_PAY_NOT_LOGGED);
-      }
+      } else {}
     }
   }

[Survived] StringLiteral
core/integrations/apple-pay/ApplePay.ts:460:62
           GoogleAnalytics.sendGaData('event', 'Apple Pay', 'init', 'Apple Pay can make payments');
         });
       } else {
-        this._addButtonHandler(ApplePay.APPLE_PAY_BUTTON_ID, 'click', 'error', APPLE_PAY_NOT_LOGGED);
+        this._addButtonHandler(ApplePay.APPLE_PAY_BUTTON_ID, "", 'error', APPLE_PAY_NOT_LOGGED);
       }
     }

[Survived] ConditionalExpression
core/integrations/apple-pay/ApplePay.ts:467:9
 
   private _handleApplePayError(errorObject: any) {
     const { errorcode } = errorObject;
-    if (this._ifBrowserSupportsApplePayVersion(this.applePayVersion)) {
+    if (false) {
       if (errorcode !== '0') {
         const { errormessage } = errorObject;

[Survived] ConditionalExpression
core/integrations/apple-pay/ApplePay.ts:467:9
 
   private _handleApplePayError(errorObject: any) {
     const { errorcode } = errorObject;
-    if (this._ifBrowserSupportsApplePayVersion(this.applePayVersion)) {
+    if (true) {
       if (errorcode !== '0') {
         const { errormessage } = errorObject;

[Survived] ConditionalExpression
core/integrations/apple-pay/ApplePay.ts:468:11
   private _handleApplePayError(errorObject: any) {
     const { errorcode } = errorObject;
     if (this._ifBrowserSupportsApplePayVersion(this.applePayVersion)) {
-      if (errorcode !== '0') {
+      if (true) {
         const { errormessage } = errorObject;
         let errordata = String(errorObject.data); // not sure this line - I can't force ApplePay to throw such error.

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:468:30
   private _handleApplePayError(errorObject: any) {
     const { errorcode } = errorObject;
     if (this._ifBrowserSupportsApplePayVersion(this.applePayVersion)) {
-      if (errorcode !== '0') {
-        const { errormessage } = errorObject;
-        let errordata = String(errorObject.data); // not sure this line - I can't force ApplePay to throw such error.
-        const error = new ApplePayError('unknown');
-        error.message = this._translator.translate(errormessage);
-        if (errorcode === '30000') {
-          if (errordata.lastIndexOf('billing', 0) === 0) {
-            error.code = 'billingContactInvalid';
-            errordata = errordata.slice(7);
-          } else if (errordata.lastIndexOf('customer', 0) === 0) {
-            error.code = 'shippingContactInvalid';
-            errordata = errordata.slice(8);
-          }
-          if (typeof ApplePayContactMap[errordata] !== 'undefined') {
-            error.contactField = ApplePayContactMap[errordata];
-          } else if (error.code !== 'unknown') {
-            error.code = 'addressUnserviceable';
-          }
-        }
-        if (error.code !== 'unknown') {
-          // @ts-ignore
-          this._completion.errors = [error];
-        }
-      }
+      if (errorcode !== '0') {}
     }
 

[Survived] StringLiteral
core/integrations/apple-pay/ApplePay.ts:471:41
       if (errorcode !== '0') {
         const { errormessage } = errorObject;
         let errordata = String(errorObject.data); // not sure this line - I can't force ApplePay to throw such error.
-        const error = new ApplePayError('unknown');
+        const error = new ApplePayError("");
         error.message = this._translator.translate(errormessage);
         if (errorcode === '30000') {

[Survived] EqualityOperator
core/integrations/apple-pay/ApplePay.ts:473:13
         let errordata = String(errorObject.data); // not sure this line - I can't force ApplePay to throw such error.
         const error = new ApplePayError('unknown');
         error.message = this._translator.translate(errormessage);
-        if (errorcode === '30000') {
+        if (errorcode !== '30000') {
           if (errordata.lastIndexOf('billing', 0) === 0) {
             error.code = 'billingContactInvalid';

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:473:36
         let errordata = String(errorObject.data); // not sure this line - I can't force ApplePay to throw such error.
         const error = new ApplePayError('unknown');
         error.message = this._translator.translate(errormessage);
-        if (errorcode === '30000') {
-          if (errordata.lastIndexOf('billing', 0) === 0) {
-            error.code = 'billingContactInvalid';
-            errordata = errordata.slice(7);
-          } else if (errordata.lastIndexOf('customer', 0) === 0) {
-            error.code = 'shippingContactInvalid';
-            errordata = errordata.slice(8);
-          }
-          if (typeof ApplePayContactMap[errordata] !== 'undefined') {
-            error.contactField = ApplePayContactMap[errordata];
-          } else if (error.code !== 'unknown') {
-            error.code = 'addressUnserviceable';
-          }
-        }
+        if (errorcode === '30000') {}
         if (error.code !== 'unknown') {
           // @ts-ignore

[Survived] ConditionalExpression
core/integrations/apple-pay/ApplePay.ts:474:15
         const error = new ApplePayError('unknown');
         error.message = this._translator.translate(errormessage);
         if (errorcode === '30000') {
-          if (errordata.lastIndexOf('billing', 0) === 0) {
+          if (false) {
             error.code = 'billingContactInvalid';
             errordata = errordata.slice(7);
