[Survived] EqualityOperator
core/integrations/apple-pay/ApplePay.ts:474:15
         const error = new ApplePayError('unknown');
         error.message = this._translator.translate(errormessage);
         if (errorcode === '30000') {
-          if (errordata.lastIndexOf('billing', 0) === 0) {
+          if (errordata.lastIndexOf('billing', 0) !== 0) {
             error.code = 'billingContactInvalid';
             errordata = errordata.slice(7);

[Survived] StringLiteral
core/integrations/apple-pay/ApplePay.ts:475:26
         error.message = this._translator.translate(errormessage);
         if (errorcode === '30000') {
           if (errordata.lastIndexOf('billing', 0) === 0) {
-            error.code = 'billingContactInvalid';
+            error.code = "";
             errordata = errordata.slice(7);
           } else if (errordata.lastIndexOf('customer', 0) === 0) {

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:477:66
           if (errordata.lastIndexOf('billing', 0) === 0) {
             error.code = 'billingContactInvalid';
             errordata = errordata.slice(7);
-          } else if (errordata.lastIndexOf('customer', 0) === 0) {
-            error.code = 'shippingContactInvalid';
-            errordata = errordata.slice(8);
-          }
+          } else if (errordata.lastIndexOf('customer', 0) === 0) {}
           if (typeof ApplePayContactMap[errordata] !== 'undefined') {
             error.contactField = ApplePayContactMap[errordata];

[Survived] ConditionalExpression
core/integrations/apple-pay/ApplePay.ts:477:22
           if (errordata.lastIndexOf('billing', 0) === 0) {
             error.code = 'billingContactInvalid';
             errordata = errordata.slice(7);
-          } else if (errordata.lastIndexOf('customer', 0) === 0) {
+          } else if (false) {
             error.code = 'shippingContactInvalid';
             errordata = errordata.slice(8);

[Survived] EqualityOperator
core/integrations/apple-pay/ApplePay.ts:481:15
             error.code = 'shippingContactInvalid';
             errordata = errordata.slice(8);
           }
-          if (typeof ApplePayContactMap[errordata] !== 'undefined') {
+          if (typeof ApplePayContactMap[errordata] === 'undefined') {
             error.contactField = ApplePayContactMap[errordata];
           } else if (error.code !== 'unknown') {

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:481:69
             error.code = 'shippingContactInvalid';
             errordata = errordata.slice(8);
           }
-          if (typeof ApplePayContactMap[errordata] !== 'undefined') {
-            error.contactField = ApplePayContactMap[errordata];
-          } else if (error.code !== 'unknown') {
+          if (typeof ApplePayContactMap[errordata] !== 'undefined') {} else if (error.code !== 'unknown') {
             error.code = 'addressUnserviceable';
           }

[Survived] ConditionalExpression
core/integrations/apple-pay/ApplePay.ts:483:22
           }
           if (typeof ApplePayContactMap[errordata] !== 'undefined') {
             error.contactField = ApplePayContactMap[errordata];
-          } else if (error.code !== 'unknown') {
+          } else if (true) {
             error.code = 'addressUnserviceable';
           }

[Survived] ConditionalExpression
core/integrations/apple-pay/ApplePay.ts:483:22
           }
           if (typeof ApplePayContactMap[errordata] !== 'undefined') {
             error.contactField = ApplePayContactMap[errordata];
-          } else if (error.code !== 'unknown') {
+          } else if (false) {
             error.code = 'addressUnserviceable';
           }

[Survived] StringLiteral
core/integrations/apple-pay/ApplePay.ts:484:26
           if (typeof ApplePayContactMap[errordata] !== 'undefined') {
             error.contactField = ApplePayContactMap[errordata];
           } else if (error.code !== 'unknown') {
-            error.code = 'addressUnserviceable';
+            error.code = "";
           }
         }

[Survived] ConditionalExpression
core/integrations/apple-pay/ApplePay.ts:487:13
             error.code = 'addressUnserviceable';
           }
         }
-        if (error.code !== 'unknown') {
+        if (false) {
           // @ts-ignore
           this._completion.errors = [error];

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:487:39
             error.code = 'addressUnserviceable';
           }
         }
-        if (error.code !== 'unknown') {
-          // @ts-ignore
-          this._completion.errors = [error];
-        }
+        if (error.code !== 'unknown') {}
       }
     }

[Survived] ArrayDeclaration
core/integrations/apple-pay/ApplePay.ts:489:37
         }
         if (error.code !== 'unknown') {
           // @ts-ignore
-          this._completion.errors = [error];
+          this._completion.errors = [];
         }
       }

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:494:28
       }
     }
 
-    if (errorcode === '0') {
-      this._completion.status = this.getPaymentSuccessStatus();
-    } else {
+    if (errorcode === '0') {} else {
       this._applePayButtonClickHandler();
       this._completion.status = this.getPaymentFailureStatus();

[Survived] EqualityOperator
core/integrations/apple-pay/ApplePay.ts:494:9
       }
     }
 
-    if (errorcode === '0') {
+    if (errorcode !== '0') {
       this._completion.status = this.getPaymentSuccessStatus();
     } else {

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:496:12
 
     if (errorcode === '0') {
       this._completion.status = this.getPaymentSuccessStatus();
-    } else {
-      this._applePayButtonClickHandler();
-      this._completion.status = this.getPaymentFailureStatus();
-    }
+    } else {}
 
     return this._completion;

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:504:73
     return this._completion;
   }
 
-  private _displayNotification(errorcode: string, errormessage: string) {
-    if (errorcode === '0') {
-      this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_SUCCESS_CALLBACK }, true);
-      this._notification.success(PAYMENT_SUCCESS);
-    } else {
-      this._notification.error(errormessage);
-    }
-  }
+  private _displayNotification(errorcode: string, errormessage: string) {}
 
   private _addButtonHandler(id: string, event: string, notification: string, message: string) {

[Survived] ConditionalExpression
core/integrations/apple-pay/ApplePay.ts:505:9
   }
 
   private _displayNotification(errorcode: string, errormessage: string) {
-    if (errorcode === '0') {
+    if (false) {
       this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_SUCCESS_CALLBACK }, true);
       this._notification.success(PAYMENT_SUCCESS);

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:505:28
   }
 
   private _displayNotification(errorcode: string, errormessage: string) {
-    if (errorcode === '0') {
-      this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_SUCCESS_CALLBACK }, true);
-      this._notification.success(PAYMENT_SUCCESS);
-    } else {
+    if (errorcode === '0') {} else {
       this._notification.error(errormessage);
     }

[Survived] BooleanLiteral
core/integrations/apple-pay/ApplePay.ts:506:99
 
   private _displayNotification(errorcode: string, errormessage: string) {
     if (errorcode === '0') {
-      this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_SUCCESS_CALLBACK }, true);
+      this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_SUCCESS_CALLBACK }, false);
       this._notification.success(PAYMENT_SUCCESS);
     } else {

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:508:12
     if (errorcode === '0') {
       this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_SUCCESS_CALLBACK }, true);
       this._notification.success(PAYMENT_SUCCESS);
-    } else {
-      this._notification.error(errormessage);
-    }
+    } else {}
   }
 

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:513:95
     }
   }
 
-  private _addButtonHandler(id: string, event: string, notification: string, message: string) {
-    const element: HTMLButtonElement = document.getElementById(id) as HTMLButtonElement;
-    const eventType: string = event ? event : 'click';
-    const notificationType: string = notification;
-    if (element) {
-      element.addEventListener(eventType, () => {
-        if (notificationType === 'success') {
-          this._notification.success(message);
-          this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_SUCCESS_CALLBACK }, true);
-        } else if (notificationType === 'error') {
-          this._notification.error(message);
-          this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_ERROR_CALLBACK }, true);
-        } else if (notificationType === 'cancel') {
-          this._notification.cancel(message);
-          this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_CANCEL_CALLBACK }, true);
-        } else {
-          this._notification.info(message);
-        }
-      });
-    } else {
-      return false;
-    }
-  }
+  private _addButtonHandler(id: string, event: string, notification: string, message: string) {}
 }
 

[Survived] ConditionalExpression
core/integrations/apple-pay/ApplePay.ts:517:9
     const element: HTMLButtonElement = document.getElementById(id) as HTMLButtonElement;
     const eventType: string = event ? event : 'click';
     const notificationType: string = notification;
-    if (element) {
+    if (false) {
       element.addEventListener(eventType, () => {
         if (notificationType === 'success') {

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:517:18
     const element: HTMLButtonElement = document.getElementById(id) as HTMLButtonElement;
     const eventType: string = event ? event : 'click';
     const notificationType: string = notification;
-    if (element) {
-      element.addEventListener(eventType, () => {
-        if (notificationType === 'success') {
-          this._notification.success(message);
-          this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_SUCCESS_CALLBACK }, true);
-        } else if (notificationType === 'error') {
-          this._notification.error(message);
-          this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_ERROR_CALLBACK }, true);
-        } else if (notificationType === 'cancel') {
-          this._notification.cancel(message);
-          this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_CANCEL_CALLBACK }, true);
-        } else {
-          this._notification.info(message);
-        }
-      });
-    } else {
+    if (element) {} else {
       return false;
     }

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:518:49
     const eventType: string = event ? event : 'click';
     const notificationType: string = notification;
     if (element) {
-      element.addEventListener(eventType, () => {
-        if (notificationType === 'success') {
-          this._notification.success(message);
-          this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_SUCCESS_CALLBACK }, true);
-        } else if (notificationType === 'error') {
-          this._notification.error(message);
-          this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_ERROR_CALLBACK }, true);
-        } else if (notificationType === 'cancel') {
-          this._notification.cancel(message);
-          this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_CANCEL_CALLBACK }, true);
-        } else {
-          this._notification.info(message);
-        }
-      });
+      element.addEventListener(eventType, () => {});
     } else {
       return false;

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:519:45
     const notificationType: string = notification;
     if (element) {
       element.addEventListener(eventType, () => {
-        if (notificationType === 'success') {
-          this._notification.success(message);
-          this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_SUCCESS_CALLBACK }, true);
-        } else if (notificationType === 'error') {
+        if (notificationType === 'success') {} else if (notificationType === 'error') {
           this._notification.error(message);
           this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_ERROR_CALLBACK }, true);

[Survived] ConditionalExpression
core/integrations/apple-pay/ApplePay.ts:519:13
     const notificationType: string = notification;
     if (element) {
       element.addEventListener(eventType, () => {
-        if (notificationType === 'success') {
+        if (true) {
           this._notification.success(message);
           this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_SUCCESS_CALLBACK }, true);

[Survived] BooleanLiteral
core/integrations/apple-pay/ApplePay.ts:521:103
       element.addEventListener(eventType, () => {
         if (notificationType === 'success') {
           this._notification.success(message);
-          this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_SUCCESS_CALLBACK }, true);
+          this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_SUCCESS_CALLBACK }, false);
         } else if (notificationType === 'error') {
           this._notification.error(message);

[Survived] ObjectLiteral
core/integrations/apple-pay/ApplePay.ts:521:36
       element.addEventListener(eventType, () => {
         if (notificationType === 'success') {
           this._notification.success(message);
-          this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_SUCCESS_CALLBACK }, true);
+          this._messageBus.publish({}, true);
         } else if (notificationType === 'error') {
           this._notification.error(message);

[Survived] ConditionalExpression
core/integrations/apple-pay/ApplePay.ts:522:20
         if (notificationType === 'success') {
           this._notification.success(message);
           this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_SUCCESS_CALLBACK }, true);
-        } else if (notificationType === 'error') {
+        } else if (false) {
           this._notification.error(message);
           this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_ERROR_CALLBACK }, true);

[Survived] EqualityOperator
core/integrations/apple-pay/ApplePay.ts:522:20
         if (notificationType === 'success') {
           this._notification.success(message);
           this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_SUCCESS_CALLBACK }, true);
-        } else if (notificationType === 'error') {
+        } else if (notificationType !== 'error') {
           this._notification.error(message);
           this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_ERROR_CALLBACK }, true);

[Survived] BooleanLiteral
core/integrations/apple-pay/ApplePay.ts:524:101
           this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_SUCCESS_CALLBACK }, true);
         } else if (notificationType === 'error') {
           this._notification.error(message);
-          this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_ERROR_CALLBACK }, true);
+          this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_ERROR_CALLBACK }, false);
         } else if (notificationType === 'cancel') {
           this._notification.cancel(message);

[Survived] ConditionalExpression
core/integrations/apple-pay/ApplePay.ts:525:20
         } else if (notificationType === 'error') {
           this._notification.error(message);
           this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_ERROR_CALLBACK }, true);
-        } else if (notificationType === 'cancel') {
+        } else if (true) {
           this._notification.cancel(message);
           this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_CANCEL_CALLBACK }, true);

[Survived] ConditionalExpression
core/integrations/apple-pay/ApplePay.ts:525:20
         } else if (notificationType === 'error') {
           this._notification.error(message);
           this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_ERROR_CALLBACK }, true);
-        } else if (notificationType === 'cancel') {
+        } else if (false) {
           this._notification.cancel(message);
           this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_CANCEL_CALLBACK }, true);

[Survived] BooleanLiteral
core/integrations/apple-pay/ApplePay.ts:527:102
           this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_ERROR_CALLBACK }, true);
         } else if (notificationType === 'cancel') {
           this._notification.cancel(message);
-          this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_CANCEL_CALLBACK }, true);
+          this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_CANCEL_CALLBACK }, false);
         } else {
           this._notification.info(message);

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:528:16
         } else if (notificationType === 'cancel') {
           this._notification.cancel(message);
           this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_CANCEL_CALLBACK }, true);
-        } else {
-          this._notification.info(message);
-        }
+        } else {}
       });
     } else {

[Survived] BlockStatement
core/integrations/apple-pay/ApplePay.ts:532:12
           this._notification.info(message);
         }
       });
-    } else {
-      return false;
-    }
+    } else {}
   }
 }

[Survived] BooleanLiteral
core/integrations/apple-pay/ApplePay.ts:533:14
         }
       });
     } else {
-      return false;
+      return true;
     }
   }
