[Survived] BlockStatement
core/integrations/apple-pay/ApplePayErrorMock.ts:5:75
   private _errorCode: string;
   private _contactField: string;
   private _message: string;
-  constructor(errorCode: string, contactField?: string, message?: string) {
-    this._errorCode = errorCode;
-    this._contactField = contactField;
-    this._message = message;
-  }
+  constructor(errorCode: string, contactField?: string, message?: string) {}
 }
 
