[Survived] BlockStatement
core/integrations/apple-pay/ApplePayMock.ts:10:34
 export class ApplePayMock extends ApplePay {
   public paymentDetails: string;
 
-  public ifApplePayIsAvailable() {
-    return true;
-  }
+  public ifApplePayIsAvailable() {}
 
   public setApplePayVersion() {

[Survived] BooleanLiteral
core/integrations/apple-pay/ApplePayMock.ts:11:12
   public paymentDetails: string;
 
   public ifApplePayIsAvailable() {
-    return true;
+    return false;
   }
 

[Survived] BlockStatement
core/integrations/apple-pay/ApplePayMock.ts:14:31
     return true;
   }
 
-  public setApplePayVersion() {
-    this.applePayVersion = 5;
-  }
+  public setApplePayVersion() {}
 
   public isUserLoggedToAppleAccount() {

[Survived] BlockStatement
core/integrations/apple-pay/ApplePayMock.ts:18:39
     this.applePayVersion = 5;
   }
 
-  public isUserLoggedToAppleAccount() {
-    return true;
-  }
+  public isUserLoggedToAppleAccount() {}
 
   public checkApplePayWalletCardAvailability() {

[Survived] BooleanLiteral
core/integrations/apple-pay/ApplePayMock.ts:19:12
   }
 
   public isUserLoggedToAppleAccount() {
-    return true;
+    return false;
   }
 

[Survived] BlockStatement
core/integrations/apple-pay/ApplePayMock.ts:22:48
     return true;
   }
 
-  public checkApplePayWalletCardAvailability() {
-    return new Promise((resolve, reject) => {
-      resolve(true);
-    });
-  }
+  public checkApplePayWalletCardAvailability() {}
 
   public getApplePaySessionObject() {

[Survived] BlockStatement
core/integrations/apple-pay/ApplePayMock.ts:23:45
   }
 
   public checkApplePayWalletCardAvailability() {
-    return new Promise((resolve, reject) => {
-      resolve(true);
-    });
+    return new Promise((resolve, reject) => {});
   }
 

[Survived] BooleanLiteral
core/integrations/apple-pay/ApplePayMock.ts:24:15
 
   public checkApplePayWalletCardAvailability() {
     return new Promise((resolve, reject) => {
-      resolve(true);
+      resolve(false);
     });
   }

[Survived] BlockStatement
core/integrations/apple-pay/ApplePayMock.ts:28:37
     });
   }
 
-  public getApplePaySessionObject() {
-    return ApplePaySessionMock;
-  }
+  public getApplePaySessionObject() {}
 
   public getPaymentSuccessStatus() {

[Survived] BlockStatement
core/integrations/apple-pay/ApplePayMock.ts:32:36
     return ApplePaySessionMock;
   }
 
-  public getPaymentSuccessStatus() {
-    return ApplePaySessionMock.STATUS_SUCCESS;
-  }
+  public getPaymentSuccessStatus() {}
 
   public getPaymentFailureStatus() {

[Survived] BlockStatement
core/integrations/apple-pay/ApplePayMock.ts:36:36
     return ApplePaySessionMock.STATUS_SUCCESS;
   }
 
-  public getPaymentFailureStatus() {
-    return ApplePaySessionMock.STATUS_FAILURE;
-  }
+  public getPaymentFailureStatus() {}
 
   public createApplePayButton() {

[Survived] BlockStatement
core/integrations/apple-pay/ApplePayMock.ts:40:33
     return ApplePaySessionMock.STATUS_FAILURE;
   }
 
-  public createApplePayButton() {
-    return DomMethods.createHtmlElement.apply(this, [{ src: applePay, id: 'st-apple-pay' }, 'img']);
-  }
+  public createApplePayButton() {}
 }
 

[Survived] StringLiteral
core/integrations/apple-pay/ApplePayMock.ts:41:93
   }
 
   public createApplePayButton() {
-    return DomMethods.createHtmlElement.apply(this, [{ src: applePay, id: 'st-apple-pay' }, 'img']);
+    return DomMethods.createHtmlElement.apply(this, [{ src: applePay, id: 'st-apple-pay' }, ""]);
   }
 }

[Survived] ObjectLiteral
core/integrations/apple-pay/ApplePayMock.ts:41:54
   }
 
   public createApplePayButton() {
-    return DomMethods.createHtmlElement.apply(this, [{ src: applePay, id: 'st-apple-pay' }, 'img']);
+    return DomMethods.createHtmlElement.apply(this, [{}, 'img']);
   }
 }
