[Survived] BooleanLiteral
core/integrations/apple-pay/ApplePaySessionMock.ts:10:41
   public static onpaymentauthorized: any;
   public static oncancel: any;
 
-  public static completePayment = () => true;
+  public static completePayment = () => false;
 
   public static completeMerchantValidation = () => true;

[Survived] ArrowFunction
core/integrations/apple-pay/ApplePaySessionMock.ts:10:35
   public static onpaymentauthorized: any;
   public static oncancel: any;
 
-  public static completePayment = () => true;
+  public static completePayment = () => undefined;
 
   public static completeMerchantValidation = () => true;

[Survived] ArrowFunction
core/integrations/apple-pay/ApplePaySessionMock.ts:12:46
 
   public static completePayment = () => true;
 
-  public static completeMerchantValidation = () => true;
+  public static completeMerchantValidation = () => undefined;
 
   public static completePaymentMethodSelection = () => true;

[Survived] BooleanLiteral
core/integrations/apple-pay/ApplePaySessionMock.ts:12:52
 
   public static completePayment = () => true;
 
-  public static completeMerchantValidation = () => true;
+  public static completeMerchantValidation = () => false;
 
   public static completePaymentMethodSelection = () => true;

[Survived] ArrowFunction
core/integrations/apple-pay/ApplePaySessionMock.ts:14:50
 
   public static completeMerchantValidation = () => true;
 
-  public static completePaymentMethodSelection = () => true;
+  public static completePaymentMethodSelection = () => undefined;
 
   public static begin() {

[Survived] BooleanLiteral
core/integrations/apple-pay/ApplePaySessionMock.ts:14:56
 
   public static completeMerchantValidation = () => true;
 
-  public static completePaymentMethodSelection = () => true;
+  public static completePaymentMethodSelection = () => false;
 
   public static begin() {

[Survived] BlockStatement
core/integrations/apple-pay/ApplePaySessionMock.ts:16:25
 
   public static completePaymentMethodSelection = () => true;
 
-  public static begin() {
-    return fetch(environment.APPLE_PAY_URLS.MOCK_DATA_URL)
-      .then((response: any) => {
-        return response.json();
-      })
-      .then((data: any) => {
-        this._handleResponse(data);
-      });
-  }
+  public static begin() {}
 
   private static _handleResponse(data: any) {

[Survived] BlockStatement
core/integrations/apple-pay/ApplePaySessionMock.ts:18:32
 
   public static begin() {
     return fetch(environment.APPLE_PAY_URLS.MOCK_DATA_URL)
-      .then((response: any) => {
-        return response.json();
-      })
+      .then((response: any) => {})
       .then((data: any) => {
         this._handleResponse(data);

[Survived] BlockStatement
core/integrations/apple-pay/ApplePaySessionMock.ts:21:28
       .then((response: any) => {
         return response.json();
       })
-      .then((data: any) => {
-        this._handleResponse(data);
-      });
+      .then((data: any) => {});
   }
 

[Survived] BlockStatement
core/integrations/apple-pay/ApplePaySessionMock.ts:26:45
       });
   }
 
-  private static _handleResponse(data: any) {
-    if (data.status === 'SUCCESS') {
-      this.STATUS_SUCCESS = data.status;
-      this.onpaymentauthorized(data);
-    } else {
-      this.STATUS_FAILURE = data.status;
-      this.oncancel(data);
-    }
-    return data;
-  }
+  private static _handleResponse(data: any) {}
 }
 

[Survived] ConditionalExpression
core/integrations/apple-pay/ApplePaySessionMock.ts:27:9
   }
 
   private static _handleResponse(data: any) {
-    if (data.status === 'SUCCESS') {
+    if (false) {
       this.STATUS_SUCCESS = data.status;
       this.onpaymentauthorized(data);

[Survived] EqualityOperator
core/integrations/apple-pay/ApplePaySessionMock.ts:27:9
   }
 
   private static _handleResponse(data: any) {
-    if (data.status === 'SUCCESS') {
+    if (data.status !== 'SUCCESS') {
       this.STATUS_SUCCESS = data.status;
       this.onpaymentauthorized(data);

[Survived] BlockStatement
core/integrations/apple-pay/ApplePaySessionMock.ts:30:12
     if (data.status === 'SUCCESS') {
       this.STATUS_SUCCESS = data.status;
       this.onpaymentauthorized(data);
-    } else {
-      this.STATUS_FAILURE = data.status;
-      this.oncancel(data);
-    }
+    } else {}
     return data;
   }
