[Survived] StringLiteral
core/integrations/cardinal-commerce/CardinalCommerce.ts:31:13
 @Service()
 export class CardinalCommerce {
   public static readonly UI_EVENTS = {
-    RENDER: 'ui.render',
+    RENDER: "",
     CLOSE: 'ui.close'
   };

[Survived] StringLiteral
core/integrations/cardinal-commerce/CardinalCommerce.ts:32:12
 export class CardinalCommerce {
   public static readonly UI_EVENTS = {
     RENDER: 'ui.render',
-    CLOSE: 'ui.close'
+    CLOSE: ""
   };
   private static readonly CARDINAL_VALIDATION_ERROR = 4000;

[Survived] BlockStatement
core/integrations/cardinal-commerce/CardinalCommerce.ts:51:5
     private tokenProvider: CardinalCommerceTokensProvider,
     private stTransport: StTransport,
     private cardinalProvider: CardinalProvider
-  ) {
-    this.destroy$ = this.messageBus.pipe(ofType(MessageBus.EVENTS_PUBLIC.DESTROY), mapTo(void 0));
-    this.cardinalValidated$ = new Subject<[IOnCardinalValidated, string]>();
-    this.cardinalValidatedWithoutValidationError$ = this.cardinalValidated$.pipe(
-      filter(data => data[0].ErrorNumber !== CardinalCommerce.CARDINAL_VALIDATION_ERROR)
-    );
-
-    this.cardinalValidatedWithoutValidationError$
-      .pipe(
-        map(data => data[0]),
-        filter(data => data.ActionCode === 'ERROR')
-      )
-      .subscribe(() => this.notification.error(COMMUNICATION_ERROR_INVALID_RESPONSE));
-  }
+  ) {}
 
   init(config: IConfig): Observable<ICardinal> {

[Survived] EqualityOperator
core/integrations/cardinal-commerce/CardinalCommerce.ts:55:22
     this.destroy$ = this.messageBus.pipe(ofType(MessageBus.EVENTS_PUBLIC.DESTROY), mapTo(void 0));
     this.cardinalValidated$ = new Subject<[IOnCardinalValidated, string]>();
     this.cardinalValidatedWithoutValidationError$ = this.cardinalValidated$.pipe(
-      filter(data => data[0].ErrorNumber !== CardinalCommerce.CARDINAL_VALIDATION_ERROR)
+      filter(data => data[0].ErrorNumber === CardinalCommerce.CARDINAL_VALIDATION_ERROR)
     );
 

[Survived] ArrowFunction
core/integrations/cardinal-commerce/CardinalCommerce.ts:55:14
     this.destroy$ = this.messageBus.pipe(ofType(MessageBus.EVENTS_PUBLIC.DESTROY), mapTo(void 0));
     this.cardinalValidated$ = new Subject<[IOnCardinalValidated, string]>();
     this.cardinalValidatedWithoutValidationError$ = this.cardinalValidated$.pipe(
-      filter(data => data[0].ErrorNumber !== CardinalCommerce.CARDINAL_VALIDATION_ERROR)
+      filter(() => undefined)
     );
 

[Survived] ArrowFunction
core/integrations/cardinal-commerce/CardinalCommerce.ts:60:13
 
     this.cardinalValidatedWithoutValidationError$
       .pipe(
-        map(data => data[0]),
+        map(() => undefined),
         filter(data => data.ActionCode === 'ERROR')
       )

[Survived] ConditionalExpression
core/integrations/cardinal-commerce/CardinalCommerce.ts:61:24
     this.cardinalValidatedWithoutValidationError$
       .pipe(
         map(data => data[0]),
-        filter(data => data.ActionCode === 'ERROR')
+        filter(data => false)
       )
       .subscribe(() => this.notification.error(COMMUNICATION_ERROR_INVALID_RESPONSE));

[Survived] EqualityOperator
core/integrations/cardinal-commerce/CardinalCommerce.ts:61:24
     this.cardinalValidatedWithoutValidationError$
       .pipe(
         map(data => data[0]),
-        filter(data => data.ActionCode === 'ERROR')
+        filter(data => data.ActionCode !== 'ERROR')
       )
       .subscribe(() => this.notification.error(COMMUNICATION_ERROR_INVALID_RESPONSE));

[Survived] ArrowFunction
core/integrations/cardinal-commerce/CardinalCommerce.ts:63:18
         map(data => data[0]),
         filter(data => data.ActionCode === 'ERROR')
       )
-      .subscribe(() => this.notification.error(COMMUNICATION_ERROR_INVALID_RESPONSE));
+      .subscribe(() => undefined);
   }
 

[Survived] BlockStatement
core/integrations/cardinal-commerce/CardinalCommerce.ts:66:48
       .subscribe(() => this.notification.error(COMMUNICATION_ERROR_INVALID_RESPONSE));
   }
 
-  init(config: IConfig): Observable<ICardinal> {
-    this.cardinal$ = this.acquireInitialCardinalCommerceTokens(config).pipe(
-      switchMap(tokens => this.setupCardinalCommerceLibrary(tokens, Boolean(config.livestatus))),
-      tap(cardinal => this._initSubscriptions(cardinal)),
-      tap(() => GoogleAnalytics.sendGaData('event', 'Cardinal', 'init', 'Cardinal Setup Completed')),
-      shareReplay(1)
-    );
-
-    return this.cardinal$;
-  }
+  init(config: IConfig): Observable<ICardinal> {}
 
   performThreeDQuery(

[Survived] ArrowFunction
core/integrations/cardinal-commerce/CardinalCommerce.ts:68:17
 
   init(config: IConfig): Observable<ICardinal> {
     this.cardinal$ = this.acquireInitialCardinalCommerceTokens(config).pipe(
-      switchMap(tokens => this.setupCardinalCommerceLibrary(tokens, Boolean(config.livestatus))),
+      switchMap(() => undefined),
       tap(cardinal => this._initSubscriptions(cardinal)),
       tap(() => GoogleAnalytics.sendGaData('event', 'Cardinal', 'init', 'Cardinal Setup Completed')),

[Survived] ArrowFunction
core/integrations/cardinal-commerce/CardinalCommerce.ts:69:11
   init(config: IConfig): Observable<ICardinal> {
     this.cardinal$ = this.acquireInitialCardinalCommerceTokens(config).pipe(
       switchMap(tokens => this.setupCardinalCommerceLibrary(tokens, Boolean(config.livestatus))),
-      tap(cardinal => this._initSubscriptions(cardinal)),
+      tap(() => undefined),
       tap(() => GoogleAnalytics.sendGaData('event', 'Cardinal', 'init', 'Cardinal Setup Completed')),
       shareReplay(1)

[Survived] ArrowFunction
core/integrations/cardinal-commerce/CardinalCommerce.ts:70:11
     this.cardinal$ = this.acquireInitialCardinalCommerceTokens(config).pipe(
       switchMap(tokens => this.setupCardinalCommerceLibrary(tokens, Boolean(config.livestatus))),
       tap(cardinal => this._initSubscriptions(cardinal)),
-      tap(() => GoogleAnalytics.sendGaData('event', 'Cardinal', 'init', 'Cardinal Setup Completed')),
+      tap(() => undefined),
       shareReplay(1)
     );

[Survived] StringLiteral
core/integrations/cardinal-commerce/CardinalCommerce.ts:70:44
     this.cardinal$ = this.acquireInitialCardinalCommerceTokens(config).pipe(
       switchMap(tokens => this.setupCardinalCommerceLibrary(tokens, Boolean(config.livestatus))),
       tap(cardinal => this._initSubscriptions(cardinal)),
-      tap(() => GoogleAnalytics.sendGaData('event', 'Cardinal', 'init', 'Cardinal Setup Completed')),
+      tap(() => GoogleAnalytics.sendGaData("", 'Cardinal', 'init', 'Cardinal Setup Completed')),
       shareReplay(1)
     );

[Survived] BlockStatement
core/integrations/cardinal-commerce/CardinalCommerce.ts:81:44
     requestTypes: string[],
     card: ICard,
     merchantData: IMerchantData
-  ): Observable<IAuthorizePaymentResponse> {
-    const threeDQueryRequestBody = {
-      cachetoken: this.cardinalTokens.cacheToken,
-      requesttypedescriptions: requestTypes,
-      termurl: 'https://termurl.com', // TODO this shouldn't be needed but currently the backend needs this
-      ...merchantData,
-      ...card
-    };
-
-    return this.cardinal$.pipe(
-      switchMap(cardinal => this.startTransaction(cardinal, this.cardinalTokens.jwt)),
-      switchMap(() => from(this.stTransport.sendRequest(threeDQueryRequestBody))),
-      tap((response: { response: IThreeDQueryResponse }) => (this.stTransport._threeDQueryResult = response)),
-      switchMap((response: { response: IThreeDQueryResponse }) => this._authenticateCard(response.response)),
-      tap(() => GoogleAnalytics.sendGaData('event', 'Cardinal', 'auth', 'Cardinal auth completed')),
-      map(jwt => ({
-        threedresponse: jwt,
-        cachetoken: this.cardinalTokens.cacheToken
-      }))
-    );
-  }
+  ): Observable<IAuthorizePaymentResponse> {}
 
   private acquireInitialCardinalCommerceTokens(config: IConfig): Observable<ICardinalCommerceTokens> {

[Survived] ObjectLiteral
core/integrations/cardinal-commerce/CardinalCommerce.ts:82:36
     card: ICard,
     merchantData: IMerchantData
   ): Observable<IAuthorizePaymentResponse> {
-    const threeDQueryRequestBody = {
-      cachetoken: this.cardinalTokens.cacheToken,
-      requesttypedescriptions: requestTypes,
-      termurl: 'https://termurl.com', // TODO this shouldn't be needed but currently the backend needs this
-      ...merchantData,
-      ...card
-    };
+    const threeDQueryRequestBody = {};
 
     return this.cardinal$.pipe(

[Survived] ArrowFunction
core/integrations/cardinal-commerce/CardinalCommerce.ts:91:17
     };
 
     return this.cardinal$.pipe(
-      switchMap(cardinal => this.startTransaction(cardinal, this.cardinalTokens.jwt)),
+      switchMap(() => undefined),
       switchMap(() => from(this.stTransport.sendRequest(threeDQueryRequestBody))),
       tap((response: { response: IThreeDQueryResponse }) => (this.stTransport._threeDQueryResult = response)),

[Survived] ArrowFunction
core/integrations/cardinal-commerce/CardinalCommerce.ts:92:17
 
     return this.cardinal$.pipe(
       switchMap(cardinal => this.startTransaction(cardinal, this.cardinalTokens.jwt)),
-      switchMap(() => from(this.stTransport.sendRequest(threeDQueryRequestBody))),
+      switchMap(() => undefined),
       tap((response: { response: IThreeDQueryResponse }) => (this.stTransport._threeDQueryResult = response)),
       switchMap((response: { response: IThreeDQueryResponse }) => this._authenticateCard(response.response)),

[Survived] ArrowFunction
core/integrations/cardinal-commerce/CardinalCommerce.ts:93:11
     return this.cardinal$.pipe(
       switchMap(cardinal => this.startTransaction(cardinal, this.cardinalTokens.jwt)),
       switchMap(() => from(this.stTransport.sendRequest(threeDQueryRequestBody))),
-      tap((response: { response: IThreeDQueryResponse }) => (this.stTransport._threeDQueryResult = response)),
+      tap(() => undefined),
       switchMap((response: { response: IThreeDQueryResponse }) => this._authenticateCard(response.response)),
       tap(() => GoogleAnalytics.sendGaData('event', 'Cardinal', 'auth', 'Cardinal auth completed')),

[Survived] ArrowFunction
core/integrations/cardinal-commerce/CardinalCommerce.ts:94:17
       switchMap(cardinal => this.startTransaction(cardinal, this.cardinalTokens.jwt)),
       switchMap(() => from(this.stTransport.sendRequest(threeDQueryRequestBody))),
       tap((response: { response: IThreeDQueryResponse }) => (this.stTransport._threeDQueryResult = response)),
-      switchMap((response: { response: IThreeDQueryResponse }) => this._authenticateCard(response.response)),
+      switchMap(() => undefined),
       tap(() => GoogleAnalytics.sendGaData('event', 'Cardinal', 'auth', 'Cardinal auth completed')),
       map(jwt => ({

[Survived] ArrowFunction
core/integrations/cardinal-commerce/CardinalCommerce.ts:95:11
       switchMap(() => from(this.stTransport.sendRequest(threeDQueryRequestBody))),
       tap((response: { response: IThreeDQueryResponse }) => (this.stTransport._threeDQueryResult = response)),
       switchMap((response: { response: IThreeDQueryResponse }) => this._authenticateCard(response.response)),
-      tap(() => GoogleAnalytics.sendGaData('event', 'Cardinal', 'auth', 'Cardinal auth completed')),
+      tap(() => undefined),
       map(jwt => ({
         threedresponse: jwt,

[Survived] StringLiteral
core/integrations/cardinal-commerce/CardinalCommerce.ts:95:53
       switchMap(() => from(this.stTransport.sendRequest(threeDQueryRequestBody))),
       tap((response: { response: IThreeDQueryResponse }) => (this.stTransport._threeDQueryResult = response)),
       switchMap((response: { response: IThreeDQueryResponse }) => this._authenticateCard(response.response)),
-      tap(() => GoogleAnalytics.sendGaData('event', 'Cardinal', 'auth', 'Cardinal auth completed')),
+      tap(() => GoogleAnalytics.sendGaData('event', "", 'auth', 'Cardinal auth completed')),
       map(jwt => ({
         threedresponse: jwt,

[Survived] ArrowFunction
core/integrations/cardinal-commerce/CardinalCommerce.ts:96:11
       tap((response: { response: IThreeDQueryResponse }) => (this.stTransport._threeDQueryResult = response)),
       switchMap((response: { response: IThreeDQueryResponse }) => this._authenticateCard(response.response)),
       tap(() => GoogleAnalytics.sendGaData('event', 'Cardinal', 'auth', 'Cardinal auth completed')),
-      map(jwt => ({
-        threedresponse: jwt,
-        cachetoken: this.cardinalTokens.cacheToken
-      }))
+      map(() => undefined)
     );
   }

[Survived] BlockStatement
core/integrations/cardinal-commerce/CardinalCommerce.ts:103:102
     );
   }
 
-  private acquireInitialCardinalCommerceTokens(config: IConfig): Observable<ICardinalCommerceTokens> {
-    const { threedinit, cachetoken } = config.init;
-
-    if (threedinit && cachetoken) {
-      return of((this.cardinalTokens = { jwt: threedinit, cacheToken: cachetoken }));
-    }
-
-    return this.acquireCardinalCommerceTokens();
-  }
+  private acquireInitialCardinalCommerceTokens(config: IConfig): Observable<ICardinalCommerceTokens> {}
 
   private acquireCardinalCommerceTokens(): Observable<ICardinalCommerceTokens> {

[Survived] BlockStatement
core/integrations/cardinal-commerce/CardinalCommerce.ts:106:35
   private acquireInitialCardinalCommerceTokens(config: IConfig): Observable<ICardinalCommerceTokens> {
     const { threedinit, cachetoken } = config.init;
 
-    if (threedinit && cachetoken) {
-      return of((this.cardinalTokens = { jwt: threedinit, cacheToken: cachetoken }));
-    }
+    if (threedinit && cachetoken) {}
 
     return this.acquireCardinalCommerceTokens();

[Survived] LogicalOperator
core/integrations/cardinal-commerce/CardinalCommerce.ts:106:9
   private acquireInitialCardinalCommerceTokens(config: IConfig): Observable<ICardinalCommerceTokens> {
     const { threedinit, cachetoken } = config.init;
 
-    if (threedinit && cachetoken) {
+    if (threedinit || cachetoken) {
       return of((this.cardinalTokens = { jwt: threedinit, cacheToken: cachetoken }));
     }

[Survived] ObjectLiteral
core/integrations/cardinal-commerce/CardinalCommerce.ts:107:40
     const { threedinit, cachetoken } = config.init;
 
     if (threedinit && cachetoken) {
-      return of((this.cardinalTokens = { jwt: threedinit, cacheToken: cachetoken }));
+      return of((this.cardinalTokens = {}));
     }
 

[Survived] BlockStatement
core/integrations/cardinal-commerce/CardinalCommerce.ts:113:80
     return this.acquireCardinalCommerceTokens();
   }
 
-  private acquireCardinalCommerceTokens(): Observable<ICardinalCommerceTokens> {
-    return this.tokenProvider.getTokens().pipe(
-      tap(tokens => (this.cardinalTokens = tokens)),
-      tap(tokens =>
-        this.messageBus.publish({
-          type: MessageBus.EVENTS_PUBLIC.CARDINAL_COMMERCE_TOKENS_ACQUIRED,
-          data: tokens
-        })
-      )
-    );
-  }
+  private acquireCardinalCommerceTokens(): Observable<ICardinalCommerceTokens> {}
 
   private setupCardinalCommerceLibrary(tokens: ICardinalCommerceTokens, liveStatus: boolean): Observable<ICardinal> {

[Survived] ArrowFunction
core/integrations/cardinal-commerce/CardinalCommerce.ts:115:11
 
   private acquireCardinalCommerceTokens(): Observable<ICardinalCommerceTokens> {
     return this.tokenProvider.getTokens().pipe(
-      tap(tokens => (this.cardinalTokens = tokens)),
+      tap(() => undefined),
       tap(tokens =>
         this.messageBus.publish({

[Survived] ArrowFunction
core/integrations/cardinal-commerce/CardinalCommerce.ts:116:11
   private acquireCardinalCommerceTokens(): Observable<ICardinalCommerceTokens> {
     return this.tokenProvider.getTokens().pipe(
       tap(tokens => (this.cardinalTokens = tokens)),
-      tap(tokens =>
-        this.messageBus.publish({
-          type: MessageBus.EVENTS_PUBLIC.CARDINAL_COMMERCE_TOKENS_ACQUIRED,
-          data: tokens
-        })
+      tap(() => undefined
       )
     );

[Survived] ObjectLiteral
core/integrations/cardinal-commerce/CardinalCommerce.ts:117:33
     return this.tokenProvider.getTokens().pipe(
       tap(tokens => (this.cardinalTokens = tokens)),
       tap(tokens =>
-        this.messageBus.publish({
-          type: MessageBus.EVENTS_PUBLIC.CARDINAL_COMMERCE_TOKENS_ACQUIRED,
-          data: tokens
-        })
+        this.messageBus.publish({})
       )
     );

[Survived] BlockStatement
core/integrations/cardinal-commerce/CardinalCommerce.ts:127:29
 
   private setupCardinalCommerceLibrary(tokens: ICardinalCommerceTokens, liveStatus: boolean): Observable<ICardinal> {
     return this.cardinalProvider.getCardinal$(liveStatus).pipe(
-      switchMap(cardinal => {
-        cardinal.configure(environment.CARDINAL_COMMERCE.CONFIG);
-
-        cardinal.on(CardinalCommerce.UI_EVENTS.RENDER, () => {
-          this.messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CONTROL_FRAME_SHOW }, true);
-        });
-        cardinal.on(CardinalCommerce.UI_EVENTS.CLOSE, () => {
-          this.messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CONTROL_FRAME_HIDE }, true);
-        });
-        cardinal.on(PaymentEvents.VALIDATED, (data: IOnCardinalValidated, jwt: string) => {
-          this.cardinalValidated$.next([data, jwt]);
-        });
-
-        return new Observable<ICardinal>(observer => {
-          cardinal.on(PaymentEvents.SETUP_COMPLETE, () => {
-            observer.next(cardinal);
-            observer.complete();
-            this.messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.UNLOCK_BUTTON }, true);
-          });
-
-          cardinal.setup(PaymentEvents.INIT, {
-            jwt: tokens.jwt
-          });
-        });
-      })
+      switchMap(cardinal => {})
     );
   }

[Survived] BlockStatement
core/integrations/cardinal-commerce/CardinalCommerce.ts:130:62
       switchMap(cardinal => {
         cardinal.configure(environment.CARDINAL_COMMERCE.CONFIG);
 
-        cardinal.on(CardinalCommerce.UI_EVENTS.RENDER, () => {
-          this.messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CONTROL_FRAME_SHOW }, true);
-        });
+        cardinal.on(CardinalCommerce.UI_EVENTS.RENDER, () => {});
         cardinal.on(CardinalCommerce.UI_EVENTS.CLOSE, () => {
           this.messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CONTROL_FRAME_HIDE }, true);

[Survived] BooleanLiteral
core/integrations/cardinal-commerce/CardinalCommerce.ts:131:90
         cardinal.configure(environment.CARDINAL_COMMERCE.CONFIG);
 
         cardinal.on(CardinalCommerce.UI_EVENTS.RENDER, () => {
-          this.messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CONTROL_FRAME_SHOW }, true);
+          this.messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CONTROL_FRAME_SHOW }, false);
         });
         cardinal.on(CardinalCommerce.UI_EVENTS.CLOSE, () => {

[Survived] ObjectLiteral
core/integrations/cardinal-commerce/CardinalCommerce.ts:131:35
         cardinal.configure(environment.CARDINAL_COMMERCE.CONFIG);
 
         cardinal.on(CardinalCommerce.UI_EVENTS.RENDER, () => {
-          this.messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CONTROL_FRAME_SHOW }, true);
+          this.messageBus.publish({}, true);
         });
         cardinal.on(CardinalCommerce.UI_EVENTS.CLOSE, () => {

[Survived] BlockStatement
core/integrations/cardinal-commerce/CardinalCommerce.ts:133:61
         cardinal.on(CardinalCommerce.UI_EVENTS.RENDER, () => {
           this.messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CONTROL_FRAME_SHOW }, true);
         });
-        cardinal.on(CardinalCommerce.UI_EVENTS.CLOSE, () => {
-          this.messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CONTROL_FRAME_HIDE }, true);
-        });
+        cardinal.on(CardinalCommerce.UI_EVENTS.CLOSE, () => {});
         cardinal.on(PaymentEvents.VALIDATED, (data: IOnCardinalValidated, jwt: string) => {
           this.cardinalValidated$.next([data, jwt]);

[Survived] BooleanLiteral
core/integrations/cardinal-commerce/CardinalCommerce.ts:134:90
           this.messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CONTROL_FRAME_SHOW }, true);
         });
         cardinal.on(CardinalCommerce.UI_EVENTS.CLOSE, () => {
-          this.messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CONTROL_FRAME_HIDE }, true);
+          this.messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CONTROL_FRAME_HIDE }, false);
         });
         cardinal.on(PaymentEvents.VALIDATED, (data: IOnCardinalValidated, jwt: string) => {

[Survived] ObjectLiteral
core/integrations/cardinal-commerce/CardinalCommerce.ts:134:35
           this.messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CONTROL_FRAME_SHOW }, true);
         });
         cardinal.on(CardinalCommerce.UI_EVENTS.CLOSE, () => {
-          this.messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CONTROL_FRAME_HIDE }, true);
+          this.messageBus.publish({}, true);
         });
         cardinal.on(PaymentEvents.VALIDATED, (data: IOnCardinalValidated, jwt: string) => {

[Survived] BlockStatement
core/integrations/cardinal-commerce/CardinalCommerce.ts:136:91
         cardinal.on(CardinalCommerce.UI_EVENTS.CLOSE, () => {
           this.messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CONTROL_FRAME_HIDE }, true);
         });
-        cardinal.on(PaymentEvents.VALIDATED, (data: IOnCardinalValidated, jwt: string) => {
-          this.cardinalValidated$.next([data, jwt]);
-        });
+        cardinal.on(PaymentEvents.VALIDATED, (data: IOnCardinalValidated, jwt: string) => {});
 
         return new Observable<ICardinal>(observer => {

[Survived] BlockStatement
core/integrations/cardinal-commerce/CardinalCommerce.ts:140:54
           this.cardinalValidated$.next([data, jwt]);
         });
 
-        return new Observable<ICardinal>(observer => {
-          cardinal.on(PaymentEvents.SETUP_COMPLETE, () => {
-            observer.next(cardinal);
-            observer.complete();
-            this.messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.UNLOCK_BUTTON }, true);
-          });
-
-          cardinal.setup(PaymentEvents.INIT, {
-            jwt: tokens.jwt
-          });
-        });
+        return new Observable<ICardinal>(observer => {});
       })
     );

[Survived] BlockStatement
core/integrations/cardinal-commerce/CardinalCommerce.ts:141:59
         });
 
         return new Observable<ICardinal>(observer => {
-          cardinal.on(PaymentEvents.SETUP_COMPLETE, () => {
-            observer.next(cardinal);
-            observer.complete();
-            this.messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.UNLOCK_BUTTON }, true);
-          });
+          cardinal.on(PaymentEvents.SETUP_COMPLETE, () => {});
 
           cardinal.setup(PaymentEvents.INIT, {

[Survived] BooleanLiteral
core/integrations/cardinal-commerce/CardinalCommerce.ts:144:87
           cardinal.on(PaymentEvents.SETUP_COMPLETE, () => {
             observer.next(cardinal);
             observer.complete();
-            this.messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.UNLOCK_BUTTON }, true);
+            this.messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.UNLOCK_BUTTON }, false);
           });
 

[Survived] ObjectLiteral
core/integrations/cardinal-commerce/CardinalCommerce.ts:144:37
           cardinal.on(PaymentEvents.SETUP_COMPLETE, () => {
             observer.next(cardinal);
             observer.complete();
-            this.messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.UNLOCK_BUTTON }, true);
+            this.messageBus.publish({}, true);
           });
 

[Survived] ObjectLiteral
core/integrations/cardinal-commerce/CardinalCommerce.ts:147:46
             this.messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.UNLOCK_BUTTON }, true);
           });
 
-          cardinal.setup(PaymentEvents.INIT, {
-            jwt: tokens.jwt
-          });
+          cardinal.setup(PaymentEvents.INIT, {});
         });
       })

[Survived] BlockStatement
core/integrations/cardinal-commerce/CardinalCommerce.ts:155:80
     );
   }
 
-  private startTransaction(cardinal: ICardinal, jwt: string): Observable<void> {
-    return new Observable(observer => {
-      this.cardinalValidated$
-        .pipe(
-          filter(data => data[0].ErrorNumber === CardinalCommerce.CARDINAL_VALIDATION_ERROR),
-          first(),
-          mapTo(undefined)
-        )
-        .subscribe(observer);
-
-      cardinal.start(PaymentBrand, {}, jwt);
-    });
-  }
+  private startTransaction(cardinal: ICardinal, jwt: string): Observable<void> {}
 
   private _authenticateCard(responseObject: IThreeDQueryResponse): Observable<string | undefined> {

[Survived] BlockStatement
core/integrations/cardinal-commerce/CardinalCommerce.ts:156:39
   }
 
   private startTransaction(cardinal: ICardinal, jwt: string): Observable<void> {
-    return new Observable(observer => {
-      this.cardinalValidated$
-        .pipe(
-          filter(data => data[0].ErrorNumber === CardinalCommerce.CARDINAL_VALIDATION_ERROR),
-          first(),
-          mapTo(undefined)
-        )
-        .subscribe(observer);
-
-      cardinal.start(PaymentBrand, {}, jwt);
-    });
+    return new Observable(observer => {});
   }
 

[Survived] ArrowFunction
core/integrations/cardinal-commerce/CardinalCommerce.ts:159:18
     return new Observable(observer => {
       this.cardinalValidated$
         .pipe(
-          filter(data => data[0].ErrorNumber === CardinalCommerce.CARDINAL_VALIDATION_ERROR),
+          filter(() => undefined),
           first(),
           mapTo(undefined)

[Survived] ConditionalExpression
core/integrations/cardinal-commerce/CardinalCommerce.ts:159:26
     return new Observable(observer => {
       this.cardinalValidated$
         .pipe(
-          filter(data => data[0].ErrorNumber === CardinalCommerce.CARDINAL_VALIDATION_ERROR),
+          filter(data => false),
           first(),
           mapTo(undefined)

[Survived] EqualityOperator
core/integrations/cardinal-commerce/CardinalCommerce.ts:170:46
   }
 
   private _authenticateCard(responseObject: IThreeDQueryResponse): Observable<string | undefined> {
-    const isCardEnrolledAndNotFrictionless = responseObject.enrolled === 'Y' && responseObject.acsurl !== undefined;
+    const isCardEnrolledAndNotFrictionless = responseObject.enrolled !== 'Y' && responseObject.acsurl !== undefined;
 
     if (!isCardEnrolledAndNotFrictionless) {

[Survived] LogicalOperator
core/integrations/cardinal-commerce/CardinalCommerce.ts:170:46
   }
 
   private _authenticateCard(responseObject: IThreeDQueryResponse): Observable<string | undefined> {
-    const isCardEnrolledAndNotFrictionless = responseObject.enrolled === 'Y' && responseObject.acsurl !== undefined;
+    const isCardEnrolledAndNotFrictionless = responseObject.enrolled === 'Y' || responseObject.acsurl !== undefined;
 
     if (!isCardEnrolledAndNotFrictionless) {

[Survived] ConditionalExpression
core/integrations/cardinal-commerce/CardinalCommerce.ts:172:9
   private _authenticateCard(responseObject: IThreeDQueryResponse): Observable<string | undefined> {
     const isCardEnrolledAndNotFrictionless = responseObject.enrolled === 'Y' && responseObject.acsurl !== undefined;
 
-    if (!isCardEnrolledAndNotFrictionless) {
+    if (true) {
       return of(undefined);
     }

[Survived] ConditionalExpression
core/integrations/cardinal-commerce/CardinalCommerce.ts:172:9
   private _authenticateCard(responseObject: IThreeDQueryResponse): Observable<string | undefined> {
     const isCardEnrolledAndNotFrictionless = responseObject.enrolled === 'Y' && responseObject.acsurl !== undefined;
 
-    if (!isCardEnrolledAndNotFrictionless) {
+    if (false) {
       return of(undefined);
     }

[Survived] BlockStatement
core/integrations/cardinal-commerce/CardinalCommerce.ts:176:55
       return of(undefined);
     }
 
-    const cardinalContinue = (cardinal: ICardinal) => {
-      cardinal.continue(
-        PaymentBrand,
-        {
-          AcsUrl: responseObject.acsurl,
-          Payload: responseObject.threedpayload
-        },
-        {
-          Cart: [],
-          OrderDetails: {
-            TransactionId: responseObject.acquirertransactionreference
-          }
-        },
-        this.cardinalTokens.jwt
-      );
-    };
+    const cardinalContinue = (cardinal: ICardinal) => {};
 
     return this.cardinal$.pipe(

[Survived] ObjectLiteral
core/integrations/cardinal-commerce/CardinalCommerce.ts:185:25
         },
         {
           Cart: [],
-          OrderDetails: {
-            TransactionId: responseObject.acquirertransactionreference
-          }
+          OrderDetails: {}
         },
         this.cardinalTokens.jwt

[Survived] ArrowFunction
core/integrations/cardinal-commerce/CardinalCommerce.ts:194:11
     };
 
     return this.cardinal$.pipe(
-      tap(cardinal => cardinalContinue(cardinal)),
+      tap(() => undefined),
       tap(() => GoogleAnalytics.sendGaData('event', 'Cardinal', 'auth', 'Cardinal card authenticated')),
       switchMap(() => this.cardinalValidatedWithoutValidationError$.pipe(first())),

[Survived] ArrowFunction
core/integrations/cardinal-commerce/CardinalCommerce.ts:195:11
 
     return this.cardinal$.pipe(
       tap(cardinal => cardinalContinue(cardinal)),
-      tap(() => GoogleAnalytics.sendGaData('event', 'Cardinal', 'auth', 'Cardinal card authenticated')),
+      tap(() => undefined),
       switchMap(() => this.cardinalValidatedWithoutValidationError$.pipe(first())),
       switchMap(([validationResult, jwt]: [IOnCardinalValidated, string]) => {
