[Survived] ArrowFunction
core/integrations/cardinal-commerce/CardinalCommerce.ts:196:17
     return this.cardinal$.pipe(
       tap(cardinal => cardinalContinue(cardinal)),
       tap(() => GoogleAnalytics.sendGaData('event', 'Cardinal', 'auth', 'Cardinal card authenticated')),
-      switchMap(() => this.cardinalValidatedWithoutValidationError$.pipe(first())),
+      switchMap(() => undefined),
       switchMap(([validationResult, jwt]: [IOnCardinalValidated, string]) => {
         if (

[Survived] BlockStatement
core/integrations/cardinal-commerce/CardinalCommerce.ts:197:78
       tap(cardinal => cardinalContinue(cardinal)),
       tap(() => GoogleAnalytics.sendGaData('event', 'Cardinal', 'auth', 'Cardinal card authenticated')),
       switchMap(() => this.cardinalValidatedWithoutValidationError$.pipe(first())),
-      switchMap(([validationResult, jwt]: [IOnCardinalValidated, string]) => {
-        if (
-          !CardinalCommerceValidationStatus.includes(validationResult.ActionCode) ||
-          validationResult.ActionCode === 'FAILURE'
-        ) {
-          StCodec.publishResponse(
-            this.stTransport._threeDQueryResult.response,
-            this.stTransport._threeDQueryResult.jwt,
-            jwt
-          );
-          return throwError(validationResult);
-        }
-
-        return of(jwt);
-      })
+      switchMap(([validationResult, jwt]: [IOnCardinalValidated, string]) => {})
     );
   }

[Survived] LogicalOperator
core/integrations/cardinal-commerce/CardinalCommerce.ts:199:11
       switchMap(() => this.cardinalValidatedWithoutValidationError$.pipe(first())),
       switchMap(([validationResult, jwt]: [IOnCardinalValidated, string]) => {
         if (
-          !CardinalCommerceValidationStatus.includes(validationResult.ActionCode) ||
-          validationResult.ActionCode === 'FAILURE'
+          !CardinalCommerceValidationStatus.includes(validationResult.ActionCode) && validationResult.ActionCode === 'FAILURE'
         ) {
           StCodec.publishResponse(

[Survived] BooleanLiteral
core/integrations/cardinal-commerce/CardinalCommerce.ts:199:11
       switchMap(() => this.cardinalValidatedWithoutValidationError$.pipe(first())),
       switchMap(([validationResult, jwt]: [IOnCardinalValidated, string]) => {
         if (
-          !CardinalCommerceValidationStatus.includes(validationResult.ActionCode) ||
+          CardinalCommerceValidationStatus.includes(validationResult.ActionCode) ||
           validationResult.ActionCode === 'FAILURE'
         ) {

[Survived] ConditionalExpression
core/integrations/cardinal-commerce/CardinalCommerce.ts:200:11
       switchMap(([validationResult, jwt]: [IOnCardinalValidated, string]) => {
         if (
           !CardinalCommerceValidationStatus.includes(validationResult.ActionCode) ||
-          validationResult.ActionCode === 'FAILURE'
+          false
         ) {
           StCodec.publishResponse(

[Survived] EqualityOperator
core/integrations/cardinal-commerce/CardinalCommerce.ts:200:11
       switchMap(([validationResult, jwt]: [IOnCardinalValidated, string]) => {
         if (
           !CardinalCommerceValidationStatus.includes(validationResult.ActionCode) ||
-          validationResult.ActionCode === 'FAILURE'
+          validationResult.ActionCode !== 'FAILURE'
         ) {
           StCodec.publishResponse(

[Survived] BlockStatement
core/integrations/cardinal-commerce/CardinalCommerce.ts:201:11
         if (
           !CardinalCommerceValidationStatus.includes(validationResult.ActionCode) ||
           validationResult.ActionCode === 'FAILURE'
-        ) {
-          StCodec.publishResponse(
-            this.stTransport._threeDQueryResult.response,
-            this.stTransport._threeDQueryResult.jwt,
-            jwt
-          );
-          return throwError(validationResult);
-        }
+        ) {}
 
         return of(jwt);

[Survived] BlockStatement
core/integrations/cardinal-commerce/CardinalCommerce.ts:215:57
     );
   }
 
-  private _initSubscriptions(cardinal: ICardinal): void {
-    this.messageBus
-      .pipe(
-        ofType(MessageBus.EVENTS_PUBLIC.UPDATE_JWT),
-        switchMap(() => this.acquireCardinalCommerceTokens()),
-        takeUntil(this.destroy$)
-      )
-      .subscribe();
-
-    this.messageBus
-      .pipe(ofType(MessageBus.EVENTS_PUBLIC.BIN_PROCESS), takeUntil(this.destroy$))
-      .subscribe((event: IMessageBusEvent<string>) => cardinal.trigger(PaymentEvents.BIN_PROCESS, event.data));
-
-    this.destroy$.subscribe(() => {
-      cardinal.off(PaymentEvents.SETUP_COMPLETE);
-      cardinal.off(PaymentEvents.VALIDATED);
-      cardinal.off(CardinalCommerce.UI_EVENTS.RENDER);
-      cardinal.off(CardinalCommerce.UI_EVENTS.CLOSE);
-    });
-  }
+  private _initSubscriptions(cardinal: ICardinal): void {}
 }
 

[Survived] ArrowFunction
core/integrations/cardinal-commerce/CardinalCommerce.ts:219:19
     this.messageBus
       .pipe(
         ofType(MessageBus.EVENTS_PUBLIC.UPDATE_JWT),
-        switchMap(() => this.acquireCardinalCommerceTokens()),
+        switchMap(() => undefined),
         takeUntil(this.destroy$)
       )

[Survived] ArrowFunction
core/integrations/cardinal-commerce/CardinalCommerce.ts:226:18
 
     this.messageBus
       .pipe(ofType(MessageBus.EVENTS_PUBLIC.BIN_PROCESS), takeUntil(this.destroy$))
-      .subscribe((event: IMessageBusEvent<string>) => cardinal.trigger(PaymentEvents.BIN_PROCESS, event.data));
+      .subscribe(() => undefined);
 
     this.destroy$.subscribe(() => {

[Survived] BlockStatement
core/integrations/cardinal-commerce/CardinalCommerce.ts:228:35
       .pipe(ofType(MessageBus.EVENTS_PUBLIC.BIN_PROCESS), takeUntil(this.destroy$))
       .subscribe((event: IMessageBusEvent<string>) => cardinal.trigger(PaymentEvents.BIN_PROCESS, event.data));
 
-    this.destroy$.subscribe(() => {
-      cardinal.off(PaymentEvents.SETUP_COMPLETE);
-      cardinal.off(PaymentEvents.VALIDATED);
-      cardinal.off(CardinalCommerce.UI_EVENTS.RENDER);
-      cardinal.off(CardinalCommerce.UI_EVENTS.CLOSE);
-    });
+    this.destroy$.subscribe(() => {});
   }
 }
