[Survived] BlockStatement
core/integrations/cardinal-commerce/CardinalCommerceTokensProvider.ts:14:52
 export class CardinalCommerceTokensProvider {
   constructor(private stTransport: StTransport, private messageBus: MessageBus) {}
 
-  getTokens(): Observable<ICardinalCommerceTokens> {
-    return this.performThreeDInitRequest().pipe(
-      tap((response: IThreeDInitResponse) =>
-        this.messageBus.publish({
-          data: response,
-          type: MessageBus.EVENTS_PUBLIC.JSINIT_RESPONSE
-        })
-      ),
-      map(response => ({ cacheToken: response.cachetoken, jwt: response.threedinit }))
-    );
-  }
+  getTokens(): Observable<ICardinalCommerceTokens> {}
 
   private performThreeDInitRequest(): Observable<IThreeDInitResponse> {

[Survived] ArrowFunction
core/integrations/cardinal-commerce/CardinalCommerceTokensProvider.ts:16:11
 
   getTokens(): Observable<ICardinalCommerceTokens> {
     return this.performThreeDInitRequest().pipe(
-      tap((response: IThreeDInitResponse) =>
-        this.messageBus.publish({
-          data: response,
-          type: MessageBus.EVENTS_PUBLIC.JSINIT_RESPONSE
-        })
+      tap(() => undefined
       ),
       map(response => ({ cacheToken: response.cachetoken, jwt: response.threedinit }))

[Survived] ArrowFunction
core/integrations/cardinal-commerce/CardinalCommerceTokensProvider.ts:22:11
           type: MessageBus.EVENTS_PUBLIC.JSINIT_RESPONSE
         })
       ),
-      map(response => ({ cacheToken: response.cachetoken, jwt: response.threedinit }))
+      map(() => undefined)
     );
   }

[Survived] ObjectLiteral
core/integrations/cardinal-commerce/CardinalCommerceTokensProvider.ts:22:24
           type: MessageBus.EVENTS_PUBLIC.JSINIT_RESPONSE
         })
       ),
-      map(response => ({ cacheToken: response.cachetoken, jwt: response.threedinit }))
+      map(response => ({}))
     );
   }

[Survived] BlockStatement
core/integrations/cardinal-commerce/CardinalCommerceTokensProvider.ts:26:71
     );
   }
 
-  private performThreeDInitRequest(): Observable<IThreeDInitResponse> {
-    return from(this.stTransport.sendRequest(new ThreeDInitRequest())).pipe(
-      map((result: { jwt: string; response: IThreeDInitResponse }) => result.response)
-    );
-  }
+  private performThreeDInitRequest(): Observable<IThreeDInitResponse> {}
 }
 

[Survived] ArrowFunction
core/integrations/cardinal-commerce/CardinalCommerceTokensProvider.ts:28:11
 
   private performThreeDInitRequest(): Observable<IThreeDInitResponse> {
     return from(this.stTransport.sendRequest(new ThreeDInitRequest())).pipe(
-      map((result: { jwt: string; response: IThreeDInitResponse }) => result.response)
+      map(() => undefined)
     );
   }
