[Survived] StringLiteral
core/integrations/cardinal-commerce/CardinalProvider.ts:13:39
 
 @Service()
 export class CardinalProvider implements ICardinalProvider {
-  private static readonly SCRIPT_ID = 'cardinalCommerce';
+  private static readonly SCRIPT_ID = "";
 
   getCardinal$(liveStatus: boolean): Observable<ICardinal> {

[Survived] BlockStatement
core/integrations/cardinal-commerce/CardinalProvider.ts:15:60
 export class CardinalProvider implements ICardinalProvider {
   private static readonly SCRIPT_ID = 'cardinalCommerce';
 
-  getCardinal$(liveStatus: boolean): Observable<ICardinal> {
-    const sdkAddress = liveStatus
-      ? environment.CARDINAL_COMMERCE.SONGBIRD_LIVE_URL
-      : environment.CARDINAL_COMMERCE.SONGBIRD_TEST_URL;
-
-    const scriptOptions = {
-      src: sdkAddress,
-      id: CardinalProvider.SCRIPT_ID
-    };
-
-    return from(DomMethods.insertScript('head', scriptOptions)).pipe(
-      switchMap(
-        () =>
-          interval().pipe(
-            // @ts-ignore
-            map(() => window.Cardinal),
-            filter(Boolean),
-            first()
-          ) as Observable<ICardinal>
-      )
-    );
-  }
+  getCardinal$(liveStatus: boolean): Observable<ICardinal> {}
 }
 

[Survived] ObjectLiteral
core/integrations/cardinal-commerce/CardinalProvider.ts:20:27
       ? environment.CARDINAL_COMMERCE.SONGBIRD_LIVE_URL
       : environment.CARDINAL_COMMERCE.SONGBIRD_TEST_URL;
 
-    const scriptOptions = {
-      src: sdkAddress,
-      id: CardinalProvider.SCRIPT_ID
-    };
+    const scriptOptions = {};
 
     return from(DomMethods.insertScript('head', scriptOptions)).pipe(

[Survived] ArrowFunction
core/integrations/cardinal-commerce/CardinalProvider.ts:27:9
 
     return from(DomMethods.insertScript('head', scriptOptions)).pipe(
       switchMap(
-        () =>
-          interval().pipe(
-            // @ts-ignore
-            map(() => window.Cardinal),
-            filter(Boolean),
-            first()
-          ) as Observable<ICardinal>
+        () => undefined
       )
     );
