[Survived] BlockStatement
core/integrations/google-analytics/GoogleAnalytics.ts:5:109
 import { DomMethods } from '../../shared/dom-methods/DomMethods';
 
 export class GoogleAnalytics {
-  public static sendGaData(hitType: string, eventCategory: string, eventAction: string, eventLabel: string) {
-    // @ts-ignore
-    if (window.ga) {
-      // @ts-ignore
-      window.ga('send', { hitType, eventCategory, eventAction, eventLabel });
-    } else {
-      return false;
-    }
-  }
+  public static sendGaData(hitType: string, eventCategory: string, eventAction: string, eventLabel: string) {}
 
   private static GA_MEASUREMENT_ID: string = environment.GA_MEASUREMENT_ID;

[Survived] ConditionalExpression
core/integrations/google-analytics/GoogleAnalytics.ts:7:9
 export class GoogleAnalytics {
   public static sendGaData(hitType: string, eventCategory: string, eventAction: string, eventLabel: string) {
     // @ts-ignore
-    if (window.ga) {
+    if (true) {
       // @ts-ignore
       window.ga('send', { hitType, eventCategory, eventAction, eventLabel });

[Survived] ConditionalExpression
core/integrations/google-analytics/GoogleAnalytics.ts:7:9
 export class GoogleAnalytics {
   public static sendGaData(hitType: string, eventCategory: string, eventAction: string, eventLabel: string) {
     // @ts-ignore
-    if (window.ga) {
+    if (false) {
       // @ts-ignore
       window.ga('send', { hitType, eventCategory, eventAction, eventLabel });

[Survived] BlockStatement
core/integrations/google-analytics/GoogleAnalytics.ts:10:12
     if (window.ga) {
       // @ts-ignore
       window.ga('send', { hitType, eventCategory, eventAction, eventLabel });
-    } else {
-      return false;
-    }
+    } else {}
   }
 

[Survived] StringLiteral
core/integrations/google-analytics/GoogleAnalytics.ts:24:41
   , {'storage': 'none'});`;
   private static GA_IP_ANONYMIZATION: string = `ga('set', 'anonymizeIp', true);`;
   private static GA_DISABLE_ADVERTISING_FEATURES: string = `ga('set', 'allowAdFeatures', false);`;
-  private static GA_PAGE_VIEW: string = `ga('send', 'pageview', location.pathname);`;
+  private static GA_PAGE_VIEW: string = ``;
   private static TRANSLATION_SCRIPT_SUCCEEDED: string = 'Google Analytics: script has been created';
   private static TRANSLATION_SCRIPT_FAILED: string = 'Google Analytics: an error occurred loading script';

[Survived] StringLiteral
core/integrations/google-analytics/GoogleAnalytics.ts:28:64
   private static TRANSLATION_SCRIPT_SUCCEEDED: string = 'Google Analytics: script has been created';
   private static TRANSLATION_SCRIPT_FAILED: string = 'Google Analytics: an error occurred loading script';
   private static TRANSLATION_SCRIPT_APPENDED: string = 'Google Analytics: script has been appended';
-  private static TRANSLATION_SCRIPT_APPENDED_FAILURE: string = 'Google Analytics: an error occurred appending script';
+  private static TRANSLATION_SCRIPT_APPENDED_FAILURE: string = "";
 
   private static _disableUserIDTracking(): boolean {

[Survived] BlockStatement
core/integrations/google-analytics/GoogleAnalytics.ts:30:52
   private static TRANSLATION_SCRIPT_APPENDED: string = 'Google Analytics: script has been appended';
   private static TRANSLATION_SCRIPT_APPENDED_FAILURE: string = 'Google Analytics: an error occurred appending script';
 
-  private static _disableUserIDTracking(): boolean {
-    // @ts-ignore
-    return (window[`ga-disable-UA-${GoogleAnalytics.GA_MEASUREMENT_ID}-Y`] = true);
-  }
+  private static _disableUserIDTracking(): boolean {}
 
   private static _returnScriptWithFeatures(): string {

[Survived] BooleanLiteral
core/integrations/google-analytics/GoogleAnalytics.ts:32:78
 
   private static _disableUserIDTracking(): boolean {
     // @ts-ignore
-    return (window[`ga-disable-UA-${GoogleAnalytics.GA_MEASUREMENT_ID}-Y`] = true);
+    return (window[`ga-disable-UA-${GoogleAnalytics.GA_MEASUREMENT_ID}-Y`] = false);
   }
 

[Survived] BlockStatement
core/integrations/google-analytics/GoogleAnalytics.ts:35:54
     return (window[`ga-disable-UA-${GoogleAnalytics.GA_MEASUREMENT_ID}-Y`] = true);
   }
 
-  private static _returnScriptWithFeatures(): string {
-    return `${GoogleAnalytics.GA_INIT_SCRIPT_CONTENT}
-    ${GoogleAnalytics.GA_DISABLE_COOKIES}
-    ${GoogleAnalytics.GA_IP_ANONYMIZATION}
-    ${GoogleAnalytics.GA_DISABLE_ADVERTISING_FEATURES}
-    ${GoogleAnalytics.GA_PAGE_VIEW}`;
-  }
+  private static _returnScriptWithFeatures(): string {}
 
   private _communicate: string;

[Survived] BlockStatement
core/integrations/google-analytics/GoogleAnalytics.ts:47:23
   private _gaScript: HTMLScriptElement;
   private _gaScriptContent: Text;
 
-  public init(): void {
-    this._insertGALibrary();
-    this._createGAScript()
-      .then(() => {
-        this._insertGAScript()
-          .then(() => {
-            GoogleAnalytics._disableUserIDTracking();
-          })
-          .catch(error => {
-            throw new Error(error);
-          });
-      })
-      .catch(error => {
-        throw new Error(error);
-      });
-  }
+  public init(): void {}
 
   private _createGAScript(): Promise<any> {

[Survived] BlockStatement
core/integrations/google-analytics/GoogleAnalytics.ts:50:19
   public init(): void {
     this._insertGALibrary();
     this._createGAScript()
-      .then(() => {
-        this._insertGAScript()
-          .then(() => {
-            GoogleAnalytics._disableUserIDTracking();
-          })
-          .catch(error => {
-            throw new Error(error);
-          });
-      })
+      .then(() => {})
       .catch(error => {
         throw new Error(error);

[Survived] BlockStatement
core/integrations/google-analytics/GoogleAnalytics.ts:52:23
     this._createGAScript()
       .then(() => {
         this._insertGAScript()
-          .then(() => {
-            GoogleAnalytics._disableUserIDTracking();
-          })
+          .then(() => {})
           .catch(error => {
             throw new Error(error);

[Survived] BlockStatement
core/integrations/google-analytics/GoogleAnalytics.ts:55:27
           .then(() => {
             GoogleAnalytics._disableUserIDTracking();
           })
-          .catch(error => {
-            throw new Error(error);
-          });
+          .catch(error => {});
       })
       .catch(error => {

[Survived] BlockStatement
core/integrations/google-analytics/GoogleAnalytics.ts:64:43
       });
   }
 
-  private _createGAScript(): Promise<any> {
-    return new Promise((resolve, reject) => {
-      this._gaScript = document.createElement('script');
-      this._gaScript.type = 'text/javascript';
-      this._gaScript.id = 'googleAnalytics';
-      this._gaScriptContent = document.createTextNode(GoogleAnalytics._returnScriptWithFeatures());
-      this._gaScript.appendChild(this._gaScriptContent);
-      resolve((this._communicate = GoogleAnalytics.TRANSLATION_SCRIPT_SUCCEEDED));
-      reject((this._communicate = GoogleAnalytics.TRANSLATION_SCRIPT_FAILED));
-    });
-  }
+  private _createGAScript(): Promise<any> {}
 
   private _insertGALibrary(): void {

[Survived] BlockStatement
core/integrations/google-analytics/GoogleAnalytics.ts:65:45
   }
 
   private _createGAScript(): Promise<any> {
-    return new Promise((resolve, reject) => {
-      this._gaScript = document.createElement('script');
-      this._gaScript.type = 'text/javascript';
-      this._gaScript.id = 'googleAnalytics';
-      this._gaScriptContent = document.createTextNode(GoogleAnalytics._returnScriptWithFeatures());
-      this._gaScript.appendChild(this._gaScriptContent);
-      resolve((this._communicate = GoogleAnalytics.TRANSLATION_SCRIPT_SUCCEEDED));
-      reject((this._communicate = GoogleAnalytics.TRANSLATION_SCRIPT_FAILED));
-    });
+    return new Promise((resolve, reject) => {});
   }
 

[Survived] StringLiteral
core/integrations/google-analytics/GoogleAnalytics.ts:66:47
 
   private _createGAScript(): Promise<any> {
     return new Promise((resolve, reject) => {
-      this._gaScript = document.createElement('script');
+      this._gaScript = document.createElement("");
       this._gaScript.type = 'text/javascript';
       this._gaScript.id = 'googleAnalytics';

[Survived] StringLiteral
core/integrations/google-analytics/GoogleAnalytics.ts:68:27
     return new Promise((resolve, reject) => {
       this._gaScript = document.createElement('script');
       this._gaScript.type = 'text/javascript';
-      this._gaScript.id = 'googleAnalytics';
+      this._gaScript.id = "";
       this._gaScriptContent = document.createTextNode(GoogleAnalytics._returnScriptWithFeatures());
       this._gaScript.appendChild(this._gaScriptContent);

[Survived] BlockStatement
core/integrations/google-analytics/GoogleAnalytics.ts:76:36
     });
   }
 
-  private _insertGALibrary(): void {
-    DomMethods.insertScript('head', { async: 'async', src: GoogleAnalytics.GA_SCRIPT_SRC, id: 'googleAnalytics' });
-  }
+  private _insertGALibrary(): void {}
 
   private _insertGAScript(): Promise<any> {

[Survived] StringLiteral
core/integrations/google-analytics/GoogleAnalytics.ts:77:29
   }
 
   private _insertGALibrary(): void {
-    DomMethods.insertScript('head', { async: 'async', src: GoogleAnalytics.GA_SCRIPT_SRC, id: 'googleAnalytics' });
+    DomMethods.insertScript("", { async: 'async', src: GoogleAnalytics.GA_SCRIPT_SRC, id: 'googleAnalytics' });
   }
 

[Survived] StringLiteral
core/integrations/google-analytics/GoogleAnalytics.ts:77:95
   }
 
   private _insertGALibrary(): void {
-    DomMethods.insertScript('head', { async: 'async', src: GoogleAnalytics.GA_SCRIPT_SRC, id: 'googleAnalytics' });
+    DomMethods.insertScript('head', { async: 'async', src: GoogleAnalytics.GA_SCRIPT_SRC, id: "" });
   }
 

[Survived] BlockStatement
core/integrations/google-analytics/GoogleAnalytics.ts:80:43
     DomMethods.insertScript('head', { async: 'async', src: GoogleAnalytics.GA_SCRIPT_SRC, id: 'googleAnalytics' });
   }
 
-  private _insertGAScript(): Promise<any> {
-    return new Promise((resolve, reject) => {
-      if (!document.getElementById('googleAnalytics')) {
-        document.head.appendChild(this._gaScript);
-        resolve((this._communicate = GoogleAnalytics.TRANSLATION_SCRIPT_APPENDED));
-        reject((this._communicate = GoogleAnalytics.TRANSLATION_SCRIPT_APPENDED_FAILURE));
-      }
-    });
-  }
+  private _insertGAScript(): Promise<any> {}
 }
 

[Survived] BlockStatement
core/integrations/google-analytics/GoogleAnalytics.ts:81:45
   }
 
   private _insertGAScript(): Promise<any> {
-    return new Promise((resolve, reject) => {
-      if (!document.getElementById('googleAnalytics')) {
-        document.head.appendChild(this._gaScript);
-        resolve((this._communicate = GoogleAnalytics.TRANSLATION_SCRIPT_APPENDED));
-        reject((this._communicate = GoogleAnalytics.TRANSLATION_SCRIPT_APPENDED_FAILURE));
-      }
-    });
+    return new Promise((resolve, reject) => {});
   }
 }

[Survived] BlockStatement
core/integrations/google-analytics/GoogleAnalytics.ts:82:56
 
   private _insertGAScript(): Promise<any> {
     return new Promise((resolve, reject) => {
-      if (!document.getElementById('googleAnalytics')) {
-        document.head.appendChild(this._gaScript);
-        resolve((this._communicate = GoogleAnalytics.TRANSLATION_SCRIPT_APPENDED));
-        reject((this._communicate = GoogleAnalytics.TRANSLATION_SCRIPT_APPENDED_FAILURE));
-      }
+      if (!document.getElementById('googleAnalytics')) {}
     });
   }

[Survived] BooleanLiteral
core/integrations/google-analytics/GoogleAnalytics.ts:82:11
 
   private _insertGAScript(): Promise<any> {
     return new Promise((resolve, reject) => {
-      if (!document.getElementById('googleAnalytics')) {
+      if (document.getElementById('googleAnalytics')) {
         document.head.appendChild(this._gaScript);
         resolve((this._communicate = GoogleAnalytics.TRANSLATION_SCRIPT_APPENDED));
