[Survived] BlockStatement
core/integrations/visa-checkout/VisaCheckout.ts:21:26
 declare const V: any;
 
 export class VisaCheckout {
-  get payment(): Payment {
-    return this._payment;
-  }
+  get payment(): Payment {}
 
   set payment(value: Payment) {

[Survived] BlockStatement
core/integrations/visa-checkout/VisaCheckout.ts:29:37
     this._payment = value;
   }
 
-  set paymentDetails(value: string) {
-    this._paymentDetails = value;
-  }
+  set paymentDetails(value: string) {}
 
   get paymentDetails(): string {

[Survived] BlockStatement
core/integrations/visa-checkout/VisaCheckout.ts:33:32
     this._paymentDetails = value;
   }
 
-  get paymentDetails(): string {
-    return this._paymentDetails;
-  }
+  get paymentDetails(): string {}
 
   get paymentStatus(): string {

[Survived] BlockStatement
core/integrations/visa-checkout/VisaCheckout.ts:37:31
     return this._paymentDetails;
   }
 
-  get paymentStatus(): string {
-    return this._paymentStatus;
-  }
+  get paymentStatus(): string {}
 
   set paymentStatus(value: string) {

[Survived] BlockStatement
core/integrations/visa-checkout/VisaCheckout.ts:41:36
     return this._paymentStatus;
   }
 
-  set paymentStatus(value: string) {
-    this._paymentStatus = value;
-  }
+  set paymentStatus(value: string) {}
 
   get responseMessage(): string {

[Survived] BlockStatement
core/integrations/visa-checkout/VisaCheckout.ts:45:33
     this._paymentStatus = value;
   }
 
-  get responseMessage(): string {
-    return this._responseMessage;
-  }
+  get responseMessage(): string {}
 
   set responseMessage(value: string) {

[Survived] BlockStatement
core/integrations/visa-checkout/VisaCheckout.ts:49:38
     return this._responseMessage;
   }
 
-  set responseMessage(value: string) {
-    this._responseMessage = value;
-  }
+  set responseMessage(value: string) {}
 
   protected static VISA_PAYMENT_STATUS = {

[Survived] StringLiteral
core/integrations/visa-checkout/VisaCheckout.ts:54:12
   }
 
   protected static VISA_PAYMENT_STATUS = {
-    ERROR: 'ERROR',
+    ERROR: "",
     SUCCESS: 'SUCCESS',
     CANCEL: 'WARNING' // Because VisaCheckout API has warnings instead of cancel :/

[Survived] StringLiteral
core/integrations/visa-checkout/VisaCheckout.ts:55:14
 
   protected static VISA_PAYMENT_STATUS = {
     ERROR: 'ERROR',
-    SUCCESS: 'SUCCESS',
+    SUCCESS: "",
     CANCEL: 'WARNING' // Because VisaCheckout API has warnings instead of cancel :/
   };

[Survived] StringLiteral
core/integrations/visa-checkout/VisaCheckout.ts:60:13
   };
 
   private static VISA_PAYMENT_RESPONSE_TYPES = {
-    CANCEL: 'payment.cancel',
+    CANCEL: "",
     ERROR: 'payment.error',
     SUCCESS: 'payment.success'

[Survived] StringLiteral
core/integrations/visa-checkout/VisaCheckout.ts:67:10
 
   protected requestTypes: string[];
   protected visaCheckoutButtonProps: any = {
-    alt: 'Visa Checkout',
+    alt: "",
     class: 'v-button',
     id: 'v-button',

[Survived] StringLiteral
core/integrations/visa-checkout/VisaCheckout.ts:69:9
   protected visaCheckoutButtonProps: any = {
     alt: 'Visa Checkout',
     class: 'v-button',
-    id: 'v-button',
+    id: "",
     role: 'button',
     src: environment.VISA_CHECKOUT_URLS.TEST_BUTTON_URL

[Survived] StringLiteral
core/integrations/visa-checkout/VisaCheckout.ts:70:11
     alt: 'Visa Checkout',
     class: 'v-button',
     id: 'v-button',
-    role: 'button',
+    role: "",
     src: environment.VISA_CHECKOUT_URLS.TEST_BUTTON_URL
   };

[Survived] BlockStatement
core/integrations/visa-checkout/VisaCheckout.ts:101:103
     settings: {}
   };
 
-  constructor(private _configProvider: ConfigProvider, private _communicator: InterFrameCommunicator) {
-    this._messageBus = Container.get(MessageBus);
-    this._notification = Container.get(NotificationService);
-    this._config$ = this._configProvider.getConfig$();
-
-    this._config$.subscribe(config => {
-      const { visaCheckout, jwt, datacenterurl, livestatus, formId } = config;
-      if (visaCheckout) {
-        this._visaCheckoutConfig = visaCheckout;
-      }
-      this._stJwt = new StJwt(jwt);
-      this._livestatus = livestatus;
-      this._formId = formId;
-      this._datacenterurl = datacenterurl;
-      this._configurePaymentProcess(jwt);
-      this._initVisaFlow();
-    });
-    this._messageBus.subscribe(MessageBus.EVENTS_PUBLIC.UPDATE_JWT, (data: { newJwt: string }) => {
-      const { newJwt } = data;
-      this._configurePaymentProcess(newJwt);
-    });
-  }
+  constructor(private _configProvider: ConfigProvider, private _communicator: InterFrameCommunicator) {}
 
   public setInitConfiguration(paymentRequest: any, settings: any, stJwt: StJwt, merchantId: string) {

[Survived] BlockStatement
core/integrations/visa-checkout/VisaCheckout.ts:106:39
     this._notification = Container.get(NotificationService);
     this._config$ = this._configProvider.getConfig$();
 
-    this._config$.subscribe(config => {
-      const { visaCheckout, jwt, datacenterurl, livestatus, formId } = config;
-      if (visaCheckout) {
-        this._visaCheckoutConfig = visaCheckout;
-      }
-      this._stJwt = new StJwt(jwt);
-      this._livestatus = livestatus;
-      this._formId = formId;
-      this._datacenterurl = datacenterurl;
-      this._configurePaymentProcess(jwt);
-      this._initVisaFlow();
-    });
+    this._config$.subscribe(config => {});
     this._messageBus.subscribe(MessageBus.EVENTS_PUBLIC.UPDATE_JWT, (data: { newJwt: string }) => {
       const { newJwt } = data;

[Survived] BlockStatement
core/integrations/visa-checkout/VisaCheckout.ts:108:25
 
     this._config$.subscribe(config => {
       const { visaCheckout, jwt, datacenterurl, livestatus, formId } = config;
-      if (visaCheckout) {
-        this._visaCheckoutConfig = visaCheckout;
-      }
+      if (visaCheckout) {}
       this._stJwt = new StJwt(jwt);
       this._livestatus = livestatus;

[Survived] ConditionalExpression
core/integrations/visa-checkout/VisaCheckout.ts:108:11
 
     this._config$.subscribe(config => {
       const { visaCheckout, jwt, datacenterurl, livestatus, formId } = config;
-      if (visaCheckout) {
+      if (false) {
         this._visaCheckoutConfig = visaCheckout;
       }

[Survived] BlockStatement
core/integrations/visa-checkout/VisaCheckout.ts:118:99
       this._configurePaymentProcess(jwt);
       this._initVisaFlow();
     });
-    this._messageBus.subscribe(MessageBus.EVENTS_PUBLIC.UPDATE_JWT, (data: { newJwt: string }) => {
-      const { newJwt } = data;
-      this._configurePaymentProcess(newJwt);
-    });
+    this._messageBus.subscribe(MessageBus.EVENTS_PUBLIC.UPDATE_JWT, (data: { newJwt: string }) => {});
   }
 

[Survived] BlockStatement
core/integrations/visa-checkout/VisaCheckout.ts:124:101
     });
   }
 
-  public setInitConfiguration(paymentRequest: any, settings: any, stJwt: StJwt, merchantId: string) {
-    this._initConfiguration.apikey = merchantId;
-    this._initConfiguration.paymentRequest = this.getInitPaymentRequest(paymentRequest, stJwt) as any;
-    this._initConfiguration.settings = this._setConfiguration({ locale: stJwt.locale }, settings);
-  }
+  public setInitConfiguration(paymentRequest: any, settings: any, stJwt: StJwt, merchantId: string) {}
 
   public customizeVisaButton(properties: any) {

[Survived] BlockStatement
core/integrations/visa-checkout/VisaCheckout.ts:130:47
     this._initConfiguration.settings = this._setConfiguration({ locale: stJwt.locale }, settings);
   }
 
-  public customizeVisaButton(properties: any) {
-    const { color, size } = properties;
-    const url = new URL(this.visaCheckoutButtonProps.src);
-    if (color) {
-      url.searchParams.append('color', color);
-    }
-    if (size) {
-      url.searchParams.append('size', size);
-    }
-    this.visaCheckoutButtonProps.src = url.href;
-    return this.visaCheckoutButtonProps.src;
-  }
+  public customizeVisaButton(properties: any) {}
 
   public getInitPaymentRequest(paymentRequest: any, stJwt: StJwt) {

[Survived] ConditionalExpression
core/integrations/visa-checkout/VisaCheckout.ts:133:9
   public customizeVisaButton(properties: any) {
     const { color, size } = properties;
     const url = new URL(this.visaCheckoutButtonProps.src);
-    if (color) {
+    if (true) {
       url.searchParams.append('color', color);
     }

[Survived] ConditionalExpression
core/integrations/visa-checkout/VisaCheckout.ts:133:9
   public customizeVisaButton(properties: any) {
     const { color, size } = properties;
     const url = new URL(this.visaCheckoutButtonProps.src);
-    if (color) {
+    if (false) {
       url.searchParams.append('color', color);
     }

[Survived] StringLiteral
core/integrations/visa-checkout/VisaCheckout.ts:134:31
     const { color, size } = properties;
     const url = new URL(this.visaCheckoutButtonProps.src);
     if (color) {
-      url.searchParams.append('color', color);
+      url.searchParams.append("", color);
     }
     if (size) {

[Survived] ConditionalExpression
core/integrations/visa-checkout/VisaCheckout.ts:136:9
     if (color) {
       url.searchParams.append('color', color);
     }
-    if (size) {
+    if (false) {
       url.searchParams.append('size', size);
     }

[Survived] BlockStatement
core/integrations/visa-checkout/VisaCheckout.ts:136:15
     if (color) {
       url.searchParams.append('color', color);
     }
-    if (size) {
-      url.searchParams.append('size', size);
-    }
+    if (size) {}
     this.visaCheckoutButtonProps.src = url.href;
     return this.visaCheckoutButtonProps.src;

[Survived] StringLiteral
core/integrations/visa-checkout/VisaCheckout.ts:137:31
       url.searchParams.append('color', color);
     }
     if (size) {
-      url.searchParams.append('size', size);
+      url.searchParams.append("", size);
     }
     this.visaCheckoutButtonProps.src = url.href;

[Survived] BlockStatement
core/integrations/visa-checkout/VisaCheckout.ts:143:67
     return this.visaCheckoutButtonProps.src;
   }
 
-  public getInitPaymentRequest(paymentRequest: any, stJwt: StJwt) {
-    const config = this._initConfiguration.paymentRequest;
-    config.currencyCode = stJwt.currencyiso3a;
-    config.subtotal = stJwt.mainamount;
-    config.total = stJwt.mainamount;
-    return this._setConfiguration(config, paymentRequest);
-  }
+  public getInitPaymentRequest(paymentRequest: any, stJwt: StJwt) {}
 
   public createVisaButton = () => DomMethods.createHtmlElement.apply(this, [this.visaCheckoutButtonProps, 'img']);

[Survived] ArrowFunction
core/integrations/visa-checkout/VisaCheckout.ts:151:29
     return this._setConfiguration(config, paymentRequest);
   }
 
-  public createVisaButton = () => DomMethods.createHtmlElement.apply(this, [this.visaCheckoutButtonProps, 'img']);
+  public createVisaButton = () => undefined;
 
   protected attachVisaButton = () => DomMethods.appendChildIntoDOM(this._placement, this.createVisaButton());

[Survived] ArrayDeclaration
core/integrations/visa-checkout/VisaCheckout.ts:151:76
     return this._setConfiguration(config, paymentRequest);
   }
 
-  public createVisaButton = () => DomMethods.createHtmlElement.apply(this, [this.visaCheckoutButtonProps, 'img']);
+  public createVisaButton = () => DomMethods.createHtmlElement.apply(this, []);
 
   protected attachVisaButton = () => DomMethods.appendChildIntoDOM(this._placement, this.createVisaButton());

[Survived] ArrowFunction
core/integrations/visa-checkout/VisaCheckout.ts:153:32
 
   public createVisaButton = () => DomMethods.createHtmlElement.apply(this, [this.visaCheckoutButtonProps, 'img']);
 
-  protected attachVisaButton = () => DomMethods.appendChildIntoDOM(this._placement, this.createVisaButton());
+  protected attachVisaButton = () => undefined;
 
   protected onSuccess(payment: object) {

[Survived] ObjectLiteral
core/integrations/visa-checkout/VisaCheckout.ts:161:9
     this.payment
       .processPayment(
         this.requestTypes,
-        {
-          walletsource: this._walletSource,
-          wallettoken: this.paymentDetails
-        },
+        {},
         DomMethods.parseForm(this._formId)
       )

[Survived] BlockStatement
core/integrations/visa-checkout/VisaCheckout.ts:167:19
         },
         DomMethods.parseForm(this._formId)
       )
-      .then(() => {
-        this.paymentStatus = VisaCheckout.VISA_PAYMENT_STATUS.SUCCESS;
-        this._getResponseMessage(this.paymentStatus);
-        this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_SUCCESS_CALLBACK }, true);
-        this._notification.success(this.responseMessage);
-        GoogleAnalytics.sendGaData('event', 'Visa Checkout', 'payment status', 'Visa Checkout payment success');
-      })
+      .then(() => {})
       .catch((error: any) => {
         this.paymentStatus = VisaCheckout.VISA_PAYMENT_STATUS.ERROR;

[Survived] BooleanLiteral
core/integrations/visa-checkout/VisaCheckout.ts:170:101
       .then(() => {
         this.paymentStatus = VisaCheckout.VISA_PAYMENT_STATUS.SUCCESS;
         this._getResponseMessage(this.paymentStatus);
-        this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_SUCCESS_CALLBACK }, true);
+        this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_SUCCESS_CALLBACK }, false);
         this._notification.success(this.responseMessage);
         GoogleAnalytics.sendGaData('event', 'Visa Checkout', 'payment status', 'Visa Checkout payment success');

[Survived] BlockStatement
core/integrations/visa-checkout/VisaCheckout.ts:174:30
         this._notification.success(this.responseMessage);
         GoogleAnalytics.sendGaData('event', 'Visa Checkout', 'payment status', 'Visa Checkout payment success');
       })
-      .catch((error: any) => {
-        this.paymentStatus = VisaCheckout.VISA_PAYMENT_STATUS.ERROR;
-        this._getResponseMessage(this.paymentStatus);
-        this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_ERROR_CALLBACK }, true);
-        this._notification.error(this.responseMessage);
-      });
+      .catch((error: any) => {});
   }
 

[Survived] BooleanLiteral
core/integrations/visa-checkout/VisaCheckout.ts:177:99
       .catch((error: any) => {
         this.paymentStatus = VisaCheckout.VISA_PAYMENT_STATUS.ERROR;
         this._getResponseMessage(this.paymentStatus);
-        this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_ERROR_CALLBACK }, true);
+        this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_ERROR_CALLBACK }, false);
         this._notification.error(this.responseMessage);
       });

[Survived] BlockStatement
core/integrations/visa-checkout/VisaCheckout.ts:182:23
       });
   }
 
-  protected onError() {
-    this.paymentStatus = VisaCheckout.VISA_PAYMENT_STATUS.ERROR;
-    this._getResponseMessage(this.paymentStatus);
-    this._notification.error(this.responseMessage);
-    this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_ERROR_CALLBACK }, true);
-    GoogleAnalytics.sendGaData('event', 'Visa Checkout', 'payment status', 'Visa Checkout payment error');
-  }
+  protected onError() {}
 
   protected onCancel() {

[Survived] BooleanLiteral
core/integrations/visa-checkout/VisaCheckout.ts:186:95
     this.paymentStatus = VisaCheckout.VISA_PAYMENT_STATUS.ERROR;
     this._getResponseMessage(this.paymentStatus);
     this._notification.error(this.responseMessage);
-    this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_ERROR_CALLBACK }, true);
+    this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_ERROR_CALLBACK }, false);
     GoogleAnalytics.sendGaData('event', 'Visa Checkout', 'payment status', 'Visa Checkout payment error');
   }

[Survived] StringLiteral
core/integrations/visa-checkout/VisaCheckout.ts:187:32
     this._getResponseMessage(this.paymentStatus);
     this._notification.error(this.responseMessage);
     this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_ERROR_CALLBACK }, true);
-    GoogleAnalytics.sendGaData('event', 'Visa Checkout', 'payment status', 'Visa Checkout payment error');
+    GoogleAnalytics.sendGaData("", 'Visa Checkout', 'payment status', 'Visa Checkout payment error');
   }
 

[Survived] BlockStatement
core/integrations/visa-checkout/VisaCheckout.ts:190:24
     GoogleAnalytics.sendGaData('event', 'Visa Checkout', 'payment status', 'Visa Checkout payment error');
   }
 
-  protected onCancel() {
-    this.paymentStatus = VisaCheckout.VISA_PAYMENT_STATUS.CANCEL;
-    this._getResponseMessage(this.paymentStatus);
-    this._notification.cancel(this.responseMessage);
-    this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_CANCEL_CALLBACK }, true);
-    this._messageBus.publish(
-      {
-        type: MessageBus.EVENTS_PUBLIC.TRANSACTION_COMPLETE,
-        data: {
-          errorcode: 'cancelled',
-          errormessage: this.responseMessage
-        }
-      },
-      true
-    );
-    GoogleAnalytics.sendGaData('event', 'Visa Checkout', 'payment status', 'Visa Checkout payment canceled');
-  }
+  protected onCancel() {}
 
   protected initPaymentConfiguration() {

[Survived] BooleanLiteral
core/integrations/visa-checkout/VisaCheckout.ts:194:96
     this.paymentStatus = VisaCheckout.VISA_PAYMENT_STATUS.CANCEL;
     this._getResponseMessage(this.paymentStatus);
     this._notification.cancel(this.responseMessage);
-    this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_CANCEL_CALLBACK }, true);
+    this._messageBus.publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_CANCEL_CALLBACK }, false);
     this._messageBus.publish(
       {

[Survived] ObjectLiteral
core/integrations/visa-checkout/VisaCheckout.ts:198:15
     this._messageBus.publish(
       {
         type: MessageBus.EVENTS_PUBLIC.TRANSACTION_COMPLETE,
-        data: {
-          errorcode: 'cancelled',
-          errormessage: this.responseMessage
-        }
+        data: {}
       },
       true

[Survived] StringLiteral
core/integrations/visa-checkout/VisaCheckout.ts:205:76
       },
       true
     );
-    GoogleAnalytics.sendGaData('event', 'Visa Checkout', 'payment status', 'Visa Checkout payment canceled');
+    GoogleAnalytics.sendGaData('event', 'Visa Checkout', 'payment status', "");
   }
 

[Survived] BlockStatement
core/integrations/visa-checkout/VisaCheckout.ts:208:40
     GoogleAnalytics.sendGaData('event', 'Visa Checkout', 'payment status', 'Visa Checkout payment canceled');
   }
 
-  protected initPaymentConfiguration() {
-    V.init(this._initConfiguration);
-  }
+  protected initPaymentConfiguration() {}
 
   protected paymentStatusHandler() {

[Survived] BlockStatement
core/integrations/visa-checkout/VisaCheckout.ts:212:36
     V.init(this._initConfiguration);
   }
 
-  protected paymentStatusHandler() {
-    V.on(VisaCheckout.VISA_PAYMENT_RESPONSE_TYPES.SUCCESS, (payment: object) => {
-      this.onSuccess(payment);
-    });
-    V.on(VisaCheckout.VISA_PAYMENT_RESPONSE_TYPES.ERROR, () => {
-      this.onError();
-    });
-    V.on(VisaCheckout.VISA_PAYMENT_RESPONSE_TYPES.CANCEL, () => {
-      this.onCancel();
-    });
-  }
+  protected paymentStatusHandler() {}
 
   private _configurePaymentProcess(jwt: string) {

[Survived] BlockStatement
core/integrations/visa-checkout/VisaCheckout.ts:213:81
   }
 
   protected paymentStatusHandler() {
-    V.on(VisaCheckout.VISA_PAYMENT_RESPONSE_TYPES.SUCCESS, (payment: object) => {
-      this.onSuccess(payment);
-    });
+    V.on(VisaCheckout.VISA_PAYMENT_RESPONSE_TYPES.SUCCESS, (payment: object) => {});
     V.on(VisaCheckout.VISA_PAYMENT_RESPONSE_TYPES.ERROR, () => {
       this.onError();

[Survived] BlockStatement
core/integrations/visa-checkout/VisaCheckout.ts:216:64
     V.on(VisaCheckout.VISA_PAYMENT_RESPONSE_TYPES.SUCCESS, (payment: object) => {
       this.onSuccess(payment);
     });
-    V.on(VisaCheckout.VISA_PAYMENT_RESPONSE_TYPES.ERROR, () => {
-      this.onError();
-    });
+    V.on(VisaCheckout.VISA_PAYMENT_RESPONSE_TYPES.ERROR, () => {});
     V.on(VisaCheckout.VISA_PAYMENT_RESPONSE_TYPES.CANCEL, () => {
       this.onCancel();

[Survived] BlockStatement
core/integrations/visa-checkout/VisaCheckout.ts:219:65
     V.on(VisaCheckout.VISA_PAYMENT_RESPONSE_TYPES.ERROR, () => {
       this.onError();
     });
-    V.on(VisaCheckout.VISA_PAYMENT_RESPONSE_TYPES.CANCEL, () => {
-      this.onCancel();
-    });
+    V.on(VisaCheckout.VISA_PAYMENT_RESPONSE_TYPES.CANCEL, () => {});
   }
 

[Survived] BlockStatement
core/integrations/visa-checkout/VisaCheckout.ts:224:49
     });
   }
 
-  private _configurePaymentProcess(jwt: string) {
-    const {
-      merchantId,
-      livestatus,
-      placement,
-      settings,
-      paymentRequest,
-      buttonSettings,
-      requestTypes
-    } = this._visaCheckoutConfig;
-    this._stJwt = new StJwt(jwt);
-    this.payment = new Payment();
-    this._livestatus = livestatus;
-    this._placement = placement;
-    this.requestTypes = requestTypes;
-    this.setInitConfiguration(paymentRequest, settings, this._stJwt, merchantId);
-    this._buttonSettings = this._setConfiguration({ locale: this._stJwt.locale }, settings);
-    this.customizeVisaButton(buttonSettings);
-    this._setLiveStatus();
-  }
+  private _configurePaymentProcess(jwt: string) {}
 
   private _setConfiguration = (config: IVisaConfig, settings: IVisaSettings) =>

[Survived] ArrowFunction
core/integrations/visa-checkout/VisaCheckout.ts:245:31
     this._setLiveStatus();
   }
 
-  private _setConfiguration = (config: IVisaConfig, settings: IVisaSettings) =>
-    settings || config ? { ...config, ...settings } : {};
+  private _setConfiguration = () => undefined;
 
   private _initVisaFlow() {

[Survived] ConditionalExpression
core/integrations/visa-checkout/VisaCheckout.ts:246:5
   }
 
   private _setConfiguration = (config: IVisaConfig, settings: IVisaSettings) =>
-    settings || config ? { ...config, ...settings } : {};
+    false ? { ...config, ...settings } : {};
 
   private _initVisaFlow() {

[Survived] LogicalOperator
core/integrations/visa-checkout/VisaCheckout.ts:246:5
   }
 
   private _setConfiguration = (config: IVisaConfig, settings: IVisaSettings) =>
-    settings || config ? { ...config, ...settings } : {};
+    settings && config ? { ...config, ...settings } : {};
 
   private _initVisaFlow() {

[Survived] BlockStatement
core/integrations/visa-checkout/VisaCheckout.ts:248:27
   private _setConfiguration = (config: IVisaConfig, settings: IVisaSettings) =>
     settings || config ? { ...config, ...settings } : {};
 
-  private _initVisaFlow() {
-    DomMethods.insertScript('body', { src: this._sdkAddress, id: 'visaCheckout' }).then(() => {
-      this.attachVisaButton();
-      this.initPaymentConfiguration();
-      this.paymentStatusHandler();
-    });
-  }
+  private _initVisaFlow() {}
 
   private _setLiveStatus() {

[Survived] BlockStatement
core/integrations/visa-checkout/VisaCheckout.ts:249:95
     settings || config ? { ...config, ...settings } : {};
 
   private _initVisaFlow() {
-    DomMethods.insertScript('body', { src: this._sdkAddress, id: 'visaCheckout' }).then(() => {
-      this.attachVisaButton();
-      this.initPaymentConfiguration();
-      this.paymentStatusHandler();
-    });
+    DomMethods.insertScript('body', { src: this._sdkAddress, id: 'visaCheckout' }).then(() => {});
   }
 

[Survived] StringLiteral
core/integrations/visa-checkout/VisaCheckout.ts:249:66
     settings || config ? { ...config, ...settings } : {};
 
   private _initVisaFlow() {
-    DomMethods.insertScript('body', { src: this._sdkAddress, id: 'visaCheckout' }).then(() => {
+    DomMethods.insertScript('body', { src: this._sdkAddress, id: "" }).then(() => {
       this.attachVisaButton();
       this.initPaymentConfiguration();

[Survived] BlockStatement
core/integrations/visa-checkout/VisaCheckout.ts:256:28
     });
   }
 
-  private _setLiveStatus() {
-    if (this._livestatus) {
-      this.visaCheckoutButtonProps.src = environment.VISA_CHECKOUT_URLS.LIVE_BUTTON_URL;
-      this._sdkAddress = environment.VISA_CHECKOUT_URLS.LIVE_SDK;
-    }
-  }
+  private _setLiveStatus() {}
 
   private _getResponseMessage(type: string) {

[Survived] BlockStatement
core/integrations/visa-checkout/VisaCheckout.ts:257:27
   }
 
   private _setLiveStatus() {
-    if (this._livestatus) {
-      this.visaCheckoutButtonProps.src = environment.VISA_CHECKOUT_URLS.LIVE_BUTTON_URL;
-      this._sdkAddress = environment.VISA_CHECKOUT_URLS.LIVE_SDK;
-    }
+    if (this._livestatus) {}
   }
 

[Survived] ConditionalExpression
core/integrations/visa-checkout/VisaCheckout.ts:257:9
   }
 
   private _setLiveStatus() {
-    if (this._livestatus) {
+    if (false) {
       this.visaCheckoutButtonProps.src = environment.VISA_CHECKOUT_URLS.LIVE_BUTTON_URL;
       this._sdkAddress = environment.VISA_CHECKOUT_URLS.LIVE_SDK;

[Survived] BlockStatement
core/integrations/visa-checkout/VisaCheckout.ts:263:45
     }
   }
 
-  private _getResponseMessage(type: string) {
-    switch (type) {
-      case VisaCheckout.VISA_PAYMENT_STATUS.SUCCESS: {
-        this.responseMessage = PAYMENT_SUCCESS;
-        break;
-      }
-      case VisaCheckout.VISA_PAYMENT_STATUS.CANCEL: {
-        this.responseMessage = PAYMENT_CANCELLED;
-        break;
-      }
-      case VisaCheckout.VISA_PAYMENT_STATUS.ERROR: {
-        this.responseMessage = PAYMENT_ERROR;
-        break;
-      }
-    }
-  }
+  private _getResponseMessage(type: string) {}
 }
 

[Survived] ConditionalExpression
core/integrations/visa-checkout/VisaCheckout.ts:265:7
 
   private _getResponseMessage(type: string) {
     switch (type) {
-      case VisaCheckout.VISA_PAYMENT_STATUS.SUCCESS: {
-        this.responseMessage = PAYMENT_SUCCESS;
-        break;
-      }
+      case VisaCheckout.VISA_PAYMENT_STATUS.SUCCESS:
       case VisaCheckout.VISA_PAYMENT_STATUS.CANCEL: {
         this.responseMessage = PAYMENT_CANCELLED;

[Survived] BlockStatement
core/integrations/visa-checkout/VisaCheckout.ts:265:54
 
   private _getResponseMessage(type: string) {
     switch (type) {
-      case VisaCheckout.VISA_PAYMENT_STATUS.SUCCESS: {
-        this.responseMessage = PAYMENT_SUCCESS;
-        break;
-      }
+      case VisaCheckout.VISA_PAYMENT_STATUS.SUCCESS: {}
       case VisaCheckout.VISA_PAYMENT_STATUS.CANCEL: {
         this.responseMessage = PAYMENT_CANCELLED;

[Survived] ConditionalExpression
core/integrations/visa-checkout/VisaCheckout.ts:269:7
         this.responseMessage = PAYMENT_SUCCESS;
         break;
       }
-      case VisaCheckout.VISA_PAYMENT_STATUS.CANCEL: {
-        this.responseMessage = PAYMENT_CANCELLED;
-        break;
-      }
+      case VisaCheckout.VISA_PAYMENT_STATUS.CANCEL:
       case VisaCheckout.VISA_PAYMENT_STATUS.ERROR: {
         this.responseMessage = PAYMENT_ERROR;

[Survived] BlockStatement
core/integrations/visa-checkout/VisaCheckout.ts:269:53
         this.responseMessage = PAYMENT_SUCCESS;
         break;
       }
-      case VisaCheckout.VISA_PAYMENT_STATUS.CANCEL: {
-        this.responseMessage = PAYMENT_CANCELLED;
-        break;
-      }
+      case VisaCheckout.VISA_PAYMENT_STATUS.CANCEL: {}
       case VisaCheckout.VISA_PAYMENT_STATUS.ERROR: {
         this.responseMessage = PAYMENT_ERROR;

[Survived] BlockStatement
core/integrations/visa-checkout/VisaCheckout.ts:273:52
         this.responseMessage = PAYMENT_CANCELLED;
         break;
       }
-      case VisaCheckout.VISA_PAYMENT_STATUS.ERROR: {
-        this.responseMessage = PAYMENT_ERROR;
-        break;
-      }
+      case VisaCheckout.VISA_PAYMENT_STATUS.ERROR: {}
     }
   }

[Survived] ConditionalExpression
core/integrations/visa-checkout/VisaCheckout.ts:273:7
         this.responseMessage = PAYMENT_CANCELLED;
         break;
       }
-      case VisaCheckout.VISA_PAYMENT_STATUS.ERROR: {
-        this.responseMessage = PAYMENT_ERROR;
-        break;
-      }
+      case VisaCheckout.VISA_PAYMENT_STATUS.ERROR:
     }
   }
