[Survived] BlockStatement
core/integrations/visa-checkout/VisaCheckoutMock.ts:10:36
     // Do nothing on mock because we don't want to use V.
   }
 
-  protected paymentStatusHandler() {
-    DomMethods.addListener(this.visaCheckoutButtonProps.id, 'click', () => {
-      this._handleMockedData();
-    });
-  }
+  protected paymentStatusHandler() {}
 
   private _handleMockedData() {

[Survived] BlockStatement
core/integrations/visa-checkout/VisaCheckoutMock.ts:11:76
   }
 
   protected paymentStatusHandler() {
-    DomMethods.addListener(this.visaCheckoutButtonProps.id, 'click', () => {
-      this._handleMockedData();
-    });
+    DomMethods.addListener(this.visaCheckoutButtonProps.id, 'click', () => {});
   }
 

[Survived] StringLiteral
core/integrations/visa-checkout/VisaCheckoutMock.ts:11:61
   }
 
   protected paymentStatusHandler() {
-    DomMethods.addListener(this.visaCheckoutButtonProps.id, 'click', () => {
+    DomMethods.addListener(this.visaCheckoutButtonProps.id, "", () => {
       this._handleMockedData();
     });

[Survived] BlockStatement
core/integrations/visa-checkout/VisaCheckoutMock.ts:16:31
     });
   }
 
-  private _handleMockedData() {
-    return fetch(environment.VISA_CHECKOUT_URLS.MOCK_DATA_URL)
-      .then((response: any) => response.json())
-      .then(({ payment, status }: any) => {
-        this._proceedFlowWithMockedData(payment, status);
-      });
-  }
+  private _handleMockedData() {}
 
   private _proceedFlowWithMockedData(payment: any, status: string) {

[Survived] ArrowFunction
core/integrations/visa-checkout/VisaCheckoutMock.ts:18:13
 
   private _handleMockedData() {
     return fetch(environment.VISA_CHECKOUT_URLS.MOCK_DATA_URL)
-      .then((response: any) => response.json())
+      .then(() => undefined)
       .then(({ payment, status }: any) => {
         this._proceedFlowWithMockedData(payment, status);

[Survived] BlockStatement
core/integrations/visa-checkout/VisaCheckoutMock.ts:19:43
   private _handleMockedData() {
     return fetch(environment.VISA_CHECKOUT_URLS.MOCK_DATA_URL)
       .then((response: any) => response.json())
-      .then(({ payment, status }: any) => {
-        this._proceedFlowWithMockedData(payment, status);
-      });
+      .then(({ payment, status }: any) => {});
   }
 

[Survived] BlockStatement
core/integrations/visa-checkout/VisaCheckoutMock.ts:24:68
       });
   }
 
-  private _proceedFlowWithMockedData(payment: any, status: string) {
-    if (status === 'SUCCESS') {
-      this.onSuccess(payment);
-    } else if (status === 'ERROR') {
-      this.onError();
-    } else if (status === 'WARNING') {
-      this.onCancel();
-    }
-  }
+  private _proceedFlowWithMockedData(payment: any, status: string) {}
 }
 

[Survived] EqualityOperator
core/integrations/visa-checkout/VisaCheckoutMock.ts:25:9
   }
 
   private _proceedFlowWithMockedData(payment: any, status: string) {
-    if (status === 'SUCCESS') {
+    if (status !== 'SUCCESS') {
       this.onSuccess(payment);
     } else if (status === 'ERROR') {

[Survived] BlockStatement
core/integrations/visa-checkout/VisaCheckoutMock.ts:25:31
   }
 
   private _proceedFlowWithMockedData(payment: any, status: string) {
-    if (status === 'SUCCESS') {
-      this.onSuccess(payment);
-    } else if (status === 'ERROR') {
+    if (status === 'SUCCESS') {} else if (status === 'ERROR') {
       this.onError();
     } else if (status === 'WARNING') {

[Survived] EqualityOperator
core/integrations/visa-checkout/VisaCheckoutMock.ts:27:16
   private _proceedFlowWithMockedData(payment: any, status: string) {
     if (status === 'SUCCESS') {
       this.onSuccess(payment);
-    } else if (status === 'ERROR') {
+    } else if (status !== 'ERROR') {
       this.onError();
     } else if (status === 'WARNING') {

[Survived] BlockStatement
core/integrations/visa-checkout/VisaCheckoutMock.ts:27:36
   private _proceedFlowWithMockedData(payment: any, status: string) {
     if (status === 'SUCCESS') {
       this.onSuccess(payment);
-    } else if (status === 'ERROR') {
-      this.onError();
-    } else if (status === 'WARNING') {
+    } else if (status === 'ERROR') {} else if (status === 'WARNING') {
       this.onCancel();
     }

[Survived] BlockStatement
core/integrations/visa-checkout/VisaCheckoutMock.ts:29:38
       this.onSuccess(payment);
     } else if (status === 'ERROR') {
       this.onError();
-    } else if (status === 'WARNING') {
-      this.onCancel();
-    }
+    } else if (status === 'WARNING') {}
   }
 }

[Survived] EqualityOperator
core/integrations/visa-checkout/VisaCheckoutMock.ts:29:16
       this.onSuccess(payment);
     } else if (status === 'ERROR') {
       this.onError();
-    } else if (status === 'WARNING') {
+    } else if (status !== 'WARNING') {
       this.onCancel();
     }
