[Survived] ObjectLiteral
core/models/constants/FormFieldsDetails.ts:4:15
 import { IFormFieldsDetails } from '../IFormFieldsDetails';
 
 export const FormFieldsDetails: IFormFieldsDetails = {
-  cardNumber: {
-    validity: false,
-    value: ''
-  },
+  cardNumber: {},
   expirationDate: {
     validity: false,

[Survived] BooleanLiteral
core/models/constants/FormFieldsDetails.ts:5:15
 
 export const FormFieldsDetails: IFormFieldsDetails = {
   cardNumber: {
-    validity: false,
+    validity: true,
     value: ''
   },

[Survived] BooleanLiteral
core/models/constants/FormFieldsDetails.ts:9:15
     value: ''
   },
   expirationDate: {
-    validity: false,
+    validity: true,
     value: ''
   },

[Survived] StringLiteral
core/models/constants/FormFieldsDetails.ts:10:12
   },
   expirationDate: {
     validity: false,
-    value: ''
+    value: "Stryker was here!"
   },
   securityCode: {

[Survived] BooleanLiteral
core/models/constants/FormFieldsDetails.ts:13:15
     value: ''
   },
   securityCode: {
-    validity: false,
+    validity: true,
     value: ''
   }
