[Survived] ObjectLiteral
core/models/constants/FormFieldsValidity.ts:3:56
 import { IFormFieldsValidity } from '../IFormFieldsValidity';
 
-export const FormFieldsValidity: IFormFieldsValidity = {
-  cardNumber: {
-    message: '',
-    state: false
-  },
-  expirationDate: {
-    message: '',
-    state: false
-  },
-  securityCode: {
-    message: '',
-    state: false
-  }
-};
+export const FormFieldsValidity: IFormFieldsValidity = {};
 

[Survived] ObjectLiteral
core/models/constants/FormFieldsValidity.ts:4:15
 import { IFormFieldsValidity } from '../IFormFieldsValidity';
 
 export const FormFieldsValidity: IFormFieldsValidity = {
-  cardNumber: {
-    message: '',
-    state: false
-  },
+  cardNumber: {},
   expirationDate: {
     message: '',

[Survived] BooleanLiteral
core/models/constants/FormFieldsValidity.ts:6:12
 export const FormFieldsValidity: IFormFieldsValidity = {
   cardNumber: {
     message: '',
-    state: false
+    state: true
   },
   expirationDate: {

[Survived] StringLiteral
core/models/constants/FormFieldsValidity.ts:9:14
     state: false
   },
   expirationDate: {
-    message: '',
+    message: "Stryker was here!",
     state: false
   },
