[Survived] StringLiteral
core/models/constants/PaymentEvents.ts:2:16
 export const PaymentEvents = {
-  BIN_PROCESS: 'bin.process',
+  BIN_PROCESS: "",
   INIT: 'init',
   JWT_UPDATE: 'jwt.update',

[Survived] StringLiteral
core/models/constants/PaymentEvents.ts:3:9
 export const PaymentEvents = {
   BIN_PROCESS: 'bin.process',
-  INIT: 'init',
+  INIT: "",
   JWT_UPDATE: 'jwt.update',
   SETUP_COMPLETE: 'payments.setupComplete',

[Survived] StringLiteral
core/models/constants/PaymentEvents.ts:4:15
 export const PaymentEvents = {
   BIN_PROCESS: 'bin.process',
   INIT: 'init',
-  JWT_UPDATE: 'jwt.update',
+  JWT_UPDATE: "",
   SETUP_COMPLETE: 'payments.setupComplete',
   VALIDATED: 'payments.validated'
