[Survived] StringLiteral
core/models/constants/Translations.ts:4:53
 export const APPLE_PAY_AMOUNT_AND_CURRENCY = 'Amount and currency are not set';
 export const APPLE_PAY_NOT_LOGGED = 'You are not logged to Apple account';
 export const COMMUNICATION_ERROR_INVALID_REQUEST = 'Invalid request';
-export const COMMUNICATION_ERROR_INVALID_RESPONSE = 'Invalid response';
+export const COMMUNICATION_ERROR_INVALID_RESPONSE = "";
 export const COMMUNICATION_ERROR_TIMEOUT = 'Timeout';
 export const FORM_IS_NOT_VALID = 'Form is not valid';

[Survived] StringLiteral
core/models/constants/Translations.ts:5:44
 export const APPLE_PAY_NOT_LOGGED = 'You are not logged to Apple account';
 export const COMMUNICATION_ERROR_INVALID_REQUEST = 'Invalid request';
 export const COMMUNICATION_ERROR_INVALID_RESPONSE = 'Invalid response';
-export const COMMUNICATION_ERROR_TIMEOUT = 'Timeout';
+export const COMMUNICATION_ERROR_TIMEOUT = "";
 export const FORM_IS_NOT_VALID = 'Form is not valid';
 export const LABEL_CARD_NUMBER = 'Card number';

[Survived] StringLiteral
core/models/constants/Translations.ts:12:20
 export const LABEL_SECURITY_CODE = 'Security code';
 export const MERCHANT_VALIDATION_FAILURE = 'Merchant validation failure';
 export const NOT_IMPLEMENTED_ERROR = 'Method not implemented';
-export const PAY = 'Pay';
+export const PAY = "";
 export const PAYMENT_CANCELLED = 'Payment has been cancelled';
 export const PAYMENT_ERROR = 'An error occurred';

[Survived] StringLiteral
core/models/constants/Translations.ts:14:30
 export const NOT_IMPLEMENTED_ERROR = 'Method not implemented';
 export const PAY = 'Pay';
 export const PAYMENT_CANCELLED = 'Payment has been cancelled';
-export const PAYMENT_ERROR = 'An error occurred';
+export const PAYMENT_ERROR = "";
 export const PAYMENT_SUCCESS = 'Payment has been successfully processed';
 export const PROCESSING = 'Processing';
