[Survived] ObjectLiteral
models/constants/config-resolver/DefaultComponents.ts:3:34
 import { DefaultComponentsRequestTypes } from './DefaultComponentsRequestTypes';
 
-export const DefaultComponents = {
-  defaultPaymentType: '',
-  paymentTypes: [''],
-  requestTypes: DefaultComponentsRequestTypes,
-  startOnLoad: false
-};
+export const DefaultComponents = {};
 

[Survived] StringLiteral
models/constants/config-resolver/DefaultComponents.ts:4:23
 import { DefaultComponentsRequestTypes } from './DefaultComponentsRequestTypes';
 
 export const DefaultComponents = {
-  defaultPaymentType: '',
+  defaultPaymentType: "Stryker was here!",
   paymentTypes: [''],
   requestTypes: DefaultComponentsRequestTypes,

[Survived] ArrayDeclaration
models/constants/config-resolver/DefaultComponents.ts:5:17
 
 export const DefaultComponents = {
   defaultPaymentType: '',
-  paymentTypes: [''],
+  paymentTypes: [],
   requestTypes: DefaultComponentsRequestTypes,
   startOnLoad: false

[Survived] BooleanLiteral
models/constants/config-resolver/DefaultComponents.ts:7:16
   defaultPaymentType: '',
   paymentTypes: [''],
   requestTypes: DefaultComponentsRequestTypes,
-  startOnLoad: false
+  startOnLoad: true
 };
 
