[Survived] StringLiteral
models/constants/config-resolver/DefaultComponentsRequestTypes.ts:1:72
-export const DefaultComponentsRequestTypes: string[] = ['THREEDQUERY', 'AUTH'];
+export const DefaultComponentsRequestTypes: string[] = ['THREEDQUERY', ""];
 
