[Survived] ArrayDeclaration
models/constants/config-resolver/DefaultFieldsToSubmit.ts:1:48
-export const DefaultFieldsToSubmit: string[] = ['pan', 'expirydate', 'securitycode'];
+export const DefaultFieldsToSubmit: string[] = [];
 
