[Survived] StringLiteral
models/constants/config-resolver/DefaultRequestTypes.ts:1:47
-export const DefaultRequestTypes: string[] = ['THREEDQUERY', 'AUTH'];
+export const DefaultRequestTypes: string[] = ["", 'AUTH'];
 
