[Survived] ArrayDeclaration
models/constants/config-resolver/DefaultSubmitFields.ts:1:46
-export const DefaultSubmitFields: string[] = [
-  'baseamount',
-  'currencyiso3a',
-  'eci',
-  'enrolled',
-  'errorcode',
-  'errordata',
-  'errormessage',
-  'orderreference',
-  'settlestatus',
-  'status',
-  'transactionreference'
-];
+export const DefaultSubmitFields: string[] = [];
 

[Survived] StringLiteral
models/constants/config-resolver/DefaultSubmitFields.ts:2:3
 export const DefaultSubmitFields: string[] = [
-  'baseamount',
+  "",
   'currencyiso3a',
   'eci',

[Survived] StringLiteral
models/constants/config-resolver/DefaultSubmitFields.ts:8:3
   'enrolled',
   'errorcode',
   'errordata',
-  'errormessage',
+  "",
   'orderreference',
   'settlestatus',

[Survived] StringLiteral
models/constants/config-resolver/DefaultSubmitFields.ts:12:3
   'orderreference',
   'settlestatus',
   'status',
-  'transactionreference'
+  ""
 ];
 
