[Survived] ObjectLiteral
models/constants/notifications/NotificationsMessageTypes.ts:1:42
-export const NotificationsMessageTypes = {
-  error: 'ERROR',
-  info: 'INFO',
-  success: 'SUCCESS',
-  cancel: 'CANCEL'
-};
+export const NotificationsMessageTypes = {};
 

[Survived] StringLiteral
models/constants/notifications/NotificationsMessageTypes.ts:2:10
 export const NotificationsMessageTypes = {
-  error: 'ERROR',
+  error: "",
   info: 'INFO',
   success: 'SUCCESS',
