[Survived] StringLiteral
core/services/icon/IconFactory.ts:10:12
   private _attributes: IIconAttributes = {
     alt: '',
     ariaLabel: 'Credit card icon',
-    class: 'st-card-icon',
+    class: "",
     id: 'card-icon',
     src: ''

[Survived] StringLiteral
core/services/icon/IconFactory.ts:12:10
     ariaLabel: 'Credit card icon',
     class: 'st-card-icon',
     id: 'card-icon',
-    src: ''
+    src: "Stryker was here!"
   };
 

[Survived] BlockStatement
core/services/icon/IconFactory.ts:17:43
 
   constructor(private _url: IconMap) {}
 
-  getIcon(name: string): HTMLImageElement {
-    const icon = document.createElement('img');
-    Object.keys(this._attributes).map((key: string) => {
-      if (this._attributes[key]) {
-        icon.setAttribute(key, this._attributes[key]);
-      }
-    });
-    icon.setAttribute('src', this._url.getUrl(name));
-    icon.setAttribute('alt', this._url.getUrl(name));
-    return icon;
-  }
+  getIcon(name: string): HTMLImageElement {}
 }
 

[Survived] StringLiteral
core/services/icon/IconFactory.ts:18:41
   constructor(private _url: IconMap) {}
 
   getIcon(name: string): HTMLImageElement {
-    const icon = document.createElement('img');
+    const icon = document.createElement("");
     Object.keys(this._attributes).map((key: string) => {
       if (this._attributes[key]) {

[Survived] BlockStatement
core/services/icon/IconFactory.ts:19:56
 
   getIcon(name: string): HTMLImageElement {
     const icon = document.createElement('img');
-    Object.keys(this._attributes).map((key: string) => {
-      if (this._attributes[key]) {
-        icon.setAttribute(key, this._attributes[key]);
-      }
-    });
+    Object.keys(this._attributes).map((key: string) => {});
     icon.setAttribute('src', this._url.getUrl(name));
     icon.setAttribute('alt', this._url.getUrl(name));

[Survived] ConditionalExpression
core/services/icon/IconFactory.ts:20:11
   getIcon(name: string): HTMLImageElement {
     const icon = document.createElement('img');
     Object.keys(this._attributes).map((key: string) => {
-      if (this._attributes[key]) {
+      if (false) {
         icon.setAttribute(key, this._attributes[key]);
       }

[Survived] ConditionalExpression
core/services/icon/IconFactory.ts:20:11
   getIcon(name: string): HTMLImageElement {
     const icon = document.createElement('img');
     Object.keys(this._attributes).map((key: string) => {
-      if (this._attributes[key]) {
+      if (true) {
         icon.setAttribute(key, this._attributes[key]);
       }

[Survived] StringLiteral
core/services/icon/IconFactory.ts:25:23
       }
     });
     icon.setAttribute('src', this._url.getUrl(name));
-    icon.setAttribute('alt', this._url.getUrl(name));
+    icon.setAttribute("", this._url.getUrl(name));
     return icon;
   }
