[Survived] StringLiteral
core/services/icon/IconMap.ts:8:13
   amex: './images/amex.png',
   astropaycard: './images/astropaycard.png',
   diners: './images/diners.png',
-  discover: './images/discover.png',
+  discover: "",
   jcb: './images/jcb.png',
   maestro: './images/maestro.png',

[Survived] StringLiteral
core/services/icon/IconMap.ts:10:12
   diners: './images/diners.png',
   discover: './images/discover.png',
   jcb: './images/jcb.png',
-  maestro: './images/maestro.png',
+  maestro: "",
   mastercard: './images/mastercard.png',
   piba: './images/piba.png',

[Survived] BlockStatement
core/services/icon/IconMap.ts:18:32
 
 @Service()
 export class IconMap {
-  getUrl(name: string): string {
-    return mapIcon[name] ? mapIcon[name] : '';
-  }
+  getUrl(name: string): string {}
 }
 
