[Survived] StringLiteral
core/services/st-codec/StCodec.class.ts:22:32
 export class StCodec {
   public static CONTENT_TYPE = 'application/json';
   public static VERSION = '1.00';
-  public static VERSION_INFO = `STJS::N/A::${version}::N/A`;
+  public static VERSION_INFO = ``;
   public static SUPPORTED_REQUEST_TYPES = [
     'WALLETVERIFY',

[Survived] StringLiteral
core/services/st-codec/StCodec.class.ts:27:5
     'WALLETVERIFY',
     'JSINIT',
     'THREEDQUERY',
-    'CACHETOKENISE',
+    "",
     'AUTH',
     'ERROR',

[Survived] BlockStatement
core/services/st-codec/StCodec.class.ts:45:47
    *   (since we prepend 'J-' the random section will be 2 char shorter)
    * @return A newly generated random request ID
    */
-  public static _createRequestId(length = 10) {
-    return 'J-' + Math.random().toString(36).substring(2, length);
-  }
+  public static _createRequestId(length = 10) {}
 
   public static getErrorData(data: any) {

[Survived] ArithmeticOperator
core/services/st-codec/StCodec.class.ts:46:12
    * @return A newly generated random request ID
    */
   public static _createRequestId(length = 10) {
-    return 'J-' + Math.random().toString(36).substring(2, length);
+    return 'J-' - Math.random().toString(36).substring(2, length);
   }
 

[Survived] BlockStatement
core/services/st-codec/StCodec.class.ts:49:41
     return 'J-' + Math.random().toString(36).substring(2, length);
   }
 
-  public static getErrorData(data: any) {
-    const { errordata, errormessage, requesttypedescription } = data;
-    return {
-      errordata,
-      errormessage,
-      requesttypedescription
-    };
-  }
+  public static getErrorData(data: any) {}
 
   public static verifyResponseObject(responseData: any, jwtResponse: string): object {

[Survived] ObjectLiteral
core/services/st-codec/StCodec.class.ts:51:12
 
   public static getErrorData(data: any) {
     const { errordata, errormessage, requesttypedescription } = data;
-    return {
-      errordata,
-      errormessage,
-      requesttypedescription
-    };
+    return {};
   }
 

[Survived] BlockStatement
core/services/st-codec/StCodec.class.ts:58:86
     };
   }
 
-  public static verifyResponseObject(responseData: any, jwtResponse: string): object {
-    if (StCodec._isInvalidResponse(responseData)) {
-      throw StCodec._handleInvalidResponse();
-    }
-    const responseContent: IResponseData = StCodec._determineResponse(responseData);
-    StCodec._handleValidGatewayResponse(responseContent, jwtResponse);
-    return responseContent;
-  }
+  public static verifyResponseObject(responseData: any, jwtResponse: string): object {}
 
   /** Publishes translated response as a TRANSACTION_COMPLETE event

[Survived] ConditionalExpression
core/services/st-codec/StCodec.class.ts:59:9
   }
 
   public static verifyResponseObject(responseData: any, jwtResponse: string): object {
-    if (StCodec._isInvalidResponse(responseData)) {
+    if (false) {
       throw StCodec._handleInvalidResponse();
     }

[Survived] BlockStatement
core/services/st-codec/StCodec.class.ts:59:51
   }
 
   public static verifyResponseObject(responseData: any, jwtResponse: string): object {
-    if (StCodec._isInvalidResponse(responseData)) {
-      throw StCodec._handleInvalidResponse();
-    }
+    if (StCodec._isInvalidResponse(responseData)) {}
     const responseContent: IResponseData = StCodec._determineResponse(responseData);
     StCodec._handleValidGatewayResponse(responseContent, jwtResponse);

[Survived] BlockStatement
core/services/st-codec/StCodec.class.ts:73:109
    * @param jwtResponse The raw JWT response from the gateway
    * @param threedresponse the response from Cardinal commerce after call to ACS
    */
-  public static publishResponse(responseData: IResponseData, jwtResponse?: string, threedresponse?: string) {
-    const translator = new Translator(StCodec._locale);
-    responseData.errormessage = translator.translate(responseData.errormessage);
-    const eventData = { ...responseData };
-    if (jwtResponse !== undefined) {
-      eventData.jwt = jwtResponse;
-    }
-    if (threedresponse !== undefined) {
-      eventData.threedresponse = threedresponse;
-    }
-    const notificationEvent: IMessageBusEvent = {
-      data: eventData,
-      type: MessageBus.EVENTS_PUBLIC.TRANSACTION_COMPLETE
-    };
-    StCodec.getMessageBus().publish(notificationEvent, true);
-  }
+  public static publishResponse(responseData: IResponseData, jwtResponse?: string, threedresponse?: string) {}
 
   public static updateJWTValue(newJWT: string) {

[Survived] ConditionalExpression
core/services/st-codec/StCodec.class.ts:77:9
     const translator = new Translator(StCodec._locale);
     responseData.errormessage = translator.translate(responseData.errormessage);
     const eventData = { ...responseData };
-    if (jwtResponse !== undefined) {
+    if (true) {
       eventData.jwt = jwtResponse;
     }

[Survived] BlockStatement
core/services/st-codec/StCodec.class.ts:77:36
     const translator = new Translator(StCodec._locale);
     responseData.errormessage = translator.translate(responseData.errormessage);
     const eventData = { ...responseData };
-    if (jwtResponse !== undefined) {
-      eventData.jwt = jwtResponse;
-    }
+    if (jwtResponse !== undefined) {}
     if (threedresponse !== undefined) {
       eventData.threedresponse = threedresponse;

[Survived] BlockStatement
core/services/st-codec/StCodec.class.ts:80:39
     if (jwtResponse !== undefined) {
       eventData.jwt = jwtResponse;
     }
-    if (threedresponse !== undefined) {
-      eventData.threedresponse = threedresponse;
-    }
+    if (threedresponse !== undefined) {}
     const notificationEvent: IMessageBusEvent = {
       data: eventData,

[Survived] ConditionalExpression
core/services/st-codec/StCodec.class.ts:80:9
     if (jwtResponse !== undefined) {
       eventData.jwt = jwtResponse;
     }
-    if (threedresponse !== undefined) {
+    if (false) {
       eventData.threedresponse = threedresponse;
     }

[Survived] BooleanLiteral
core/services/st-codec/StCodec.class.ts:87:56
       data: eventData,
       type: MessageBus.EVENTS_PUBLIC.TRANSACTION_COMPLETE
     };
-    StCodec.getMessageBus().publish(notificationEvent, true);
+    StCodec.getMessageBus().publish(notificationEvent, false);
   }
 

[Survived] BlockStatement
core/services/st-codec/StCodec.class.ts:90:48
     StCodec.getMessageBus().publish(notificationEvent, true);
   }
 
-  public static updateJWTValue(newJWT: string) {
-    StCodec.jwt = newJWT ? newJWT : StCodec.jwt;
-    StCodec.originalJwt = newJWT ? newJWT : StCodec.originalJwt;
-    const messageBusEvent: IMessageBusEvent = {
-      data: {
-        newJwt: StCodec.jwt
-      },
-      type: MessageBus.EVENTS_PUBLIC.UPDATE_JWT
-    };
-    StCodec.getMessageBus().publish(messageBusEvent, true);
-  }
+  public static updateJWTValue(newJWT: string) {}
 
   private static _notification: NotificationService;

[Survived] BooleanLiteral
core/services/st-codec/StCodec.class.ts:99:54
       },
       type: MessageBus.EVENTS_PUBLIC.UPDATE_JWT
     };
-    StCodec.getMessageBus().publish(messageBusEvent, true);
+    StCodec.getMessageBus().publish(messageBusEvent, false);
   }
 

[Survived] ArrayDeclaration
core/services/st-codec/StCodec.class.ts:106:49
   private static _messageBus: MessageBus;
   private static _frame: Frame;
   private static _locale: string;
-  private static REQUESTS_WITH_ERROR_MESSAGES = [
-    'AUTH',
-    'CACHETOKENISE',
-    'ERROR',
-    'THREEDQUERY',
-    'WALLETVERIFY',
-    'RISKDEC',
-    'SUBSCRIPTION',
-    'ACCOUNTCHECK'
-  ];
+  private static REQUESTS_WITH_ERROR_MESSAGES = [];
   private static STATUS_CODES = { invalidfield: '30000', ok: '0', declined: '70000' };
 

[Survived] StringLiteral
core/services/st-codec/StCodec.class.ts:108:5
   private static _locale: string;
   private static REQUESTS_WITH_ERROR_MESSAGES = [
     'AUTH',
-    'CACHETOKENISE',
+    "",
     'ERROR',
     'THREEDQUERY',

[Survived] StringLiteral
core/services/st-codec/StCodec.class.ts:111:5
     'CACHETOKENISE',
     'ERROR',
     'THREEDQUERY',
-    'WALLETVERIFY',
+    "",
     'RISKDEC',
     'SUBSCRIPTION',

[Survived] StringLiteral
core/services/st-codec/StCodec.class.ts:116:49
     'SUBSCRIPTION',
     'ACCOUNTCHECK'
   ];
-  private static STATUS_CODES = { invalidfield: '30000', ok: '0', declined: '70000' };
+  private static STATUS_CODES = { invalidfield: "", ok: '0', declined: '70000' };
 
   private static getMessageBus(): MessageBus {

[Survived] BlockStatement
core/services/st-codec/StCodec.class.ts:118:46
   ];
   private static STATUS_CODES = { invalidfield: '30000', ok: '0', declined: '70000' };
 
-  private static getMessageBus(): MessageBus {
-    return StCodec._messageBus || (StCodec._messageBus = Container.get(MessageBus));
-  }
+  private static getMessageBus(): MessageBus {}
 
   private static getNotification(): NotificationService {

[Survived] LogicalOperator
core/services/st-codec/StCodec.class.ts:119:12
   private static STATUS_CODES = { invalidfield: '30000', ok: '0', declined: '70000' };
 
   private static getMessageBus(): MessageBus {
-    return StCodec._messageBus || (StCodec._messageBus = Container.get(MessageBus));
+    return StCodec._messageBus && (StCodec._messageBus = Container.get(MessageBus));
   }
 

[Survived] ConditionalExpression
core/services/st-codec/StCodec.class.ts:119:12
   private static STATUS_CODES = { invalidfield: '30000', ok: '0', declined: '70000' };
 
   private static getMessageBus(): MessageBus {
-    return StCodec._messageBus || (StCodec._messageBus = Container.get(MessageBus));
+    return true;
   }
 

[Survived] BlockStatement
core/services/st-codec/StCodec.class.ts:122:57
     return StCodec._messageBus || (StCodec._messageBus = Container.get(MessageBus));
   }
 
-  private static getNotification(): NotificationService {
-    return StCodec._notification || (StCodec._notification = Container.get(NotificationService));
-  }
+  private static getNotification(): NotificationService {}
 
   private static getFrameService(): Frame {

[Survived] ConditionalExpression
core/services/st-codec/StCodec.class.ts:123:12
   }
 
   private static getNotification(): NotificationService {
-    return StCodec._notification || (StCodec._notification = Container.get(NotificationService));
+    return true;
   }
 

[Survived] LogicalOperator
core/services/st-codec/StCodec.class.ts:123:12
   }
 
   private static getNotification(): NotificationService {
-    return StCodec._notification || (StCodec._notification = Container.get(NotificationService));
+    return StCodec._notification && (StCodec._notification = Container.get(NotificationService));
   }
 

[Survived] BlockStatement
core/services/st-codec/StCodec.class.ts:126:43
     return StCodec._notification || (StCodec._notification = Container.get(NotificationService));
   }
 
-  private static getFrameService(): Frame {
-    return StCodec._frame || (StCodec._frame = Container.get(Frame));
-  }
+  private static getFrameService(): Frame {}
 
   private static _createCommunicationError() {

[Survived] LogicalOperator
core/services/st-codec/StCodec.class.ts:127:12
   }
 
   private static getFrameService(): Frame {
-    return StCodec._frame || (StCodec._frame = Container.get(Frame));
+    return StCodec._frame && (StCodec._frame = Container.get(Frame));
   }
 

[Survived] ConditionalExpression
core/services/st-codec/StCodec.class.ts:127:12
   }
 
   private static getFrameService(): Frame {
-    return StCodec._frame || (StCodec._frame = Container.get(Frame));
+    return true;
   }
 

[Survived] BlockStatement
core/services/st-codec/StCodec.class.ts:130:46
     return StCodec._frame || (StCodec._frame = Container.get(Frame));
   }
 
-  private static _createCommunicationError() {
-    return {
-      errorcode: '50003',
-      errormessage: COMMUNICATION_ERROR_INVALID_RESPONSE
-    } as IResponseData;
-  }
+  private static _createCommunicationError() {}
 
   private static _handleInvalidResponse() {

[Survived] BlockStatement
core/services/st-codec/StCodec.class.ts:137:43
     } as IResponseData;
   }
 
-  private static _handleInvalidResponse() {
-    const validation = new Validation();
-    StCodec.publishResponse(StCodec._createCommunicationError());
-    StCodec.getNotification().error(COMMUNICATION_ERROR_INVALID_RESPONSE);
-    validation.blockForm(FormState.AVAILABLE);
-    StCodec.getMessageBus().publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_ERROR_CALLBACK }, true);
-
-    return new Error(COMMUNICATION_ERROR_INVALID_RESPONSE);
-  }
+  private static _handleInvalidResponse() {}
 
   private static _isInvalidResponse(responseData: any) {

[Survived] BooleanLiteral
core/services/st-codec/StCodec.class.ts:142:102
     StCodec.publishResponse(StCodec._createCommunicationError());
     StCodec.getNotification().error(COMMUNICATION_ERROR_INVALID_RESPONSE);
     validation.blockForm(FormState.AVAILABLE);
-    StCodec.getMessageBus().publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_ERROR_CALLBACK }, true);
+    StCodec.getMessageBus().publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_ERROR_CALLBACK }, false);
 
     return new Error(COMMUNICATION_ERROR_INVALID_RESPONSE);

[Survived] BlockStatement
core/services/st-codec/StCodec.class.ts:147:56
     return new Error(COMMUNICATION_ERROR_INVALID_RESPONSE);
   }
 
-  private static _isInvalidResponse(responseData: any) {
-    return !(
-      responseData &&
-      responseData.version === StCodec.VERSION &&
-      responseData.response &&
-      responseData.response.length > 0
-    );
-  }
+  private static _isInvalidResponse(responseData: any) {}
 
   private static _determineResponse(responseData: any) {

[Survived] BooleanLiteral
core/services/st-codec/StCodec.class.ts:148:12
   }
 
   private static _isInvalidResponse(responseData: any) {
-    return !(
-      responseData &&
-      responseData.version === StCodec.VERSION &&
-      responseData.response &&
-      responseData.response.length > 0
-    );
+    return responseData && responseData.version === StCodec.VERSION && responseData.response && responseData.response.length > 0;
   }
 

[Survived] LogicalOperator
core/services/st-codec/StCodec.class.ts:149:7
 
   private static _isInvalidResponse(responseData: any) {
     return !(
-      responseData &&
-      responseData.version === StCodec.VERSION &&
-      responseData.response &&
+      responseData && responseData.version === StCodec.VERSION || responseData.response &&
       responseData.response.length > 0
     );

[Survived] ConditionalExpression
core/services/st-codec/StCodec.class.ts:149:7
 
   private static _isInvalidResponse(responseData: any) {
     return !(
-      responseData &&
-      responseData.version === StCodec.VERSION &&
-      responseData.response &&
-      responseData.response.length > 0
+      true
     );
   }

[Survived] ConditionalExpression
core/services/st-codec/StCodec.class.ts:150:7
   private static _isInvalidResponse(responseData: any) {
     return !(
       responseData &&
-      responseData.version === StCodec.VERSION &&
+      true &&
       responseData.response &&
       responseData.response.length > 0

[Survived] ConditionalExpression
core/services/st-codec/StCodec.class.ts:150:7
   private static _isInvalidResponse(responseData: any) {
     return !(
       responseData &&
-      responseData.version === StCodec.VERSION &&
+      false &&
       responseData.response &&
       responseData.response.length > 0

[Survived] ConditionalExpression
core/services/st-codec/StCodec.class.ts:152:7
       responseData &&
       responseData.version === StCodec.VERSION &&
       responseData.response &&
-      responseData.response.length > 0
+      true
     );
   }

[Survived] EqualityOperator
core/services/st-codec/StCodec.class.ts:152:7
       responseData &&
       responseData.version === StCodec.VERSION &&
       responseData.response &&
-      responseData.response.length > 0
+      responseData.response.length <= 0
     );
   }

[Survived] BlockStatement
core/services/st-codec/StCodec.class.ts:156:56
     );
   }
 
-  private static _determineResponse(responseData: any) {
-    let responseContent: IResponseData;
-    responseData.response.forEach((r: any) => {
-      if (r.customeroutput) {
-        responseContent = r;
-      }
-    });
-    if (!responseContent) {
-      responseContent = responseData.response[responseData.response.length - 1];
-    }
-    return responseContent;
-  }
+  private static _determineResponse(responseData: any) {}
 
   private static _handleValidGatewayResponse(responseContent: IResponseData, jwtResponse: string) {

[Survived] BlockStatement
core/services/st-codec/StCodec.class.ts:158:47
 
   private static _determineResponse(responseData: any) {
     let responseContent: IResponseData;
-    responseData.response.forEach((r: any) => {
-      if (r.customeroutput) {
-        responseContent = r;
-      }
-    });
+    responseData.response.forEach((r: any) => {});
     if (!responseContent) {
       responseContent = responseData.response[responseData.response.length - 1];

[Survived] ConditionalExpression
core/services/st-codec/StCodec.class.ts:159:11
   private static _determineResponse(responseData: any) {
     let responseContent: IResponseData;
     responseData.response.forEach((r: any) => {
-      if (r.customeroutput) {
+      if (true) {
         responseContent = r;
       }

[Survived] ConditionalExpression
core/services/st-codec/StCodec.class.ts:159:11
   private static _determineResponse(responseData: any) {
     let responseContent: IResponseData;
     responseData.response.forEach((r: any) => {
-      if (r.customeroutput) {
+      if (false) {
         responseContent = r;
       }

[Survived] ConditionalExpression
core/services/st-codec/StCodec.class.ts:163:9
         responseContent = r;
       }
     });
-    if (!responseContent) {
+    if (true) {
       responseContent = responseData.response[responseData.response.length - 1];
     }

[Survived] ConditionalExpression
core/services/st-codec/StCodec.class.ts:163:9
         responseContent = r;
       }
     });
-    if (!responseContent) {
+    if (false) {
       responseContent = responseData.response[responseData.response.length - 1];
     }

[Survived] ArithmeticOperator
core/services/st-codec/StCodec.class.ts:164:47
       }
     });
     if (!responseContent) {
-      responseContent = responseData.response[responseData.response.length - 1];
+      responseContent = responseData.response[responseData.response.length + 1];
     }
     return responseContent;

[Survived] BlockStatement
core/services/st-codec/StCodec.class.ts:177:81
 
     const errormessageTranslated = translator.translate(errormessage);
 
-    if (!StCodec.REQUESTS_WITH_ERROR_MESSAGES.includes(requesttypedescription)) {
-      return;
-    }
+    if (!StCodec.REQUESTS_WITH_ERROR_MESSAGES.includes(requesttypedescription)) {}
 
     if (errorcode === StCodec.STATUS_CODES.ok) {

[Survived] ConditionalExpression
core/services/st-codec/StCodec.class.ts:177:9
 
     const errormessageTranslated = translator.translate(errormessage);
 
-    if (!StCodec.REQUESTS_WITH_ERROR_MESSAGES.includes(requesttypedescription)) {
+    if (false) {
       return;
     }

[Survived] ConditionalExpression
core/services/st-codec/StCodec.class.ts:181:9
       return;
     }
 
-    if (errorcode === StCodec.STATUS_CODES.ok) {
+    if (true) {
       StCodec.publishResponse(responseContent, jwtResponse);
       return;

[Survived] EqualityOperator
core/services/st-codec/StCodec.class.ts:181:9
       return;
     }
 
-    if (errorcode === StCodec.STATUS_CODES.ok) {
+    if (errorcode !== StCodec.STATUS_CODES.ok) {
       StCodec.publishResponse(responseContent, jwtResponse);
       return;

[Survived] BlockStatement
core/services/st-codec/StCodec.class.ts:186:86
       return;
     }
 
-    if (responseContent.walletsource && responseContent.walletsource === 'APPLEPAY') {
-      StCodec.getNotification().error(errormessageTranslated);
-      StCodec.getMessageBus().publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_ERROR_CALLBACK }, true);
-      StCodec.publishResponse(responseContent, jwtResponse);
-      return;
-    }
+    if (responseContent.walletsource && responseContent.walletsource === 'APPLEPAY') {}
 
     if (errorcode === StCodec.STATUS_CODES.invalidfield) {

[Survived] ConditionalExpression
core/services/st-codec/StCodec.class.ts:186:41
       return;
     }
 
-    if (responseContent.walletsource && responseContent.walletsource === 'APPLEPAY') {
+    if (responseContent.walletsource && false) {
       StCodec.getNotification().error(errormessageTranslated);
       StCodec.getMessageBus().publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_ERROR_CALLBACK }, true);

[Survived] BooleanLiteral
core/services/st-codec/StCodec.class.ts:188:104
 
     if (responseContent.walletsource && responseContent.walletsource === 'APPLEPAY') {
       StCodec.getNotification().error(errormessageTranslated);
-      StCodec.getMessageBus().publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_ERROR_CALLBACK }, true);
+      StCodec.getMessageBus().publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_ERROR_CALLBACK }, false);
       StCodec.publishResponse(responseContent, jwtResponse);
       return;

[Survived] ObjectLiteral
core/services/st-codec/StCodec.class.ts:188:39
 
     if (responseContent.walletsource && responseContent.walletsource === 'APPLEPAY') {
       StCodec.getNotification().error(errormessageTranslated);
-      StCodec.getMessageBus().publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_ERROR_CALLBACK }, true);
+      StCodec.getMessageBus().publish({}, true);
       StCodec.publishResponse(responseContent, jwtResponse);
       return;

[Survived] BlockStatement
core/services/st-codec/StCodec.class.ts:193:58
       return;
     }
 
-    if (errorcode === StCodec.STATUS_CODES.invalidfield) {
-      validation.getErrorData(StCodec.getErrorData(responseContent));
-    }
+    if (errorcode === StCodec.STATUS_CODES.invalidfield) {}
 
     validation.blockForm(FormState.AVAILABLE);

[Survived] ConditionalExpression
core/services/st-codec/StCodec.class.ts:193:9
       return;
     }
 
-    if (errorcode === StCodec.STATUS_CODES.invalidfield) {
+    if (true) {
       validation.getErrorData(StCodec.getErrorData(responseContent));
     }

[Survived] BlockStatement
core/services/st-codec/StCodec.class.ts:204:82
     throw new Error(errormessage);
   }
 
-  private static _decodeResponseJwt(jwt: string, reject: (error: Error) => void) {
-    let decoded: any;
-    try {
-      decoded = JwtDecode(jwt) as any;
-    } catch (e) {
-      reject(StCodec._handleInvalidResponse());
-    }
-    return decoded;
-  }
+  private static _decodeResponseJwt(jwt: string, reject: (error: Error) => void) {}
 
   private readonly _requestId: string;

[Survived] BlockStatement
core/services/st-codec/StCodec.class.ts:206:9
 
   private static _decodeResponseJwt(jwt: string, reject: (error: Error) => void) {
     let decoded: any;
-    try {
-      decoded = JwtDecode(jwt) as any;
-    } catch (e) {
+    try {} catch (e) {
       reject(StCodec._handleInvalidResponse());
     }

[Survived] BlockStatement
core/services/st-codec/StCodec.class.ts:208:17
     let decoded: any;
     try {
       decoded = JwtDecode(jwt) as any;
-    } catch (e) {
-      reject(StCodec._handleInvalidResponse());
-    }
+    } catch (e) {}
     return decoded;
   }

[Survived] BlockStatement
core/services/st-codec/StCodec.class.ts:216:28
 
   private readonly _requestId: string;
 
-  constructor(jwt: string) {
-    this._requestId = StCodec._createRequestId();
-    StCodec._notification = Container.get(NotificationService);
-    StCodec.jwt = jwt;
-    StCodec.originalJwt = jwt;
-    StCodec._locale = new StJwt(StCodec.jwt).locale;
-  }
+  constructor(jwt: string) {}
 
   public buildRequestObject(requestData: object): object {

[Survived] BlockStatement
core/services/st-codec/StCodec.class.ts:224:58
     StCodec._locale = new StJwt(StCodec.jwt).locale;
   }
 
-  public buildRequestObject(requestData: object): object {
-    return {
-      acceptcustomeroutput: '1.00',
-      jwt: StCodec.jwt,
-      request: [
-        {
-          ...requestData,
-          requestid: this._requestId,
-          sitereference: new StJwt(StCodec.jwt).sitereference
-        }
-      ],
-      version: StCodec.VERSION,
-      versioninfo: StCodec.VERSION_INFO
-    };
-  }
+  public buildRequestObject(requestData: object): object {}
 
   public encode(requestObject: IStRequest) {

[Survived] StringLiteral
core/services/st-codec/StCodec.class.ts:226:29
 
   public buildRequestObject(requestData: object): object {
     return {
-      acceptcustomeroutput: '1.00',
+      acceptcustomeroutput: "",
       jwt: StCodec.jwt,
       request: [

[Survived] BlockStatement
core/services/st-codec/StCodec.class.ts:240:44
     };
   }
 
-  public encode(requestObject: IStRequest) {
-    if (
-      Object.keys(requestObject).length < StCodec.MINIMUM_REQUEST_FIELDS ||
-      !requestObject.requesttypedescriptions.every(val => StCodec.SUPPORTED_REQUEST_TYPES.includes(val))
-    ) {
-      StCodec.getMessageBus().publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_ERROR_CALLBACK }, true);
-      StCodec.getNotification().error(COMMUNICATION_ERROR_INVALID_REQUEST);
-      throw new Error(COMMUNICATION_ERROR_INVALID_REQUEST);
-    }
-    return JSON.stringify(this.buildRequestObject(requestObject));
-  }
+  public encode(requestObject: IStRequest) {}
 
   public async decode(responseObject: Response | {}): Promise<object> {

[Survived] ConditionalExpression
core/services/st-codec/StCodec.class.ts:242:7
 
   public encode(requestObject: IStRequest) {
     if (
-      Object.keys(requestObject).length < StCodec.MINIMUM_REQUEST_FIELDS ||
-      !requestObject.requesttypedescriptions.every(val => StCodec.SUPPORTED_REQUEST_TYPES.includes(val))
+      true
     ) {
       StCodec.getMessageBus().publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_ERROR_CALLBACK }, true);

[Survived] ConditionalExpression
core/services/st-codec/StCodec.class.ts:242:7
 
   public encode(requestObject: IStRequest) {
     if (
-      Object.keys(requestObject).length < StCodec.MINIMUM_REQUEST_FIELDS ||
+      true ||
       !requestObject.requesttypedescriptions.every(val => StCodec.SUPPORTED_REQUEST_TYPES.includes(val))
     ) {

[Survived] ArrowFunction
core/services/st-codec/StCodec.class.ts:243:52
   public encode(requestObject: IStRequest) {
     if (
       Object.keys(requestObject).length < StCodec.MINIMUM_REQUEST_FIELDS ||
-      !requestObject.requesttypedescriptions.every(val => StCodec.SUPPORTED_REQUEST_TYPES.includes(val))
+      !requestObject.requesttypedescriptions.every(() => undefined)
     ) {
       StCodec.getMessageBus().publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_ERROR_CALLBACK }, true);

[Survived] BooleanLiteral
core/services/st-codec/StCodec.class.ts:243:7
   public encode(requestObject: IStRequest) {
     if (
       Object.keys(requestObject).length < StCodec.MINIMUM_REQUEST_FIELDS ||
-      !requestObject.requesttypedescriptions.every(val => StCodec.SUPPORTED_REQUEST_TYPES.includes(val))
+      requestObject.requesttypedescriptions.every(val => StCodec.SUPPORTED_REQUEST_TYPES.includes(val))
     ) {
       StCodec.getMessageBus().publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_ERROR_CALLBACK }, true);

[Survived] BlockStatement
core/services/st-codec/StCodec.class.ts:244:7
     if (
       Object.keys(requestObject).length < StCodec.MINIMUM_REQUEST_FIELDS ||
       !requestObject.requesttypedescriptions.every(val => StCodec.SUPPORTED_REQUEST_TYPES.includes(val))
-    ) {
-      StCodec.getMessageBus().publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_ERROR_CALLBACK }, true);
-      StCodec.getNotification().error(COMMUNICATION_ERROR_INVALID_REQUEST);
-      throw new Error(COMMUNICATION_ERROR_INVALID_REQUEST);
-    }
+    ) {}
     return JSON.stringify(this.buildRequestObject(requestObject));
   }

[Survived] BooleanLiteral
core/services/st-codec/StCodec.class.ts:245:104
       Object.keys(requestObject).length < StCodec.MINIMUM_REQUEST_FIELDS ||
       !requestObject.requesttypedescriptions.every(val => StCodec.SUPPORTED_REQUEST_TYPES.includes(val))
     ) {
-      StCodec.getMessageBus().publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_ERROR_CALLBACK }, true);
+      StCodec.getMessageBus().publish({ type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_ERROR_CALLBACK }, false);
       StCodec.getNotification().error(COMMUNICATION_ERROR_INVALID_REQUEST);
       throw new Error(COMMUNICATION_ERROR_INVALID_REQUEST);

[Survived] BlockStatement
core/services/st-codec/StCodec.class.ts:252:71
     return JSON.stringify(this.buildRequestObject(requestObject));
   }
 
-  public async decode(responseObject: Response | {}): Promise<object> {
-    let decoded: any;
-    const promise = await new Promise((resolve, reject) => {
-      if ('json' in responseObject) {
-        responseObject.json().then(responseData => {
-          decoded = StCodec._decodeResponseJwt(responseData.jwt, reject);
-          if (decoded && decoded.payload.response[0].errorcode === '0') {
-            StCodec.jwt = decoded.payload.jwt;
-          } else {
-            StCodec.jwt = StCodec.originalJwt;
-          }
-          resolve({
-            jwt: responseData.jwt,
-            response: StCodec.verifyResponseObject(decoded.payload, responseData.jwt)
-          });
-        });
-      } else {
-        StCodec.jwt = StCodec.originalJwt;
-        reject(StCodec._handleInvalidResponse());
-      }
-    });
-    // @ts-ignore
-    return promise;
-  }
+  public async decode(responseObject: Response | {}): Promise<object> {}
 }
 
