[Survived] BlockStatement
core/services/st-codec/StCodec.class.ts:254:60
 
   public async decode(responseObject: Response | {}): Promise<object> {
     let decoded: any;
-    const promise = await new Promise((resolve, reject) => {
-      if ('json' in responseObject) {
-        responseObject.json().then(responseData => {
-          decoded = StCodec._decodeResponseJwt(responseData.jwt, reject);
-          if (decoded && decoded.payload.response[0].errorcode === '0') {
-            StCodec.jwt = decoded.payload.jwt;
-          } else {
-            StCodec.jwt = StCodec.originalJwt;
-          }
-          resolve({
-            jwt: responseData.jwt,
-            response: StCodec.verifyResponseObject(decoded.payload, responseData.jwt)
-          });
-        });
-      } else {
-        StCodec.jwt = StCodec.originalJwt;
-        reject(StCodec._handleInvalidResponse());
-      }
-    });
+    const promise = await new Promise((resolve, reject) => {});
     // @ts-ignore
     return promise;

[Survived] ConditionalExpression
core/services/st-codec/StCodec.class.ts:255:11
   public async decode(responseObject: Response | {}): Promise<object> {
     let decoded: any;
     const promise = await new Promise((resolve, reject) => {
-      if ('json' in responseObject) {
+      if (true) {
         responseObject.json().then(responseData => {
           decoded = StCodec._decodeResponseJwt(responseData.jwt, reject);

[Survived] BlockStatement
core/services/st-codec/StCodec.class.ts:255:37
   public async decode(responseObject: Response | {}): Promise<object> {
     let decoded: any;
     const promise = await new Promise((resolve, reject) => {
-      if ('json' in responseObject) {
-        responseObject.json().then(responseData => {
-          decoded = StCodec._decodeResponseJwt(responseData.jwt, reject);
-          if (decoded && decoded.payload.response[0].errorcode === '0') {
-            StCodec.jwt = decoded.payload.jwt;
-          } else {
-            StCodec.jwt = StCodec.originalJwt;
-          }
-          resolve({
-            jwt: responseData.jwt,
-            response: StCodec.verifyResponseObject(decoded.payload, responseData.jwt)
-          });
-        });
-      } else {
+      if ('json' in responseObject) {} else {
         StCodec.jwt = StCodec.originalJwt;
         reject(StCodec._handleInvalidResponse());

[Survived] BlockStatement
core/services/st-codec/StCodec.class.ts:256:52
     let decoded: any;
     const promise = await new Promise((resolve, reject) => {
       if ('json' in responseObject) {
-        responseObject.json().then(responseData => {
-          decoded = StCodec._decodeResponseJwt(responseData.jwt, reject);
-          if (decoded && decoded.payload.response[0].errorcode === '0') {
-            StCodec.jwt = decoded.payload.jwt;
-          } else {
-            StCodec.jwt = StCodec.originalJwt;
-          }
-          resolve({
-            jwt: responseData.jwt,
-            response: StCodec.verifyResponseObject(decoded.payload, responseData.jwt)
-          });
-        });
+        responseObject.json().then(responseData => {});
       } else {
         StCodec.jwt = StCodec.originalJwt;

[Survived] ConditionalExpression
core/services/st-codec/StCodec.class.ts:258:15
       if ('json' in responseObject) {
         responseObject.json().then(responseData => {
           decoded = StCodec._decodeResponseJwt(responseData.jwt, reject);
-          if (decoded && decoded.payload.response[0].errorcode === '0') {
+          if (true) {
             StCodec.jwt = decoded.payload.jwt;
           } else {

[Survived] LogicalOperator
core/services/st-codec/StCodec.class.ts:258:15
       if ('json' in responseObject) {
         responseObject.json().then(responseData => {
           decoded = StCodec._decodeResponseJwt(responseData.jwt, reject);
-          if (decoded && decoded.payload.response[0].errorcode === '0') {
+          if (decoded || decoded.payload.response[0].errorcode === '0') {
             StCodec.jwt = decoded.payload.jwt;
           } else {

[Survived] BlockStatement
core/services/st-codec/StCodec.class.ts:260:18
           decoded = StCodec._decodeResponseJwt(responseData.jwt, reject);
           if (decoded && decoded.payload.response[0].errorcode === '0') {
             StCodec.jwt = decoded.payload.jwt;
-          } else {
-            StCodec.jwt = StCodec.originalJwt;
-          }
+          } else {}
           resolve({
             jwt: responseData.jwt,

[Survived] BlockStatement
core/services/st-codec/StCodec.class.ts:268:14
             response: StCodec.verifyResponseObject(decoded.payload, responseData.jwt)
           });
         });
-      } else {
-        StCodec.jwt = StCodec.originalJwt;
-        reject(StCodec._handleInvalidResponse());
-      }
+      } else {}
     });
     // @ts-ignore
