[Survived] ObjectLiteral
core/services/st-transport/StTransport.class.ts:22:42
  */
 @Service()
 export class StTransport {
-  private static DEFAULT_FETCH_OPTIONS = {
-    headers: {
-      Accept: StCodec.CONTENT_TYPE,
-      'Content-Type': StCodec.CONTENT_TYPE
-    },
-    method: 'post'
-  };
+  private static DEFAULT_FETCH_OPTIONS = {};
 
   public static readonly THROTTLE_TIME = 250;

[Survived] BlockStatement
core/services/st-transport/StTransport.class.ts:47:72
    * @param requestObject A request object to send to ST
    * @return A Promise object that resolves the gateway response
    */
-  public async sendRequest(requestObject: IStRequest): Promise<object> {
-    const requestBody = this.getCodec().encode(requestObject);
-
-    if (!this._throttlingRequests.has(requestBody)) {
-      this._throttlingRequests.set(requestBody, this.sendRequestInternal(requestBody));
-      setTimeout(() => this._throttlingRequests.delete(requestBody), StTransport.THROTTLE_TIME);
-    }
-
-    return this._throttlingRequests.get(requestBody);
-  }
+  public async sendRequest(requestObject: IStRequest): Promise<object> {}
 
   private sendRequestInternal(requestBody: string): Promise<object> {

[Survived] BooleanLiteral
core/services/st-transport/StTransport.class.ts:50:9
   public async sendRequest(requestObject: IStRequest): Promise<object> {
     const requestBody = this.getCodec().encode(requestObject);
 
-    if (!this._throttlingRequests.has(requestBody)) {
+    if (this._throttlingRequests.has(requestBody)) {
       this._throttlingRequests.set(requestBody, this.sendRequestInternal(requestBody));
       setTimeout(() => this._throttlingRequests.delete(requestBody), StTransport.THROTTLE_TIME);

[Survived] ConditionalExpression
core/services/st-transport/StTransport.class.ts:50:9
   public async sendRequest(requestObject: IStRequest): Promise<object> {
     const requestBody = this.getCodec().encode(requestObject);
 
-    if (!this._throttlingRequests.has(requestBody)) {
+    if (false) {
       this._throttlingRequests.set(requestBody, this.sendRequestInternal(requestBody));
       setTimeout(() => this._throttlingRequests.delete(requestBody), StTransport.THROTTLE_TIME);

[Survived] ArrowFunction
core/services/st-transport/StTransport.class.ts:52:18
 
     if (!this._throttlingRequests.has(requestBody)) {
       this._throttlingRequests.set(requestBody, this.sendRequestInternal(requestBody));
-      setTimeout(() => this._throttlingRequests.delete(requestBody), StTransport.THROTTLE_TIME);
+      setTimeout(() => undefined, StTransport.THROTTLE_TIME);
     }
 

[Survived] BlockStatement
core/services/st-transport/StTransport.class.ts:58:69
     return this._throttlingRequests.get(requestBody);
   }
 
-  private sendRequestInternal(requestBody: string): Promise<object> {
-    const codec = this.getCodec();
-    const gatewayUrl = this.getConfig().datacenterurl;
-
-    return this._fetchRetry(gatewayUrl, {
-      ...StTransport.DEFAULT_FETCH_OPTIONS,
-      body: requestBody
-    })
-      .then(codec.decode)
-      .catch(() => {
-        return codec.decode({});
-      });
-  }
+  private sendRequestInternal(requestBody: string): Promise<object> {}
 
   /**

[Survived] BlockStatement
core/services/st-transport/StTransport.class.ts:67:20
       body: requestBody
     })
       .then(codec.decode)
-      .catch(() => {
-        return codec.decode({});
-      });
+      .catch(() => {});
   }
 

[Survived] BlockStatement
core/services/st-transport/StTransport.class.ts:91:5
     delay = StTransport.DELAY,
     retries = StTransport.RETRY_LIMIT,
     retryTimeout = StTransport.RETRY_TIMEOUT
-  ) {
-    return Utils.retryPromise(
-      () => Utils.promiseWithTimeout<Response>(() => fetch(url, options), connectTimeout),
-      delay,
-      retries,
-      retryTimeout
-    );
-  }
+  ) {}
 
   private getConfig(): IConfig {

[Survived] ArrowFunction
core/services/st-transport/StTransport.class.ts:93:48
     retryTimeout = StTransport.RETRY_TIMEOUT
   ) {
     return Utils.retryPromise(
-      () => Utils.promiseWithTimeout<Response>(() => fetch(url, options), connectTimeout),
+      () => Utils.promiseWithTimeout<Response>(() => undefined, connectTimeout),
       delay,
       retries,

[Survived] ArrowFunction
core/services/st-transport/StTransport.class.ts:93:7
     retryTimeout = StTransport.RETRY_TIMEOUT
   ) {
     return Utils.retryPromise(
-      () => Utils.promiseWithTimeout<Response>(() => fetch(url, options), connectTimeout),
+      () => undefined,
       delay,
       retries,

[Survived] BlockStatement
core/services/st-transport/StTransport.class.ts:100:32
     );
   }
 
-  private getConfig(): IConfig {
-    if (!this._config) {
-      this._config = this.configProvider.getConfig();
-    }
-
-    return this._config;
-  }
+  private getConfig(): IConfig {}
 
   private getCodec(): StCodec {

[Survived] BooleanLiteral
core/services/st-transport/StTransport.class.ts:101:9
   }
 
   private getConfig(): IConfig {
-    if (!this._config) {
+    if (this._config) {
       this._config = this.configProvider.getConfig();
     }

[Survived] BlockStatement
core/services/st-transport/StTransport.class.ts:101:24
   }
 
   private getConfig(): IConfig {
-    if (!this._config) {
-      this._config = this.configProvider.getConfig();
-    }
+    if (!this._config) {}
 
     return this._config;

[Survived] BlockStatement
core/services/st-transport/StTransport.class.ts:108:31
     return this._config;
   }
 
-  private getCodec(): StCodec {
-    if (!this._codec) {
-      const { jwt } = this.getConfig();
-      this._codec = new StCodec(jwt);
-    }
-
-    return this._codec;
-  }
+  private getCodec(): StCodec {}
 }
 

[Survived] ConditionalExpression
core/services/st-transport/StTransport.class.ts:109:9
   }
 
   private getCodec(): StCodec {
-    if (!this._codec) {
+    if (false) {
       const { jwt } = this.getConfig();
       this._codec = new StCodec(jwt);

[Survived] ConditionalExpression
core/services/st-transport/StTransport.class.ts:109:9
   }
 
   private getCodec(): StCodec {
-    if (!this._codec) {
+    if (true) {
       const { jwt } = this.getConfig();
       this._codec = new StCodec(jwt);
