[Survived] BlockStatement
core/services/store-config-provider/StoreConfigProvider.ts:12:24
 export class StoreConfigProvider implements ConfigProvider {
   constructor(private store: Store) {}
 
-  getConfig(): IConfig {
-    return this.store.getState().config.config;
-  }
+  getConfig(): IConfig {}
 
   getConfig$(watchForChanges?: boolean): Observable<IConfig> {

[Survived] BlockStatement
core/services/store-config-provider/StoreConfigProvider.ts:16:62
     return this.store.getState().config.config;
   }
 
-  getConfig$(watchForChanges?: boolean): Observable<IConfig> {
-    const config$: Observable<IConfig> = this.store
-      .select$(state => state.config.config)
-      .pipe(filter<IConfig>(Boolean));
-
-    return watchForChanges ? config$ : config$.pipe(first());
-  }
+  getConfig$(watchForChanges?: boolean): Observable<IConfig> {}
 }
 

[Survived] ArrowFunction
core/services/store-config-provider/StoreConfigProvider.ts:18:16
 
   getConfig$(watchForChanges?: boolean): Observable<IConfig> {
     const config$: Observable<IConfig> = this.store
-      .select$(state => state.config.config)
+      .select$(() => undefined)
       .pipe(filter<IConfig>(Boolean));
 
