[Survived] BlockStatement
core/shared/array-utils/ArrayUtils.ts:2:44
 export class ArrayUtils {
-  public static unique<T>(array: T[]): T[] {
-    return Array.from(new Set(array).values());
-  }
+  public static unique<T>(array: T[]): T[] {}
 
   public static equals(a: any[], b: any[]): boolean {

[Survived] BlockStatement
core/shared/array-utils/ArrayUtils.ts:6:53
     return Array.from(new Set(array).values());
   }
 
-  public static equals(a: any[], b: any[]): boolean {
-    return a.length === b.length && JSON.stringify(a) === JSON.stringify(b);
-  }
+  public static equals(a: any[], b: any[]): boolean {}
 }
 

[Survived] ConditionalExpression
core/shared/array-utils/ArrayUtils.ts:7:12
   }
 
   public static equals(a: any[], b: any[]): boolean {
-    return a.length === b.length && JSON.stringify(a) === JSON.stringify(b);
+    return false;
   }
 }

[Survived] ConditionalExpression
core/shared/array-utils/ArrayUtils.ts:7:12
   }
 
   public static equals(a: any[], b: any[]): boolean {
-    return a.length === b.length && JSON.stringify(a) === JSON.stringify(b);
+    return false && JSON.stringify(a) === JSON.stringify(b);
   }
 }
