[Survived] StringLiteral
core/shared/dom-methods/DomMethods.ts:5:45
 
 export class DomMethods {
   private static BODY_MARKUP: string = 'body';
-  private static HIDDEN_ATTRIBUTE: string = 'hidden';
+  private static HIDDEN_ATTRIBUTE: string = "";
   private static INPUT_MARKUP: string = 'input';
   private static SCRIPT_MARKUP: string = 'script';

[Survived] StringLiteral
core/shared/dom-methods/DomMethods.ts:7:42
   private static BODY_MARKUP: string = 'body';
   private static HIDDEN_ATTRIBUTE: string = 'hidden';
   private static INPUT_MARKUP: string = 'input';
-  private static SCRIPT_MARKUP: string = 'script';
+  private static SCRIPT_MARKUP: string = "";
   private static SELECT_MARKUP: string = 'select';
   private static SRC_ATTRIBUTE: string = 'src';

[Survived] StringLiteral
core/shared/dom-methods/DomMethods.ts:9:42
   private static INPUT_MARKUP: string = 'input';
   private static SCRIPT_MARKUP: string = 'script';
   private static SELECT_MARKUP: string = 'select';
-  private static SRC_ATTRIBUTE: string = 'src';
+  private static SRC_ATTRIBUTE: string = "";
   private static ST_NAME_ATTRIBUTE: string = 'data-st-name';
   private static STYLE_MARKUP: string = 'style';

[Survived] StringLiteral
core/shared/dom-methods/DomMethods.ts:10:46
   private static SCRIPT_MARKUP: string = 'script';
   private static SELECT_MARKUP: string = 'select';
   private static SRC_ATTRIBUTE: string = 'src';
-  private static ST_NAME_ATTRIBUTE: string = 'data-st-name';
+  private static ST_NAME_ATTRIBUTE: string = "";
   private static STYLE_MARKUP: string = 'style';
 

[Survived] BlockStatement
core/shared/dom-methods/DomMethods.ts:13:90
   private static ST_NAME_ATTRIBUTE: string = 'data-st-name';
   private static STYLE_MARKUP: string = 'style';
 
-  public static addDataToForm(form: HTMLFormElement, data: any, fields?: string[]): void {
-    Object.entries(data).forEach(([field, value]) => {
-      if (!fields || fields.includes(field)) {
-        let inputElement: HTMLInputElement = form.querySelector(`${DomMethods.INPUT_MARKUP}[name="${field}"]`);
-
-        if (inputElement) {
-          inputElement.value = value ? value.toString() : '';
-        } else {
-          inputElement = DomMethods.createHtmlElement(
-            {
-              name: field,
-              type: DomMethods.HIDDEN_ATTRIBUTE,
-              value
-            },
-            DomMethods.INPUT_MARKUP
-          ) as HTMLInputElement;
-        }
-
-        form.appendChild(inputElement);
-      }
-    });
-  }
+  public static addDataToForm(form: HTMLFormElement, data: any, fields?: string[]): void {}
 
   public static addListener(targetId: string, listenerType: string, callback: any): void {

[Survived] BlockStatement
core/shared/dom-methods/DomMethods.ts:14:54
   private static STYLE_MARKUP: string = 'style';
 
   public static addDataToForm(form: HTMLFormElement, data: any, fields?: string[]): void {
-    Object.entries(data).forEach(([field, value]) => {
-      if (!fields || fields.includes(field)) {
-        let inputElement: HTMLInputElement = form.querySelector(`${DomMethods.INPUT_MARKUP}[name="${field}"]`);
-
-        if (inputElement) {
-          inputElement.value = value ? value.toString() : '';
-        } else {
-          inputElement = DomMethods.createHtmlElement(
-            {
-              name: field,
-              type: DomMethods.HIDDEN_ATTRIBUTE,
-              value
-            },
-            DomMethods.INPUT_MARKUP
-          ) as HTMLInputElement;
-        }
-
-        form.appendChild(inputElement);
-      }
-    });
+    Object.entries(data).forEach(([field, value]) => {});
   }
 

[Survived] LogicalOperator
core/shared/dom-methods/DomMethods.ts:15:11
 
   public static addDataToForm(form: HTMLFormElement, data: any, fields?: string[]): void {
     Object.entries(data).forEach(([field, value]) => {
-      if (!fields || fields.includes(field)) {
+      if (!fields && fields.includes(field)) {
         let inputElement: HTMLInputElement = form.querySelector(`${DomMethods.INPUT_MARKUP}[name="${field}"]`);
 

[Survived] ConditionalExpression
core/shared/dom-methods/DomMethods.ts:15:11
 
   public static addDataToForm(form: HTMLFormElement, data: any, fields?: string[]): void {
     Object.entries(data).forEach(([field, value]) => {
-      if (!fields || fields.includes(field)) {
+      if (false) {
         let inputElement: HTMLInputElement = form.querySelector(`${DomMethods.INPUT_MARKUP}[name="${field}"]`);
 

[Survived] StringLiteral
core/shared/dom-methods/DomMethods.ts:16:65
   public static addDataToForm(form: HTMLFormElement, data: any, fields?: string[]): void {
     Object.entries(data).forEach(([field, value]) => {
       if (!fields || fields.includes(field)) {
-        let inputElement: HTMLInputElement = form.querySelector(`${DomMethods.INPUT_MARKUP}[name="${field}"]`);
+        let inputElement: HTMLInputElement = form.querySelector(``);
 
         if (inputElement) {

[Survived] ConditionalExpression
core/shared/dom-methods/DomMethods.ts:18:13
       if (!fields || fields.includes(field)) {
         let inputElement: HTMLInputElement = form.querySelector(`${DomMethods.INPUT_MARKUP}[name="${field}"]`);
 
-        if (inputElement) {
+        if (true) {
           inputElement.value = value ? value.toString() : '';
         } else {

[Survived] BlockStatement
core/shared/dom-methods/DomMethods.ts:18:27
       if (!fields || fields.includes(field)) {
         let inputElement: HTMLInputElement = form.querySelector(`${DomMethods.INPUT_MARKUP}[name="${field}"]`);
 
-        if (inputElement) {
-          inputElement.value = value ? value.toString() : '';
-        } else {
+        if (inputElement) {} else {
           inputElement = DomMethods.createHtmlElement(
             {

[Survived] StringLiteral
core/shared/dom-methods/DomMethods.ts:19:59
         let inputElement: HTMLInputElement = form.querySelector(`${DomMethods.INPUT_MARKUP}[name="${field}"]`);
 
         if (inputElement) {
-          inputElement.value = value ? value.toString() : '';
+          inputElement.value = value ? value.toString() : "Stryker was here!";
         } else {
           inputElement = DomMethods.createHtmlElement(

[Survived] BlockStatement
core/shared/dom-methods/DomMethods.ts:20:16
 
         if (inputElement) {
           inputElement.value = value ? value.toString() : '';
-        } else {
-          inputElement = DomMethods.createHtmlElement(
-            {
-              name: field,
-              type: DomMethods.HIDDEN_ATTRIBUTE,
-              value
-            },
-            DomMethods.INPUT_MARKUP
-          ) as HTMLInputElement;
-        }
+        } else {}
 
         form.appendChild(inputElement);

[Survived] BlockStatement
core/shared/dom-methods/DomMethods.ts:36:90
     });
   }
 
-  public static addListener(targetId: string, listenerType: string, callback: any): void {
-    document.getElementById(targetId).addEventListener(listenerType, callback);
-  }
+  public static addListener(targetId: string, listenerType: string, callback: any): void {}
 
   public static appendChildIntoDOM(target: string, child: HTMLElement): Element {

[Survived] BlockStatement
core/shared/dom-methods/DomMethods.ts:40:81
     document.getElementById(targetId).addEventListener(listenerType, callback);
   }
 
-  public static appendChildIntoDOM(target: string, child: HTMLElement): Element {
-    const element: Element = document.getElementById(target)
-      ? document.getElementById(target)
-      : document.getElementsByTagName(DomMethods.BODY_MARKUP)[0];
-    element.appendChild(child);
-    return element;
-  }
+  public static appendChildIntoDOM(target: string, child: HTMLElement): Element {}
 
   public static createHtmlElement = (attributes: any, markup: string): HTMLElement => {

[Survived] BlockStatement
core/shared/dom-methods/DomMethods.ts:48:87
     return element;
   }
 
-  public static createHtmlElement = (attributes: any, markup: string): HTMLElement => {
-    const element: HTMLElement = document.createElement(markup);
-    Object.keys(attributes).map(item => element.setAttribute(item, attributes[item]));
-    return element;
-  };
+  public static createHtmlElement = (attributes: any, markup: string): HTMLElement => {};
 
   public static getAllFormElements = (form: HTMLElement): any[] => [

[Survived] ArrowFunction
core/shared/dom-methods/DomMethods.ts:50:33
 
   public static createHtmlElement = (attributes: any, markup: string): HTMLElement => {
     const element: HTMLElement = document.createElement(markup);
-    Object.keys(attributes).map(item => element.setAttribute(item, attributes[item]));
+    Object.keys(attributes).map(() => undefined);
     return element;
   };

[Survived] ArrowFunction
core/shared/dom-methods/DomMethods.ts:54:38
     return element;
   };
 
-  public static getAllFormElements = (form: HTMLElement): any[] => [
-    ...Array.from(form.querySelectorAll(DomMethods.SELECT_MARKUP)),
-    ...Array.from(form.querySelectorAll(DomMethods.INPUT_MARKUP))
-  ];
+  public static getAllFormElements = () => undefined;
 
   public static insertScript(target: string, params: IScriptParams): Promise<Element> {

[Survived] BlockStatement
core/shared/dom-methods/DomMethods.ts:59:87
     ...Array.from(form.querySelectorAll(DomMethods.INPUT_MARKUP))
   ];
 
-  public static insertScript(target: string, params: IScriptParams): Promise<Element> {
-    return new Promise((resolve, reject) => {
-      const loaded: Element = DomMethods.isScriptLoaded(params);
-      if (loaded) {
-        resolve(loaded);
-      } else {
-        const targetElement: Element = document.getElementsByTagName(target)[0];
-        const script: Element = DomMethods.setMarkupAttributes(DomMethods.SCRIPT_MARKUP, params);
-        targetElement.appendChild(script);
-        script.addEventListener('load', () => {
-          resolve(script);
-        });
-      }
-    });
-  }
+  public static insertScript(target: string, params: IScriptParams): Promise<Element> {}
 
   public static insertStyle(contents: string[]): void {

[Survived] BlockStatement
core/shared/dom-methods/DomMethods.ts:60:45
   ];
 
   public static insertScript(target: string, params: IScriptParams): Promise<Element> {
-    return new Promise((resolve, reject) => {
-      const loaded: Element = DomMethods.isScriptLoaded(params);
-      if (loaded) {
-        resolve(loaded);
-      } else {
-        const targetElement: Element = document.getElementsByTagName(target)[0];
-        const script: Element = DomMethods.setMarkupAttributes(DomMethods.SCRIPT_MARKUP, params);
-        targetElement.appendChild(script);
-        script.addEventListener('load', () => {
-          resolve(script);
-        });
-      }
-    });
+    return new Promise((resolve, reject) => {});
   }
 

[Survived] ConditionalExpression
core/shared/dom-methods/DomMethods.ts:62:11
   public static insertScript(target: string, params: IScriptParams): Promise<Element> {
     return new Promise((resolve, reject) => {
       const loaded: Element = DomMethods.isScriptLoaded(params);
-      if (loaded) {
+      if (false) {
         resolve(loaded);
       } else {

[Survived] BlockStatement
core/shared/dom-methods/DomMethods.ts:62:19
   public static insertScript(target: string, params: IScriptParams): Promise<Element> {
     return new Promise((resolve, reject) => {
       const loaded: Element = DomMethods.isScriptLoaded(params);
-      if (loaded) {
-        resolve(loaded);
-      } else {
+      if (loaded) {} else {
         const targetElement: Element = document.getElementsByTagName(target)[0];
         const script: Element = DomMethods.setMarkupAttributes(DomMethods.SCRIPT_MARKUP, params);

[Survived] BlockStatement
core/shared/dom-methods/DomMethods.ts:64:14
       const loaded: Element = DomMethods.isScriptLoaded(params);
       if (loaded) {
         resolve(loaded);
-      } else {
-        const targetElement: Element = document.getElementsByTagName(target)[0];
-        const script: Element = DomMethods.setMarkupAttributes(DomMethods.SCRIPT_MARKUP, params);
-        targetElement.appendChild(script);
-        script.addEventListener('load', () => {
-          resolve(script);
-        });
-      }
+      } else {}
     });
   }

[Survived] BlockStatement
core/shared/dom-methods/DomMethods.ts:68:47
         const targetElement: Element = document.getElementsByTagName(target)[0];
         const script: Element = DomMethods.setMarkupAttributes(DomMethods.SCRIPT_MARKUP, params);
         targetElement.appendChild(script);
-        script.addEventListener('load', () => {
-          resolve(script);
-        });
+        script.addEventListener('load', () => {});
       }
     });

[Survived] BlockStatement
core/shared/dom-methods/DomMethods.ts:75:55
     });
   }
 
-  public static insertStyle(contents: string[]): void {
-    let style: HTMLStyleElement = document.getElementById('insertedStyles') as HTMLStyleElement;
-
-    if (!style) {
-      style = document.createElement(DomMethods.STYLE_MARKUP) as HTMLStyleElement;
-      style.setAttribute('id', 'insertedStyles');
-      style.setAttribute('type', 'text/css');
-      document.head.appendChild(style);
-    }
-    contents.forEach((item: string) => (style.sheet as CSSStyleSheet).insertRule(item, 0));
-  }
+  public static insertStyle(contents: string[]): void {}
 
   public static parseForm(formId: string): {} {

[Survived] ConditionalExpression
core/shared/dom-methods/DomMethods.ts:78:9
   public static insertStyle(contents: string[]): void {
     let style: HTMLStyleElement = document.getElementById('insertedStyles') as HTMLStyleElement;
 
-    if (!style) {
+    if (false) {
       style = document.createElement(DomMethods.STYLE_MARKUP) as HTMLStyleElement;
       style.setAttribute('id', 'insertedStyles');

[Survived] ConditionalExpression
core/shared/dom-methods/DomMethods.ts:78:9
   public static insertStyle(contents: string[]): void {
     let style: HTMLStyleElement = document.getElementById('insertedStyles') as HTMLStyleElement;
 
-    if (!style) {
+    if (true) {
       style = document.createElement(DomMethods.STYLE_MARKUP) as HTMLStyleElement;
       style.setAttribute('id', 'insertedStyles');

[Survived] ArrowFunction
core/shared/dom-methods/DomMethods.ts:84:22
       style.setAttribute('type', 'text/css');
       document.head.appendChild(style);
     }
-    contents.forEach((item: string) => (style.sheet as CSSStyleSheet).insertRule(item, 0));
+    contents.forEach(() => undefined);
   }
 

[Survived] BlockStatement
core/shared/dom-methods/DomMethods.ts:87:47
     contents.forEach((item: string) => (style.sheet as CSSStyleSheet).insertRule(item, 0));
   }
 
-  public static parseForm(formId: string): {} {
-    const form: HTMLElement = document.getElementById(formId);
-    const els = DomMethods.getAllFormElements(form);
-    const result: any = {};
-    for (const el of els) {
-      if (el.hasAttribute(DomMethods.ST_NAME_ATTRIBUTE)) {
-        result[el.getAttribute(DomMethods.ST_NAME_ATTRIBUTE)] = el.value;
-      }
-    }
-    return result;
-  }
+  public static parseForm(formId: string): {} {}
 
   public static removeAllChildren(placement: string): HTMLElement {

[Survived] BlockStatement
core/shared/dom-methods/DomMethods.ts:91:27
     const form: HTMLElement = document.getElementById(formId);
     const els = DomMethods.getAllFormElements(form);
     const result: any = {};
-    for (const el of els) {
-      if (el.hasAttribute(DomMethods.ST_NAME_ATTRIBUTE)) {
-        result[el.getAttribute(DomMethods.ST_NAME_ATTRIBUTE)] = el.value;
-      }
-    }
+    for (const el of els) {}
     return result;
   }

[Survived] ConditionalExpression
core/shared/dom-methods/DomMethods.ts:92:11
     const els = DomMethods.getAllFormElements(form);
     const result: any = {};
     for (const el of els) {
-      if (el.hasAttribute(DomMethods.ST_NAME_ATTRIBUTE)) {
+      if (false) {
         result[el.getAttribute(DomMethods.ST_NAME_ATTRIBUTE)] = el.value;
       }

[Survived] ConditionalExpression
core/shared/dom-methods/DomMethods.ts:92:11
     const els = DomMethods.getAllFormElements(form);
     const result: any = {};
     for (const el of els) {
-      if (el.hasAttribute(DomMethods.ST_NAME_ATTRIBUTE)) {
+      if (true) {
         result[el.getAttribute(DomMethods.ST_NAME_ATTRIBUTE)] = el.value;
       }

[Survived] BlockStatement
core/shared/dom-methods/DomMethods.ts:99:67
     return result;
   }
 
-  public static removeAllChildren(placement: string): HTMLElement {
-    const element: HTMLElement = document.getElementById(placement);
-    if (!element) {
-      return element;
-    }
-    while (element.lastChild) {
-      element.removeChild(element.lastChild);
-    }
-    return element;
-  }
+  public static removeAllChildren(placement: string): HTMLElement {}
 
   private static isScriptLoaded(params: IScriptParams): Element {

[Survived] ConditionalExpression
core/shared/dom-methods/DomMethods.ts:101:9
 
   public static removeAllChildren(placement: string): HTMLElement {
     const element: HTMLElement = document.getElementById(placement);
-    if (!element) {
+    if (false) {
       return element;
     }

[Survived] BlockStatement
core/shared/dom-methods/DomMethods.ts:101:19
 
   public static removeAllChildren(placement: string): HTMLElement {
     const element: HTMLElement = document.getElementById(placement);
-    if (!element) {
-      return element;
-    }
+    if (!element) {}
     while (element.lastChild) {
       element.removeChild(element.lastChild);

[Survived] ConditionalExpression
core/shared/dom-methods/DomMethods.ts:104:12
     if (!element) {
       return element;
     }
-    while (element.lastChild) {
+    while (false) {
       element.removeChild(element.lastChild);
     }

[Survived] BlockStatement
core/shared/dom-methods/DomMethods.ts:104:31
     if (!element) {
       return element;
     }
-    while (element.lastChild) {
-      element.removeChild(element.lastChild);
-    }
+    while (element.lastChild) {}
     return element;
   }

[Survived] BlockStatement
core/shared/dom-methods/DomMethods.ts:110:65
     return element;
   }
 
-  private static isScriptLoaded(params: IScriptParams): Element {
-    const { src, id } = params;
-    const scripts: HTMLCollection = document.getElementsByTagName(DomMethods.SCRIPT_MARKUP);
-    const scriptById: HTMLElement = document.getElementById(id);
-    if (scriptById) {
-      return scriptById;
-    }
-    for (const script of Array.from(scripts)) {
-      if (script.getAttribute(DomMethods.SRC_ATTRIBUTE) === src) {
-        return script;
-      }
-    }
-  }
+  private static isScriptLoaded(params: IScriptParams): Element {}
 
   private static setMarkupAttributes(target: string, params: any): Element {

[Survived] ConditionalExpression
core/shared/dom-methods/DomMethods.ts:114:9
     const { src, id } = params;
     const scripts: HTMLCollection = document.getElementsByTagName(DomMethods.SCRIPT_MARKUP);
     const scriptById: HTMLElement = document.getElementById(id);
-    if (scriptById) {
+    if (true) {
       return scriptById;
     }

[Survived] BlockStatement
core/shared/dom-methods/DomMethods.ts:114:21
     const { src, id } = params;
     const scripts: HTMLCollection = document.getElementsByTagName(DomMethods.SCRIPT_MARKUP);
     const scriptById: HTMLElement = document.getElementById(id);
-    if (scriptById) {
-      return scriptById;
-    }
+    if (scriptById) {}
     for (const script of Array.from(scripts)) {
       if (script.getAttribute(DomMethods.SRC_ATTRIBUTE) === src) {

[Survived] BlockStatement
core/shared/dom-methods/DomMethods.ts:117:47
     if (scriptById) {
       return scriptById;
     }
-    for (const script of Array.from(scripts)) {
-      if (script.getAttribute(DomMethods.SRC_ATTRIBUTE) === src) {
-        return script;
-      }
-    }
+    for (const script of Array.from(scripts)) {}
   }
 

[Survived] ConditionalExpression
core/shared/dom-methods/DomMethods.ts:118:11
       return scriptById;
     }
     for (const script of Array.from(scripts)) {
-      if (script.getAttribute(DomMethods.SRC_ATTRIBUTE) === src) {
+      if (true) {
         return script;
       }

[Survived] EqualityOperator
core/shared/dom-methods/DomMethods.ts:118:11
       return scriptById;
     }
     for (const script of Array.from(scripts)) {
-      if (script.getAttribute(DomMethods.SRC_ATTRIBUTE) === src) {
+      if (script.getAttribute(DomMethods.SRC_ATTRIBUTE) !== src) {
         return script;
       }

[Survived] BlockStatement
core/shared/dom-methods/DomMethods.ts:124:76
     }
   }
 
-  private static setMarkupAttributes(target: string, params: any): Element {
-    const element: Element = document.createElement(target) as Element;
-    Object.keys(params).forEach((param: string) => {
-      // @ts-ignore
-      element.setAttribute(param, params[param]);
-    });
-    return element;
-  }
+  private static setMarkupAttributes(target: string, params: any): Element {}
 }
 

[Survived] BlockStatement
core/shared/dom-methods/DomMethods.ts:126:52
 
   private static setMarkupAttributes(target: string, params: any): Element {
     const element: Element = document.createElement(target) as Element;
-    Object.keys(params).forEach((param: string) => {
-      // @ts-ignore
-      element.setAttribute(param, params[param]);
-    });
+    Object.keys(params).forEach((param: string) => {});
     return element;
   }
