[Survived] ObjectLiteral
core/shared/formatter/Formatter.ts:9:25
 export class Formatter {
   private _blocks: number[] = [2, 2];
   private _cardNumberFormatted: string;
-  private _dateBlocks = {
-    currentDateMonth: '',
-    currentDateYear: '',
-    previousDateYear: ''
-  };
+  private _dateBlocks = {};
   private _date: string[] = ['', ''];
   private _validation: Validation;

[Survived] StringLiteral
core/shared/formatter/Formatter.ts:10:23
   private _blocks: number[] = [2, 2];
   private _cardNumberFormatted: string;
   private _dateBlocks = {
-    currentDateMonth: '',
+    currentDateMonth: "Stryker was here!",
     currentDateYear: '',
     previousDateYear: ''

[Survived] StringLiteral
core/shared/formatter/Formatter.ts:12:23
   private _dateBlocks = {
     currentDateMonth: '',
     currentDateYear: '',
-    previousDateYear: ''
+    previousDateYear: "Stryker was here!"
   };
   private _date: string[] = ['', ''];

[Survived] BlockStatement
core/shared/formatter/Formatter.ts:17:17
   private _date: string[] = ['', ''];
   private _validation: Validation;
 
-  constructor() {
-    this._validation = Container.get(Validation);
-  }
+  constructor() {}
 
   public number(cardNumber: string, id: string) {

[Survived] BlockStatement
core/shared/formatter/Formatter.ts:32:37
     let value = previousValue;
     let selectEnd = element.selectionEnd;
     let selectStart = element.selectionStart;
-    if (format && value.length > 0) {
-      value = Utils.stripChars(value, undefined);
-      let matches = value.match(new RegExp(format, '')).slice(1);
-      if (Utils.inArray(matches, undefined)) {
-        matches = matches.slice(0, matches.indexOf(undefined));
-      }
-      const matched = matches.length;
-      if (format && matched > 1) {
-        const preMatched = previousValue.split(' ').length;
-        selectStart += matched - preMatched;
-        selectEnd += matched - preMatched;
-        value = matches.join(' ');
-      }
-    }
+    if (format && value.length > 0) {}
 
     if (value !== previousValue) {

[Survived] LogicalOperator
core/shared/formatter/Formatter.ts:32:9
     let value = previousValue;
     let selectEnd = element.selectionEnd;
     let selectStart = element.selectionStart;
-    if (format && value.length > 0) {
+    if (format || value.length > 0) {
       value = Utils.stripChars(value, undefined);
       let matches = value.match(new RegExp(format, '')).slice(1);

[Survived] BlockStatement
core/shared/formatter/Formatter.ts:35:46
     if (format && value.length > 0) {
       value = Utils.stripChars(value, undefined);
       let matches = value.match(new RegExp(format, '')).slice(1);
-      if (Utils.inArray(matches, undefined)) {
-        matches = matches.slice(0, matches.indexOf(undefined));
-      }
+      if (Utils.inArray(matches, undefined)) {}
       const matched = matches.length;
       if (format && matched > 1) {

[Survived] ConditionalExpression
core/shared/formatter/Formatter.ts:35:11
     if (format && value.length > 0) {
       value = Utils.stripChars(value, undefined);
       let matches = value.match(new RegExp(format, '')).slice(1);
-      if (Utils.inArray(matches, undefined)) {
+      if (false) {
         matches = matches.slice(0, matches.indexOf(undefined));
       }

[Survived] ConditionalExpression
core/shared/formatter/Formatter.ts:39:21
         matches = matches.slice(0, matches.indexOf(undefined));
       }
       const matched = matches.length;
-      if (format && matched > 1) {
+      if (format && false) {
         const preMatched = previousValue.split(' ').length;
         selectStart += matched - preMatched;

[Survived] EqualityOperator
core/shared/formatter/Formatter.ts:39:21
         matches = matches.slice(0, matches.indexOf(undefined));
       }
       const matched = matches.length;
-      if (format && matched > 1) {
+      if (format && matched >= 1) {
         const preMatched = previousValue.split(' ').length;
         selectStart += matched - preMatched;

[Survived] StringLiteral
core/shared/formatter/Formatter.ts:40:48
       }
       const matched = matches.length;
       if (format && matched > 1) {
-        const preMatched = previousValue.split(' ').length;
+        const preMatched = previousValue.split("").length;
         selectStart += matched - preMatched;
         selectEnd += matched - preMatched;

[Survived] ArithmeticOperator
core/shared/formatter/Formatter.ts:41:24
       const matched = matches.length;
       if (format && matched > 1) {
         const preMatched = previousValue.split(' ').length;
-        selectStart += matched - preMatched;
+        selectStart += matched + preMatched;
         selectEnd += matched - preMatched;
         value = matches.join(' ');

[Survived] ArithmeticOperator
core/shared/formatter/Formatter.ts:42:22
       if (format && matched > 1) {
         const preMatched = previousValue.split(' ').length;
         selectStart += matched - preMatched;
-        selectEnd += matched - preMatched;
+        selectEnd += matched + preMatched;
         value = matches.join(' ');
       }

[Survived] EqualityOperator
core/shared/formatter/Formatter.ts:47:9
       }
     }
 
-    if (value !== previousValue) {
+    if (value === previousValue) {
       Utils.setElementAttributes({ value }, element);
       element.setSelectionRange(selectStart, selectEnd);

[Survived] BlockStatement
core/shared/formatter/Formatter.ts:47:34
       }
     }
 
-    if (value !== previousValue) {
-      Utils.setElementAttributes({ value }, element);
-      element.setSelectionRange(selectStart, selectEnd);
-    }
+    if (value !== previousValue) {}
     this._cardNumberFormatted = value ? value : '';
     if (value) {

[Survived] BlockStatement
core/shared/formatter/Formatter.ts:52:16
       element.setSelectionRange(selectStart, selectEnd);
     }
     this._cardNumberFormatted = value ? value : '';
-    if (value) {
-      this._validation.cardNumberValue = value.replace(/\s/g, '');
-    }
+    if (value) {}
     return { formatted: this._cardNumberFormatted, nonformatted: this._validation.cardNumberValue };
   }

[Survived] ConditionalExpression
core/shared/formatter/Formatter.ts:52:9
       element.setSelectionRange(selectStart, selectEnd);
     }
     this._cardNumberFormatted = value ? value : '';
-    if (value) {
+    if (true) {
       this._validation.cardNumberValue = value.replace(/\s/g, '');
     }

[Survived] BlockStatement
core/shared/formatter/Formatter.ts:58:43
     return { formatted: this._cardNumberFormatted, nonformatted: this._validation.cardNumberValue };
   }
 
-  public date(value: string, id?: string) {
-    this._validation.expirationDate(value);
-    const element: HTMLInputElement = document.getElementById(id) as HTMLInputElement;
-    let result: string = '';
-
-    this._blocks.forEach(length => {
-      if (this._validation.expirationDateValue && this._validation.expirationDateValue.length > 0) {
-        const sub = this._validation.expirationDateValue.slice(0, length);
-        const rest = this._validation.expirationDateValue.slice(length);
-        result += sub;
-        this._validation.expirationDateValue = rest;
-      }
-    });
-    let fixedDate = this._dateFixed(result);
-    element.value = fixedDate;
-    fixedDate = fixedDate ? fixedDate : '';
-    return fixedDate;
-  }
+  public date(value: string, id?: string) {}
 
   public code(value: string, length: number, id?: string) {

[Survived] StringLiteral
core/shared/formatter/Formatter.ts:61:26
   public date(value: string, id?: string) {
     this._validation.expirationDate(value);
     const element: HTMLInputElement = document.getElementById(id) as HTMLInputElement;
-    let result: string = '';
+    let result: string = "Stryker was here!";
 
     this._blocks.forEach(length => {

[Survived] BlockStatement
core/shared/formatter/Formatter.ts:63:36
     const element: HTMLInputElement = document.getElementById(id) as HTMLInputElement;
     let result: string = '';
 
-    this._blocks.forEach(length => {
-      if (this._validation.expirationDateValue && this._validation.expirationDateValue.length > 0) {
-        const sub = this._validation.expirationDateValue.slice(0, length);
-        const rest = this._validation.expirationDateValue.slice(length);
-        result += sub;
-        this._validation.expirationDateValue = rest;
-      }
-    });
+    this._blocks.forEach(length => {});
     let fixedDate = this._dateFixed(result);
     element.value = fixedDate;

[Survived] ConditionalExpression
core/shared/formatter/Formatter.ts:64:51
     let result: string = '';
 
     this._blocks.forEach(length => {
-      if (this._validation.expirationDateValue && this._validation.expirationDateValue.length > 0) {
+      if (this._validation.expirationDateValue && false) {
         const sub = this._validation.expirationDateValue.slice(0, length);
         const rest = this._validation.expirationDateValue.slice(length);

[Survived] ConditionalExpression
core/shared/formatter/Formatter.ts:64:11
     let result: string = '';
 
     this._blocks.forEach(length => {
-      if (this._validation.expirationDateValue && this._validation.expirationDateValue.length > 0) {
+      if (true) {
         const sub = this._validation.expirationDateValue.slice(0, length);
         const rest = this._validation.expirationDateValue.slice(length);

[Survived] BlockStatement
core/shared/formatter/Formatter.ts:77:59
     return fixedDate;
   }
 
-  public code(value: string, length: number, id?: string) {
-    this._validation.securityCode(value, length);
-    const element: HTMLInputElement = document.getElementById(id) as HTMLInputElement;
-    element.value = this._validation.securityCodeValue ? this._validation.securityCodeValue : '';
-    return this._validation.securityCodeValue;
-  }
+  public code(value: string, length: number, id?: string) {}
 
   private _dateISO(previousDate: string[], currentDate: string[]) {

[Survived] BlockStatement
core/shared/formatter/Formatter.ts:84:67
     return this._validation.securityCodeValue;
   }
 
-  private _dateISO(previousDate: string[], currentDate: string[]) {
-    this._dateBlocks.currentDateMonth = currentDate[0];
-    this._dateBlocks.currentDateYear = currentDate[1];
-    this._dateBlocks.previousDateYear = previousDate[1];
-
-    if (!this._dateBlocks.currentDateMonth.length) {
-      return '';
-    } else if (this._dateBlocks.currentDateMonth.length && this._dateBlocks.currentDateYear.length === 0) {
-      return this._dateBlocks.currentDateMonth;
-    } else if (
-      this._dateBlocks.currentDateMonth.length === 2 &&
-      this._dateBlocks.currentDateYear.length === 1 &&
-      this._dateBlocks.previousDateYear.length === 0
-    ) {
-      return this._dateBlocks.currentDateMonth + '/' + this._dateBlocks.currentDateYear;
-    } else if (
-      (this._dateBlocks.currentDateMonth.length === 2 &&
-        this._dateBlocks.currentDateYear.length === 1 &&
-        (this._dateBlocks.previousDateYear.length === 1 || this._dateBlocks.previousDateYear.length === 2)) ||
-      (this._dateBlocks.currentDateMonth.length === 2 && this._dateBlocks.currentDateYear.length === 2)
-    ) {
-      return this._dateBlocks.currentDateMonth + '/' + this._dateBlocks.currentDateYear;
-    }
-  }
+  private _dateISO(previousDate: string[], currentDate: string[]) {}
 
   private _dateFixed(value: string) {

[Survived] ConditionalExpression
core/shared/formatter/Formatter.ts:89:9
     this._dateBlocks.currentDateYear = currentDate[1];
     this._dateBlocks.previousDateYear = previousDate[1];
 
-    if (!this._dateBlocks.currentDateMonth.length) {
+    if (false) {
       return '';
     } else if (this._dateBlocks.currentDateMonth.length && this._dateBlocks.currentDateYear.length === 0) {

[Survived] BlockStatement
core/shared/formatter/Formatter.ts:89:52
     this._dateBlocks.currentDateYear = currentDate[1];
     this._dateBlocks.previousDateYear = previousDate[1];
 
-    if (!this._dateBlocks.currentDateMonth.length) {
-      return '';
-    } else if (this._dateBlocks.currentDateMonth.length && this._dateBlocks.currentDateYear.length === 0) {
+    if (!this._dateBlocks.currentDateMonth.length) {} else if (this._dateBlocks.currentDateMonth.length && this._dateBlocks.currentDateYear.length === 0) {
       return this._dateBlocks.currentDateMonth;
     } else if (

[Survived] ConditionalExpression
core/shared/formatter/Formatter.ts:91:60
 
     if (!this._dateBlocks.currentDateMonth.length) {
       return '';
-    } else if (this._dateBlocks.currentDateMonth.length && this._dateBlocks.currentDateYear.length === 0) {
+    } else if (this._dateBlocks.currentDateMonth.length && false) {
       return this._dateBlocks.currentDateMonth;
     } else if (

[Survived] ConditionalExpression
core/shared/formatter/Formatter.ts:91:16
 
     if (!this._dateBlocks.currentDateMonth.length) {
       return '';
-    } else if (this._dateBlocks.currentDateMonth.length && this._dateBlocks.currentDateYear.length === 0) {
+    } else if (false) {
       return this._dateBlocks.currentDateMonth;
     } else if (

[Survived] EqualityOperator
core/shared/formatter/Formatter.ts:94:7
     } else if (this._dateBlocks.currentDateMonth.length && this._dateBlocks.currentDateYear.length === 0) {
       return this._dateBlocks.currentDateMonth;
     } else if (
-      this._dateBlocks.currentDateMonth.length === 2 &&
+      this._dateBlocks.currentDateMonth.length !== 2 &&
       this._dateBlocks.currentDateYear.length === 1 &&
       this._dateBlocks.previousDateYear.length === 0

[Survived] ConditionalExpression
core/shared/formatter/Formatter.ts:94:7
     } else if (this._dateBlocks.currentDateMonth.length && this._dateBlocks.currentDateYear.length === 0) {
       return this._dateBlocks.currentDateMonth;
     } else if (
-      this._dateBlocks.currentDateMonth.length === 2 &&
-      this._dateBlocks.currentDateYear.length === 1 &&
-      this._dateBlocks.previousDateYear.length === 0
+      true
     ) {
       return this._dateBlocks.currentDateMonth + '/' + this._dateBlocks.currentDateYear;

[Survived] ConditionalExpression
core/shared/formatter/Formatter.ts:95:7
       return this._dateBlocks.currentDateMonth;
     } else if (
       this._dateBlocks.currentDateMonth.length === 2 &&
-      this._dateBlocks.currentDateYear.length === 1 &&
+      true &&
       this._dateBlocks.previousDateYear.length === 0
     ) {

[Survived] ConditionalExpression
core/shared/formatter/Formatter.ts:95:7
       return this._dateBlocks.currentDateMonth;
     } else if (
       this._dateBlocks.currentDateMonth.length === 2 &&
-      this._dateBlocks.currentDateYear.length === 1 &&
+      false &&
       this._dateBlocks.previousDateYear.length === 0
     ) {

[Survived] ConditionalExpression
core/shared/formatter/Formatter.ts:96:7
     } else if (
       this._dateBlocks.currentDateMonth.length === 2 &&
       this._dateBlocks.currentDateYear.length === 1 &&
-      this._dateBlocks.previousDateYear.length === 0
+      true
     ) {
       return this._dateBlocks.currentDateMonth + '/' + this._dateBlocks.currentDateYear;

[Survived] EqualityOperator
core/shared/formatter/Formatter.ts:96:7
     } else if (
       this._dateBlocks.currentDateMonth.length === 2 &&
       this._dateBlocks.currentDateYear.length === 1 &&
-      this._dateBlocks.previousDateYear.length === 0
+      this._dateBlocks.previousDateYear.length !== 0
     ) {
       return this._dateBlocks.currentDateMonth + '/' + this._dateBlocks.currentDateYear;

[Survived] BlockStatement
core/shared/formatter/Formatter.ts:97:7
       this._dateBlocks.currentDateMonth.length === 2 &&
       this._dateBlocks.currentDateYear.length === 1 &&
       this._dateBlocks.previousDateYear.length === 0
-    ) {
-      return this._dateBlocks.currentDateMonth + '/' + this._dateBlocks.currentDateYear;
-    } else if (
+    ) {} else if (
       (this._dateBlocks.currentDateMonth.length === 2 &&
         this._dateBlocks.currentDateYear.length === 1 &&

[Survived] ArithmeticOperator
core/shared/formatter/Formatter.ts:98:14
       this._dateBlocks.currentDateYear.length === 1 &&
       this._dateBlocks.previousDateYear.length === 0
     ) {
-      return this._dateBlocks.currentDateMonth + '/' + this._dateBlocks.currentDateYear;
+      return this._dateBlocks.currentDateMonth - '/' + this._dateBlocks.currentDateYear;
     } else if (
       (this._dateBlocks.currentDateMonth.length === 2 &&

[Survived] ArithmeticOperator
core/shared/formatter/Formatter.ts:98:14
       this._dateBlocks.currentDateYear.length === 1 &&
       this._dateBlocks.previousDateYear.length === 0
     ) {
-      return this._dateBlocks.currentDateMonth + '/' + this._dateBlocks.currentDateYear;
+      return this._dateBlocks.currentDateMonth + '/' - this._dateBlocks.currentDateYear;
     } else if (
       (this._dateBlocks.currentDateMonth.length === 2 &&

[Survived] ConditionalExpression
core/shared/formatter/Formatter.ts:100:8
     ) {
       return this._dateBlocks.currentDateMonth + '/' + this._dateBlocks.currentDateYear;
     } else if (
-      (this._dateBlocks.currentDateMonth.length === 2 &&
-        this._dateBlocks.currentDateYear.length === 1 &&
-        (this._dateBlocks.previousDateYear.length === 1 || this._dateBlocks.previousDateYear.length === 2)) ||
+      (true) ||
       (this._dateBlocks.currentDateMonth.length === 2 && this._dateBlocks.currentDateYear.length === 2)
     ) {

[Survived] ConditionalExpression
core/shared/formatter/Formatter.ts:100:8
     ) {
       return this._dateBlocks.currentDateMonth + '/' + this._dateBlocks.currentDateYear;
     } else if (
-      (this._dateBlocks.currentDateMonth.length === 2 &&
-        this._dateBlocks.currentDateYear.length === 1 &&
+      (true &&
         (this._dateBlocks.previousDateYear.length === 1 || this._dateBlocks.previousDateYear.length === 2)) ||
       (this._dateBlocks.currentDateMonth.length === 2 && this._dateBlocks.currentDateYear.length === 2)

[Survived] EqualityOperator
core/shared/formatter/Formatter.ts:101:9
       return this._dateBlocks.currentDateMonth + '/' + this._dateBlocks.currentDateYear;
     } else if (
       (this._dateBlocks.currentDateMonth.length === 2 &&
-        this._dateBlocks.currentDateYear.length === 1 &&
+        this._dateBlocks.currentDateYear.length !== 1 &&
         (this._dateBlocks.previousDateYear.length === 1 || this._dateBlocks.previousDateYear.length === 2)) ||
       (this._dateBlocks.currentDateMonth.length === 2 && this._dateBlocks.currentDateYear.length === 2)

[Survived] ConditionalExpression
core/shared/formatter/Formatter.ts:101:9
       return this._dateBlocks.currentDateMonth + '/' + this._dateBlocks.currentDateYear;
     } else if (
       (this._dateBlocks.currentDateMonth.length === 2 &&
-        this._dateBlocks.currentDateYear.length === 1 &&
+        true &&
         (this._dateBlocks.previousDateYear.length === 1 || this._dateBlocks.previousDateYear.length === 2)) ||
       (this._dateBlocks.currentDateMonth.length === 2 && this._dateBlocks.currentDateYear.length === 2)

[Survived] ConditionalExpression
core/shared/formatter/Formatter.ts:102:10
     } else if (
       (this._dateBlocks.currentDateMonth.length === 2 &&
         this._dateBlocks.currentDateYear.length === 1 &&
-        (this._dateBlocks.previousDateYear.length === 1 || this._dateBlocks.previousDateYear.length === 2)) ||
+        (false)) ||
       (this._dateBlocks.currentDateMonth.length === 2 && this._dateBlocks.currentDateYear.length === 2)
     ) {

[Survived] ConditionalExpression
core/shared/formatter/Formatter.ts:102:10
     } else if (
       (this._dateBlocks.currentDateMonth.length === 2 &&
         this._dateBlocks.currentDateYear.length === 1 &&
-        (this._dateBlocks.previousDateYear.length === 1 || this._dateBlocks.previousDateYear.length === 2)) ||
+        (false || this._dateBlocks.previousDateYear.length === 2)) ||
       (this._dateBlocks.currentDateMonth.length === 2 && this._dateBlocks.currentDateYear.length === 2)
     ) {

[Survived] ConditionalExpression
core/shared/formatter/Formatter.ts:103:58
       (this._dateBlocks.currentDateMonth.length === 2 &&
         this._dateBlocks.currentDateYear.length === 1 &&
         (this._dateBlocks.previousDateYear.length === 1 || this._dateBlocks.previousDateYear.length === 2)) ||
-      (this._dateBlocks.currentDateMonth.length === 2 && this._dateBlocks.currentDateYear.length === 2)
+      (this._dateBlocks.currentDateMonth.length === 2 && false)
     ) {
       return this._dateBlocks.currentDateMonth + '/' + this._dateBlocks.currentDateYear;

[Survived] LogicalOperator
core/shared/formatter/Formatter.ts:103:8
       (this._dateBlocks.currentDateMonth.length === 2 &&
         this._dateBlocks.currentDateYear.length === 1 &&
         (this._dateBlocks.previousDateYear.length === 1 || this._dateBlocks.previousDateYear.length === 2)) ||
-      (this._dateBlocks.currentDateMonth.length === 2 && this._dateBlocks.currentDateYear.length === 2)
+      (this._dateBlocks.currentDateMonth.length === 2 || this._dateBlocks.currentDateYear.length === 2)
     ) {
       return this._dateBlocks.currentDateMonth + '/' + this._dateBlocks.currentDateYear;

[Survived] BlockStatement
core/shared/formatter/Formatter.ts:104:7
         this._dateBlocks.currentDateYear.length === 1 &&
         (this._dateBlocks.previousDateYear.length === 1 || this._dateBlocks.previousDateYear.length === 2)) ||
       (this._dateBlocks.currentDateMonth.length === 2 && this._dateBlocks.currentDateYear.length === 2)
-    ) {
-      return this._dateBlocks.currentDateMonth + '/' + this._dateBlocks.currentDateYear;
-    }
+    ) {}
   }
 

[Survived] BlockStatement
core/shared/formatter/Formatter.ts:109:37
     }
   }
 
-  private _dateFixed(value: string) {
-    let date: string[];
-    const month: string = value.slice(0, 2);
-    const year: string = value.slice(2, 4);
-    date = [month, year];
-    return this._dateISO(this._date, date);
-  }
+  private _dateFixed(value: string) {}
 }
 

[Survived] ArrayDeclaration
core/shared/formatter/Formatter.ts:113:12
     let date: string[];
     const month: string = value.slice(0, 2);
     const year: string = value.slice(2, 4);
-    date = [month, year];
+    date = [];
     return this._dateISO(this._date, date);
   }
