[Survived] BlockStatement
core/shared/frame/Frame.ts:8:39
 
 @Service()
 export class Frame {
-  public getAllowedParams(): string[] {
-    return ['locale', 'origin'];
-  }
+  public getAllowedParams(): string[] {}
 
   public getAllowedStyles(): IAllowedStyles {

[Survived] ArrayDeclaration
core/shared/frame/Frame.ts:9:12
 @Service()
 export class Frame {
   public getAllowedParams(): string[] {
-    return ['locale', 'origin'];
+    return [];
   }
 

[Survived] BlockStatement
core/shared/frame/Frame.ts:12:45
     return ['locale', 'origin'];
   }
 
-  public getAllowedStyles(): IAllowedStyles {
-    return frameAllowedStyles;
-  }
+  public getAllowedStyles(): IAllowedStyles {}
 
   public parseUrl(additionalParams?: string[]): IParams {

[Survived] BlockStatement
core/shared/frame/Frame.ts:16:57
     return frameAllowedStyles;
   }
 
-  public parseUrl(additionalParams?: string[]): IParams {
-    const parsedUrl = new URL(window.location.href);
-    const allowedParams = this.getAllowedParams().concat(additionalParams);
-    const params: IParams = { styles: [] };
-
-    parsedUrl.searchParams.forEach((value: string, param: string) => {
-      if (allowedParams.includes(param)) {
-        params[param] = value;
-      } else {
-        params.styles.push({ [param]: value });
-      }
-    });
-
-    return params;
-  }
+  public parseUrl(additionalParams?: string[]): IParams {}
 }
 

[Survived] ArrayDeclaration
core/shared/frame/Frame.ts:19:39
   public parseUrl(additionalParams?: string[]): IParams {
     const parsedUrl = new URL(window.location.href);
     const allowedParams = this.getAllowedParams().concat(additionalParams);
-    const params: IParams = { styles: [] };
+    const params: IParams = { styles: ["Stryker was here"] };
 
     parsedUrl.searchParams.forEach((value: string, param: string) => {

[Survived] ObjectLiteral
core/shared/frame/Frame.ts:19:29
   public parseUrl(additionalParams?: string[]): IParams {
     const parsedUrl = new URL(window.location.href);
     const allowedParams = this.getAllowedParams().concat(additionalParams);
-    const params: IParams = { styles: [] };
+    const params: IParams = {};
 
     parsedUrl.searchParams.forEach((value: string, param: string) => {

[Survived] BlockStatement
core/shared/frame/Frame.ts:21:70
     const allowedParams = this.getAllowedParams().concat(additionalParams);
     const params: IParams = { styles: [] };
 
-    parsedUrl.searchParams.forEach((value: string, param: string) => {
-      if (allowedParams.includes(param)) {
-        params[param] = value;
-      } else {
-        params.styles.push({ [param]: value });
-      }
-    });
+    parsedUrl.searchParams.forEach((value: string, param: string) => {});
 
     return params;

[Survived] ConditionalExpression
core/shared/frame/Frame.ts:22:11
     const params: IParams = { styles: [] };
 
     parsedUrl.searchParams.forEach((value: string, param: string) => {
-      if (allowedParams.includes(param)) {
+      if (true) {
         params[param] = value;
       } else {

[Survived] BlockStatement
core/shared/frame/Frame.ts:22:42
     const params: IParams = { styles: [] };
 
     parsedUrl.searchParams.forEach((value: string, param: string) => {
-      if (allowedParams.includes(param)) {
-        params[param] = value;
-      } else {
+      if (allowedParams.includes(param)) {} else {
         params.styles.push({ [param]: value });
       }

[Survived] BlockStatement
core/shared/frame/Frame.ts:24:14
     parsedUrl.searchParams.forEach((value: string, param: string) => {
       if (allowedParams.includes(param)) {
         params[param] = value;
-      } else {
-        params.styles.push({ [param]: value });
-      }
+      } else {}
     });
 
