[Survived] ObjectLiteral
core/shared/frame/frame-const.ts:3:51
 import { IAllowedStyles } from '../../models/IAllowedStyles';
 
-export const frameAllowedStyles: IAllowedStyles = {
-  'background-color-body': { property: 'background-color', selector: 'body' },
-  'color-body': { property: 'color', selector: 'body' },
-  'font-size-body': { property: 'font-size', selector: 'body' },
-  'line-height-body': { property: 'line-height', selector: 'body' },
-  'space-inset-body': { property: 'padding', selector: 'body' },
-  'space-outset-body': { property: 'margin', selector: 'body' }
-};
+export const frameAllowedStyles: IAllowedStyles = {};
 

[Survived] StringLiteral
core/shared/frame/frame-const.ts:4:40
 import { IAllowedStyles } from '../../models/IAllowedStyles';
 
 export const frameAllowedStyles: IAllowedStyles = {
-  'background-color-body': { property: 'background-color', selector: 'body' },
+  'background-color-body': { property: "", selector: 'body' },
   'color-body': { property: 'color', selector: 'body' },
   'font-size-body': { property: 'font-size', selector: 'body' },

[Survived] ObjectLiteral
core/shared/frame/frame-const.ts:4:28
 import { IAllowedStyles } from '../../models/IAllowedStyles';
 
 export const frameAllowedStyles: IAllowedStyles = {
-  'background-color-body': { property: 'background-color', selector: 'body' },
+  'background-color-body': {},
   'color-body': { property: 'color', selector: 'body' },
   'font-size-body': { property: 'font-size', selector: 'body' },

[Survived] StringLiteral
core/shared/frame/frame-const.ts:5:48
 
 export const frameAllowedStyles: IAllowedStyles = {
   'background-color-body': { property: 'background-color', selector: 'body' },
-  'color-body': { property: 'color', selector: 'body' },
+  'color-body': { property: 'color', selector: "" },
   'font-size-body': { property: 'font-size', selector: 'body' },
   'line-height-body': { property: 'line-height', selector: 'body' },

[Survived] ObjectLiteral
core/shared/frame/frame-const.ts:6:21
 export const frameAllowedStyles: IAllowedStyles = {
   'background-color-body': { property: 'background-color', selector: 'body' },
   'color-body': { property: 'color', selector: 'body' },
-  'font-size-body': { property: 'font-size', selector: 'body' },
+  'font-size-body': {},
   'line-height-body': { property: 'line-height', selector: 'body' },
   'space-inset-body': { property: 'padding', selector: 'body' },

[Survived] StringLiteral
core/shared/frame/frame-const.ts:6:33
 export const frameAllowedStyles: IAllowedStyles = {
   'background-color-body': { property: 'background-color', selector: 'body' },
   'color-body': { property: 'color', selector: 'body' },
-  'font-size-body': { property: 'font-size', selector: 'body' },
+  'font-size-body': { property: "", selector: 'body' },
   'line-height-body': { property: 'line-height', selector: 'body' },
   'space-inset-body': { property: 'padding', selector: 'body' },

[Survived] StringLiteral
core/shared/frame/frame-const.ts:7:60
   'background-color-body': { property: 'background-color', selector: 'body' },
   'color-body': { property: 'color', selector: 'body' },
   'font-size-body': { property: 'font-size', selector: 'body' },
-  'line-height-body': { property: 'line-height', selector: 'body' },
+  'line-height-body': { property: 'line-height', selector: "" },
   'space-inset-body': { property: 'padding', selector: 'body' },
   'space-outset-body': { property: 'margin', selector: 'body' }

[Survived] StringLiteral
core/shared/frame/frame-const.ts:8:56
   'color-body': { property: 'color', selector: 'body' },
   'font-size-body': { property: 'font-size', selector: 'body' },
   'line-height-body': { property: 'line-height', selector: 'body' },
-  'space-inset-body': { property: 'padding', selector: 'body' },
+  'space-inset-body': { property: 'padding', selector: "" },
   'space-outset-body': { property: 'margin', selector: 'body' }
 };

[Survived] StringLiteral
core/shared/frame/frame-const.ts:9:36
   'font-size-body': { property: 'font-size', selector: 'body' },
   'line-height-body': { property: 'line-height', selector: 'body' },
   'space-inset-body': { property: 'padding', selector: 'body' },
-  'space-outset-body': { property: 'margin', selector: 'body' }
+  'space-outset-body': { property: "", selector: 'body' }
 };
 
