[Survived] StringLiteral
core/shared/input/AllowedStylesService.ts:18:45
       'background-color-input': { property: 'background-color', selector: input },
       'background-color-input-error': { property: 'background-color', selector: inputError },
       'background-color-message': { property: 'background-color', selector: message },
-      'background-color-label': { property: 'background-color', selector: label },
+      'background-color-label': { property: "", selector: label },
       'border-color-input': { property: 'border-color', selector: input },
       'border-color-input-error': { property: 'border-color', selector: inputError },

[Survived] ObjectLiteral
core/shared/input/AllowedStylesService.ts:22:36
       'border-color-input': { property: 'border-color', selector: input },
       'border-color-input-error': { property: 'border-color', selector: inputError },
       'border-radius-input': { property: 'border-radius', selector: input },
-      'border-radius-input-error': { property: 'border-radius', selector: inputError },
+      'border-radius-input-error': {},
       'border-size-input': { property: 'border-width', selector: input },
       'border-size-input-error': { property: 'border-width', selector: inputError },

[Survived] ObjectLiteral
core/shared/input/AllowedStylesService.ts:25:27
       'border-radius-input-error': { property: 'border-radius', selector: inputError },
       'border-size-input': { property: 'border-width', selector: input },
       'border-size-input-error': { property: 'border-width', selector: inputError },
-      'box-shadow-input': { property: 'box-shadow', selector: input },
+      'box-shadow-input': {},
       'color-error': { property: 'color', selector: message },
       'color-input': { property: 'color', selector: input },

[Survived] StringLiteral
core/shared/input/AllowedStylesService.ts:27:34
       'border-size-input-error': { property: 'border-width', selector: inputError },
       'box-shadow-input': { property: 'box-shadow', selector: input },
       'color-error': { property: 'color', selector: message },
-      'color-input': { property: 'color', selector: input },
+      'color-input': { property: "", selector: input },
       'color-input-error': { property: 'color', selector: inputError },
       'color-input-placeholder': { property: 'color', selector: inputPlaceholder },

[Survived] ObjectLiteral
core/shared/input/AllowedStylesService.ts:27:22
       'border-size-input-error': { property: 'border-width', selector: inputError },
       'box-shadow-input': { property: 'box-shadow', selector: input },
       'color-error': { property: 'color', selector: message },
-      'color-input': { property: 'color', selector: input },
+      'color-input': {},
       'color-input-error': { property: 'color', selector: inputError },
       'color-input-placeholder': { property: 'color', selector: inputPlaceholder },

[Survived] ObjectLiteral
core/shared/input/AllowedStylesService.ts:28:28
       'box-shadow-input': { property: 'box-shadow', selector: input },
       'color-error': { property: 'color', selector: message },
       'color-input': { property: 'color', selector: input },
-      'color-input-error': { property: 'color', selector: inputError },
+      'color-input-error': {},
       'color-input-placeholder': { property: 'color', selector: inputPlaceholder },
       'color-label': { property: 'color', selector: label },

[Survived] ObjectLiteral
core/shared/input/AllowedStylesService.ts:30:22
       'color-input': { property: 'color', selector: input },
       'color-input-error': { property: 'color', selector: inputError },
       'color-input-placeholder': { property: 'color', selector: inputPlaceholder },
-      'color-label': { property: 'color', selector: label },
+      'color-label': {},
       'display-label': { property: 'display', selector: label },
       'font-size-input': { property: 'font-size', selector: input },

[Survived] ObjectLiteral
core/shared/input/AllowedStylesService.ts:31:24
       'color-input-error': { property: 'color', selector: inputError },
       'color-input-placeholder': { property: 'color', selector: inputPlaceholder },
       'color-label': { property: 'color', selector: label },
-      'display-label': { property: 'display', selector: label },
+      'display-label': {},
       'font-size-input': { property: 'font-size', selector: input },
       'font-size-input-error': { property: 'font-size', selector: inputError },

[Survived] StringLiteral
core/shared/input/AllowedStylesService.ts:35:40
       'font-size-input': { property: 'font-size', selector: input },
       'font-size-input-error': { property: 'font-size', selector: inputError },
       'font-size-label': { property: 'font-size', selector: label },
-      'font-size-message': { property: 'font-size', selector: message },
+      'font-size-message': { property: "", selector: message },
       'font-family-input': { property: 'font-family', selector: input },
       'font-family-input-error': { property: 'font-family', selector: inputError },

[Survived] ObjectLiteral
core/shared/input/AllowedStylesService.ts:36:28
       'font-size-input-error': { property: 'font-size', selector: inputError },
       'font-size-label': { property: 'font-size', selector: label },
       'font-size-message': { property: 'font-size', selector: message },
-      'font-family-input': { property: 'font-family', selector: input },
+      'font-family-input': {},
       'font-family-input-error': { property: 'font-family', selector: inputError },
       'font-family-label': { property: 'font-family', selector: label },

[Survived] StringLiteral
core/shared/input/AllowedStylesService.ts:42:40
       'font-family-message': { property: 'font-family', selector: message },
       'line-height-input': { property: 'line-height', selector: input },
       'line-height-input-error': { property: 'line-height', selector: inputError },
-      'line-height-label': { property: 'line-height', selector: label },
+      'line-height-label': { property: "", selector: label },
       'line-height-message': { property: 'line-height', selector: message },
       'max-width-label': { property: 'max-width', selector: label },

[Survived] ObjectLiteral
core/shared/input/AllowedStylesService.ts:44:26
       'line-height-input-error': { property: 'line-height', selector: inputError },
       'line-height-label': { property: 'line-height', selector: label },
       'line-height-message': { property: 'line-height', selector: message },
-      'max-width-label': { property: 'max-width', selector: label },
+      'max-width-label': {},
       'outline-input': { property: 'outline', selector: input },
       'space-inset-input': { property: 'padding', selector: input },

[Survived] ObjectLiteral
core/shared/input/AllowedStylesService.ts:45:24
       'line-height-label': { property: 'line-height', selector: label },
       'line-height-message': { property: 'line-height', selector: message },
       'max-width-label': { property: 'max-width', selector: label },
-      'outline-input': { property: 'outline', selector: input },
+      'outline-input': {},
       'space-inset-input': { property: 'padding', selector: input },
       'space-inset-input-error': { property: 'padding', selector: inputError },

[Survived] ObjectLiteral
core/shared/input/AllowedStylesService.ts:46:28
       'line-height-message': { property: 'line-height', selector: message },
       'max-width-label': { property: 'max-width', selector: label },
       'outline-input': { property: 'outline', selector: input },
-      'space-inset-input': { property: 'padding', selector: input },
+      'space-inset-input': {},
       'space-inset-input-error': { property: 'padding', selector: inputError },
       'space-inset-message': { property: 'padding', selector: message },

[Survived] ObjectLiteral
core/shared/input/AllowedStylesService.ts:47:34
       'max-width-label': { property: 'max-width', selector: label },
       'outline-input': { property: 'outline', selector: input },
       'space-inset-input': { property: 'padding', selector: input },
-      'space-inset-input-error': { property: 'padding', selector: inputError },
+      'space-inset-input-error': {},
       'space-inset-message': { property: 'padding', selector: message },
       'space-outset-input': { property: 'margin', selector: input },

[Survived] ObjectLiteral
core/shared/input/AllowedStylesService.ts:48:30
       'outline-input': { property: 'outline', selector: input },
       'space-inset-input': { property: 'padding', selector: input },
       'space-inset-input-error': { property: 'padding', selector: inputError },
-      'space-inset-message': { property: 'padding', selector: message },
+      'space-inset-message': {},
       'space-outset-input': { property: 'margin', selector: input },
       'space-outset-input-error': { property: 'margin', selector: inputError },

[Survived] StringLiteral
core/shared/input/AllowedStylesService.ts:48:42
       'outline-input': { property: 'outline', selector: input },
       'space-inset-input': { property: 'padding', selector: input },
       'space-inset-input-error': { property: 'padding', selector: inputError },
-      'space-inset-message': { property: 'padding', selector: message },
+      'space-inset-message': { property: "", selector: message },
       'space-outset-input': { property: 'margin', selector: input },
       'space-outset-input-error': { property: 'margin', selector: inputError },

[Survived] StringLiteral
core/shared/input/AllowedStylesService.ts:50:47
       'space-inset-input-error': { property: 'padding', selector: inputError },
       'space-inset-message': { property: 'padding', selector: message },
       'space-outset-input': { property: 'margin', selector: input },
-      'space-outset-input-error': { property: 'margin', selector: inputError },
+      'space-outset-input-error': { property: "", selector: inputError },
       'space-outset-message': { property: 'margin', selector: message },
       'position-top-icon': { property: 'top', selector: icon },

[Survived] ObjectLiteral
core/shared/input/AllowedStylesService.ts:51:31
       'space-inset-message': { property: 'padding', selector: message },
       'space-outset-input': { property: 'margin', selector: input },
       'space-outset-input-error': { property: 'margin', selector: inputError },
-      'space-outset-message': { property: 'margin', selector: message },
+      'space-outset-message': {},
       'position-top-icon': { property: 'top', selector: icon },
       'position-bottom-icon': { property: 'bottom', selector: icon },

[Survived] StringLiteral
core/shared/input/AllowedStylesService.ts:51:43
       'space-inset-message': { property: 'padding', selector: message },
       'space-outset-input': { property: 'margin', selector: input },
       'space-outset-input-error': { property: 'margin', selector: inputError },
-      'space-outset-message': { property: 'margin', selector: message },
+      'space-outset-message': { property: "", selector: message },
       'position-top-icon': { property: 'top', selector: icon },
       'position-bottom-icon': { property: 'bottom', selector: icon },

[Survived] ObjectLiteral
core/shared/input/AllowedStylesService.ts:53:31
       'space-outset-input-error': { property: 'margin', selector: inputError },
       'space-outset-message': { property: 'margin', selector: message },
       'position-top-icon': { property: 'top', selector: icon },
-      'position-bottom-icon': { property: 'bottom', selector: icon },
+      'position-bottom-icon': {},
       'position-right-icon': { property: 'right', selector: icon },
       'position-left-icon': { property: 'left', selector: icon },

[Survived] StringLiteral
core/shared/input/AllowedStylesService.ts:53:43
       'space-outset-input-error': { property: 'margin', selector: inputError },
       'space-outset-message': { property: 'margin', selector: message },
       'position-top-icon': { property: 'top', selector: icon },
-      'position-bottom-icon': { property: 'bottom', selector: icon },
+      'position-bottom-icon': { property: "", selector: icon },
       'position-right-icon': { property: 'right', selector: icon },
       'position-left-icon': { property: 'left', selector: icon },

[Survived] StringLiteral
core/shared/input/AllowedStylesService.ts:54:42
       'space-outset-message': { property: 'margin', selector: message },
       'position-top-icon': { property: 'top', selector: icon },
       'position-bottom-icon': { property: 'bottom', selector: icon },
-      'position-right-icon': { property: 'right', selector: icon },
+      'position-right-icon': { property: "", selector: icon },
       'position-left-icon': { property: 'left', selector: icon },
       'position-top-label': { property: 'top', selector: label },

[Survived] StringLiteral
core/shared/input/AllowedStylesService.ts:55:41
       'position-top-icon': { property: 'top', selector: icon },
       'position-bottom-icon': { property: 'bottom', selector: icon },
       'position-right-icon': { property: 'right', selector: icon },
-      'position-left-icon': { property: 'left', selector: icon },
+      'position-left-icon': { property: "", selector: icon },
       'position-top-label': { property: 'top', selector: label },
       'position-bottom-label': { property: 'bottom', selector: label },

[Survived] ObjectLiteral
core/shared/input/AllowedStylesService.ts:55:29
       'position-top-icon': { property: 'top', selector: icon },
       'position-bottom-icon': { property: 'bottom', selector: icon },
       'position-right-icon': { property: 'right', selector: icon },
-      'position-left-icon': { property: 'left', selector: icon },
+      'position-left-icon': {},
       'position-top-label': { property: 'top', selector: label },
       'position-bottom-label': { property: 'bottom', selector: label },

[Survived] StringLiteral
core/shared/input/AllowedStylesService.ts:57:44
       'position-right-icon': { property: 'right', selector: icon },
       'position-left-icon': { property: 'left', selector: icon },
       'position-top-label': { property: 'top', selector: label },
-      'position-bottom-label': { property: 'bottom', selector: label },
+      'position-bottom-label': { property: "", selector: label },
       'position-right-label': { property: 'right', selector: label },
       'position-left-label': { property: 'left', selector: label },

[Survived] ObjectLiteral
core/shared/input/AllowedStylesService.ts:59:30
       'position-top-label': { property: 'top', selector: label },
       'position-bottom-label': { property: 'bottom', selector: label },
       'position-right-label': { property: 'right', selector: label },
-      'position-left-label': { property: 'left', selector: label },
+      'position-left-label': {},
       'width-label': { property: 'width', selector: label },
       'space-inset-wrapper': { property: 'padding', selector: wrapper }
