[Survived] StringLiteral
core/shared/input/Input.ts:15:52
 import { AllowedStylesService } from './AllowedStylesService';
 
 export class Input {
-  protected static PLACEHOLDER_ATTRIBUTE: string = 'placeholder';
+  protected static PLACEHOLDER_ATTRIBUTE: string = "";
   public validation: Validation;
   protected _inputSelector: string;

[Survived] BlockStatement
core/shared/input/Input.ts:31:111
   private _messageBus: MessageBus;
   private _allowedStyles: AllowedStylesService;
 
-  constructor(inputSelector: string, messageSelector: string, labelSelector: string, wrapperSelector: string) {
-    this._messageBus = Container.get(MessageBus);
-    this._allowedStyles = Container.get(AllowedStylesService);
-    this._frame = Container.get(Frame);
-    this._cardNumberInput = document.getElementById(CARD_NUMBER_INPUT) as HTMLInputElement;
-    this._inputElement = document.getElementById(inputSelector) as HTMLInputElement;
-    this._labelElement = document.getElementById(labelSelector) as HTMLLabelElement;
-    this._messageElement = document.getElementById(messageSelector) as HTMLInputElement;
-    this._inputSelector = inputSelector;
-    this._labelSelector = labelSelector;
-    this._messageSelector = messageSelector;
-    this._wrapperSelector = wrapperSelector;
-    this._setInputListeners();
-    this.init();
-  }
+  constructor(inputSelector: string, messageSelector: string, labelSelector: string, wrapperSelector: string) {}
 
   public init(): void {

[Survived] BlockStatement
core/shared/input/Input.ts:47:23
     this.init();
   }
 
-  public init(): void {
-    this._translator = new Translator(this._frame.parseUrl().locale);
-    this.validation = new Validation();
-
-    this._setLabelText();
-    this._addTabListener();
-  }
+  public init(): void {}
 
   protected format(data: string) {

[Survived] BlockStatement
core/shared/input/Input.ts:55:34
     this._addTabListener();
   }
 
-  protected format(data: string) {
-    this._inputElement.value = data;
-  }
+  protected format(data: string) {}
 
   protected getAllowedStyles() {

[Survived] BlockStatement
core/shared/input/Input.ts:59:32
     this._inputElement.value = data;
   }
 
-  protected getAllowedStyles() {
-    let allowed = this._frame.getAllowedStyles();
-    allowed = {
-      ...allowed,
-      ...this._allowedStyles.getStyles(
-        `#${this._inputSelector}`,
-        `#${this._inputSelector}.error-field`,
-        `#${this._inputSelector}::placeholder`,
-        `#${this._messageSelector}`,
-        `label[for=${this._inputSelector}]`,
-        `.${CARD_NUMBER_WRAPPER} #card-icon`,
-        `.${this._wrapperSelector}`
-      )
-    };
-    return allowed;
-  }
+  protected getAllowedStyles() {}
 
   protected getLabel(): string {

[Survived] ObjectLiteral
core/shared/input/Input.ts:61:15
 
   protected getAllowedStyles() {
     let allowed = this._frame.getAllowedStyles();
-    allowed = {
-      ...allowed,
-      ...this._allowedStyles.getStyles(
-        `#${this._inputSelector}`,
-        `#${this._inputSelector}.error-field`,
-        `#${this._inputSelector}::placeholder`,
-        `#${this._messageSelector}`,
-        `label[for=${this._inputSelector}]`,
-        `.${CARD_NUMBER_WRAPPER} #card-icon`,
-        `.${this._wrapperSelector}`
-      )
-    };
+    allowed = {};
     return allowed;
   }

[Survived] StringLiteral
core/shared/input/Input.ts:65:9
       ...allowed,
       ...this._allowedStyles.getStyles(
         `#${this._inputSelector}`,
-        `#${this._inputSelector}.error-field`,
+        ``,
         `#${this._inputSelector}::placeholder`,
         `#${this._messageSelector}`,

[Survived] StringLiteral
core/shared/input/Input.ts:66:9
       ...this._allowedStyles.getStyles(
         `#${this._inputSelector}`,
         `#${this._inputSelector}.error-field`,
-        `#${this._inputSelector}::placeholder`,
+        ``,
         `#${this._messageSelector}`,
         `label[for=${this._inputSelector}]`,

[Survived] StringLiteral
core/shared/input/Input.ts:70:9
         `#${this._messageSelector}`,
         `label[for=${this._inputSelector}]`,
         `.${CARD_NUMBER_WRAPPER} #card-icon`,
-        `.${this._wrapperSelector}`
+        ``
       )
     };

[Survived] BlockStatement
core/shared/input/Input.ts:76:32
     return allowed;
   }
 
-  protected getLabel(): string {
-    throw new Error(NOT_IMPLEMENTED_ERROR);
-  }
+  protected getLabel(): string {}
 
   protected getState(): IFormFieldState {

[Survived] BlockStatement
core/shared/input/Input.ts:80:41
     throw new Error(NOT_IMPLEMENTED_ERROR);
   }
 
-  protected getState(): IFormFieldState {
-    return {
-      validity: this._inputElement.validity.valid,
-      value: this._inputElement.value
-    };
-  }
+  protected getState(): IFormFieldState {}
 
   protected onBlur() {

[Survived] BlockStatement
core/shared/input/Input.ts:87:22
     };
   }
 
-  protected onBlur() {
-    this._blur();
-    this.validation.validate(this._inputElement, this._messageElement);
-  }
+  protected onBlur() {}
 
   protected onClick(event: Event) {

[Survived] BlockStatement
core/shared/input/Input.ts:92:35
     this.validation.validate(this._inputElement, this._messageElement);
   }
 
-  protected onClick(event: Event) {
-    this._click();
-  }
+  protected onClick(event: Event) {}
 
   protected onFocus(event: Event) {

[Survived] BlockStatement
core/shared/input/Input.ts:96:35
     this._click();
   }
 
-  protected onFocus(event: Event) {
-    this._focus();
-  }
+  protected onFocus(event: Event) {}
 
   protected onInput(event: Event) {

[Survived] BlockStatement
core/shared/input/Input.ts:100:35
     this._focus();
   }
 
-  protected onInput(event: Event) {
-    this.validation.keepCursorsPosition(this._inputElement);
-    Validation.setCustomValidationError('', this._inputElement);
-    this.format(this._inputElement.value);
-  }
+  protected onInput(event: Event) {}
 
   protected onKeyPress(event: KeyboardEvent) {

[Survived] BlockStatement
core/shared/input/Input.ts:106:46
     this.format(this._inputElement.value);
   }
 
-  protected onKeyPress(event: KeyboardEvent) {
-    if (Validation.isEnter(event)) {
-      event.preventDefault();
-      if (this._inputElement.id === CARD_NUMBER_INPUT) {
-        this.validation.luhnCheck(this._cardNumberInput, this._inputElement, this._messageElement);
-      }
-      this._validateInput();
-      this.validation.callSubmitEvent();
-    }
-  }
+  protected onKeyPress(event: KeyboardEvent) {}
 
   protected onKeydown(event: KeyboardEvent) {

[Survived] ConditionalExpression
core/shared/input/Input.ts:107:9
   }
 
   protected onKeyPress(event: KeyboardEvent) {
-    if (Validation.isEnter(event)) {
+    if (false) {
       event.preventDefault();
       if (this._inputElement.id === CARD_NUMBER_INPUT) {

[Survived] ConditionalExpression
core/shared/input/Input.ts:107:9
   }
 
   protected onKeyPress(event: KeyboardEvent) {
-    if (Validation.isEnter(event)) {
+    if (true) {
       event.preventDefault();
       if (this._inputElement.id === CARD_NUMBER_INPUT) {

[Survived] ConditionalExpression
core/shared/input/Input.ts:109:11
   protected onKeyPress(event: KeyboardEvent) {
     if (Validation.isEnter(event)) {
       event.preventDefault();
-      if (this._inputElement.id === CARD_NUMBER_INPUT) {
+      if (true) {
         this.validation.luhnCheck(this._cardNumberInput, this._inputElement, this._messageElement);
       }

[Survived] EqualityOperator
core/shared/input/Input.ts:109:11
   protected onKeyPress(event: KeyboardEvent) {
     if (Validation.isEnter(event)) {
       event.preventDefault();
-      if (this._inputElement.id === CARD_NUMBER_INPUT) {
+      if (this._inputElement.id !== CARD_NUMBER_INPUT) {
         this.validation.luhnCheck(this._cardNumberInput, this._inputElement, this._messageElement);
       }

[Survived] BlockStatement
core/shared/input/Input.ts:117:45
     }
   }
 
-  protected onKeydown(event: KeyboardEvent) {
-    this.validation.setOnKeyDownProperties(this._inputElement, event);
-  }
+  protected onKeydown(event: KeyboardEvent) {}
 
   protected onPaste(event: ClipboardEvent) {

[Survived] BlockStatement
core/shared/input/Input.ts:121:44
     this.validation.setOnKeyDownProperties(this._inputElement, event);
   }
 
-  protected onPaste(event: ClipboardEvent) {
-    let { clipboardData } = event;
-    event.preventDefault();
-    if (this._inputElement === document.activeElement) {
-      this.validation.keepCursorsPosition(this._inputElement);
-    }
-    if (typeof clipboardData === 'undefined') {
-      // @ts-ignore
-      clipboardData = window.clipboardData.getData('Text');
-    } else {
-      // @ts-ignore
-      clipboardData = event.clipboardData.getData('text/plain');
-    }
-
-    // @ts-ignore
-    this._inputElement.value = Utils.stripChars(clipboardData, undefined);
-    Validation.setCustomValidationError('', this._inputElement);
-    this.format(this._inputElement.value);
-    this.validation.validate(this._inputElement, this._messageElement);
-  }
+  protected onPaste(event: ClipboardEvent) {}
 
   protected setAttributes(attributes: object) {

[Survived] BlockStatement
core/shared/input/Input.ts:124:56
   protected onPaste(event: ClipboardEvent) {
     let { clipboardData } = event;
     event.preventDefault();
-    if (this._inputElement === document.activeElement) {
-      this.validation.keepCursorsPosition(this._inputElement);
-    }
+    if (this._inputElement === document.activeElement) {}
     if (typeof clipboardData === 'undefined') {
       // @ts-ignore

[Survived] ConditionalExpression
core/shared/input/Input.ts:124:9
   protected onPaste(event: ClipboardEvent) {
     let { clipboardData } = event;
     event.preventDefault();
-    if (this._inputElement === document.activeElement) {
+    if (false) {
       this.validation.keepCursorsPosition(this._inputElement);
     }

[Survived] ConditionalExpression
core/shared/input/Input.ts:127:9
     if (this._inputElement === document.activeElement) {
       this.validation.keepCursorsPosition(this._inputElement);
     }
-    if (typeof clipboardData === 'undefined') {
+    if (true) {
       // @ts-ignore
       clipboardData = window.clipboardData.getData('Text');

[Survived] EqualityOperator
core/shared/input/Input.ts:127:9
     if (this._inputElement === document.activeElement) {
       this.validation.keepCursorsPosition(this._inputElement);
     }
-    if (typeof clipboardData === 'undefined') {
+    if (typeof clipboardData !== 'undefined') {
       // @ts-ignore
       clipboardData = window.clipboardData.getData('Text');

[Survived] BlockStatement
core/shared/input/Input.ts:130:12
     if (typeof clipboardData === 'undefined') {
       // @ts-ignore
       clipboardData = window.clipboardData.getData('Text');
-    } else {
-      // @ts-ignore
-      clipboardData = event.clipboardData.getData('text/plain');
-    }
+    } else {}
 
     // @ts-ignore

[Survived] BlockStatement
core/shared/input/Input.ts:142:47
     this.validation.validate(this._inputElement, this._messageElement);
   }
 
-  protected setAttributes(attributes: object) {
-    // tslint:disable-next-line:forin
-    for (const attribute in attributes) {
-      // @ts-ignore
-      this._inputElement.setAttribute(attribute, attributes[attribute]);
-    }
-  }
+  protected setAttributes(attributes: object) {}
 
   protected setEventListener(event: string, validate: boolean = true) {

[Survived] BlockStatement
core/shared/input/Input.ts:144:41
 
   protected setAttributes(attributes: object) {
     // tslint:disable-next-line:forin
-    for (const attribute in attributes) {
-      // @ts-ignore
-      this._inputElement.setAttribute(attribute, attributes[attribute]);
-    }
+    for (const attribute in attributes) {}
   }
 

[Survived] BooleanLiteral
core/shared/input/Input.ts:150:65
     }
   }
 
-  protected setEventListener(event: string, validate: boolean = true) {
+  protected setEventListener(event: string, validate: boolean = false) {
     this._messageBus.subscribe(event, () => {
       if (validate) {

[Survived] BlockStatement
core/shared/input/Input.ts:150:71
     }
   }
 
-  protected setEventListener(event: string, validate: boolean = true) {
-    this._messageBus.subscribe(event, () => {
-      if (validate) {
-        this._validateInput();
-      }
-    });
-  }
+  protected setEventListener(event: string, validate: boolean = true) {}
 
   protected setValue(value: string) {

[Survived] BlockStatement
core/shared/input/Input.ts:151:45
   }
 
   protected setEventListener(event: string, validate: boolean = true) {
-    this._messageBus.subscribe(event, () => {
-      if (validate) {
-        this._validateInput();
-      }
-    });
+    this._messageBus.subscribe(event, () => {});
   }
 

[Survived] ConditionalExpression
core/shared/input/Input.ts:152:11
 
   protected setEventListener(event: string, validate: boolean = true) {
     this._messageBus.subscribe(event, () => {
-      if (validate) {
+      if (true) {
         this._validateInput();
       }

[Survived] BlockStatement
core/shared/input/Input.ts:152:21
 
   protected setEventListener(event: string, validate: boolean = true) {
     this._messageBus.subscribe(event, () => {
-      if (validate) {
-        this._validateInput();
-      }
+      if (validate) {}
     });
   }

[Survived] BlockStatement
core/shared/input/Input.ts:158:37
     });
   }
 
-  protected setValue(value: string) {
-    this._inputElement.value = value;
-  }
+  protected setValue(value: string) {}
 
   protected setMessageBusEvent(event: string): IMessageBusEvent {

[Survived] BlockStatement
core/shared/input/Input.ts:162:65
     this._inputElement.value = value;
   }
 
-  protected setMessageBusEvent(event: string): IMessageBusEvent {
-    const formFieldState: IFormFieldState = this.getState();
-    return {
-      data: formFieldState,
-      type: event
-    };
-  }
+  protected setMessageBusEvent(event: string): IMessageBusEvent {}
 
   private _addTabListener() {

[Survived] BlockStatement
core/shared/input/Input.ts:170:29
     };
   }
 
-  private _addTabListener() {
-    window.addEventListener('focus', event => {
-      this.onFocus(event);
-    });
-  }
+  private _addTabListener() {}
 
   private _blur() {

[Survived] BlockStatement
core/shared/input/Input.ts:171:47
   }
 
   private _addTabListener() {
-    window.addEventListener('focus', event => {
-      this.onFocus(event);
-    });
+    window.addEventListener('focus', event => {});
   }
 

[Survived] BlockStatement
core/shared/input/Input.ts:176:19
     });
   }
 
-  private _blur() {
-    this._inputElement.blur();
-  }
+  private _blur() {}
 
   private _click() {

[Survived] BlockStatement
core/shared/input/Input.ts:180:20
     this._inputElement.blur();
   }
 
-  private _click() {
-    this._inputElement.click();
-  }
+  private _click() {}
 
   private _focus() {

[Survived] BlockStatement
core/shared/input/Input.ts:184:20
     this._inputElement.click();
   }
 
-  private _focus() {
-    this._inputElement.focus();
-  }
+  private _focus() {}
 
   private _setInputListeners() {

[Survived] BlockStatement
core/shared/input/Input.ts:189:77
   }
 
   private _setInputListeners() {
-    this._inputElement.addEventListener('paste', (event: ClipboardEvent) => {
-      this.onPaste(event);
-    });
+    this._inputElement.addEventListener('paste', (event: ClipboardEvent) => {});
 
     this._inputElement.addEventListener('keypress', (event: KeyboardEvent) => {

[Survived] BlockStatement
core/shared/input/Input.ts:193:79
       this.onPaste(event);
     });
 
-    this._inputElement.addEventListener('keypress', (event: KeyboardEvent) => {
-      this.onKeyPress(event);
-    });
+    this._inputElement.addEventListener('keypress', (event: KeyboardEvent) => {});
 
     this._inputElement.addEventListener('keydown', (event: KeyboardEvent) => {

[Survived] BlockStatement
core/shared/input/Input.ts:197:78
       this.onKeyPress(event);
     });
 
-    this._inputElement.addEventListener('keydown', (event: KeyboardEvent) => {
-      this.onKeydown(event);
-    });
+    this._inputElement.addEventListener('keydown', (event: KeyboardEvent) => {});
 
     this._inputElement.addEventListener(

[Survived] StringLiteral
core/shared/input/Input.ts:202:7
     });
 
     this._inputElement.addEventListener(
-      'input',
+      "",
       onInputWraper((event: Event) => {
         this.onInput(event);

[Survived] BlockStatement
core/shared/input/Input.ts:203:39
 
     this._inputElement.addEventListener(
       'input',
-      onInputWraper((event: Event) => {
-        this.onInput(event);
-      })
+      onInputWraper((event: Event) => {})
     );
 

[Survived] BlockStatement
core/shared/input/Input.ts:208:68
       })
     );
 
-    this._inputElement.addEventListener('focus', (event: Event) => {
-      this.onFocus(event);
-    });
+    this._inputElement.addEventListener('focus', (event: Event) => {});
 
     this._inputElement.addEventListener('blur', () => {

[Survived] BlockStatement
core/shared/input/Input.ts:212:55
       this.onFocus(event);
     });
 
-    this._inputElement.addEventListener('blur', () => {
-      this.onBlur();
-    });
+    this._inputElement.addEventListener('blur', () => {});
 
     this._inputElement.addEventListener('click', (event: Event) => {

[Survived] StringLiteral
core/shared/input/Input.ts:212:41
       this.onFocus(event);
     });
 
-    this._inputElement.addEventListener('blur', () => {
+    this._inputElement.addEventListener("", () => {
       this.onBlur();
     });

[Survived] BlockStatement
core/shared/input/Input.ts:216:68
       this.onBlur();
     });
 
-    this._inputElement.addEventListener('click', (event: Event) => {
-      this.onClick(event);
-    });
+    this._inputElement.addEventListener('click', (event: Event) => {});
   }
 

[Survived] BlockStatement
core/shared/input/Input.ts:221:27
     });
   }
 
-  private _setLabelText() {
-    this._labelElement.textContent = this._translator.translate(this.getLabel());
-  }
+  private _setLabelText() {}
 
   private _validateInput() {

[Survived] BlockStatement
core/shared/input/Input.ts:225:28
     this._labelElement.textContent = this._translator.translate(this.getLabel());
   }
 
-  private _validateInput() {
-    this.format(this._inputElement.value);
-    if (this._inputElement.id === CARD_NUMBER_INPUT) {
-      this.validation.luhnCheck(this._cardNumberInput, this._inputElement, this._messageElement);
-    }
-    this.validation.validate(this._inputElement, this._messageElement);
-  }
+  private _validateInput() {}
 }
 

[Survived] EqualityOperator
core/shared/input/Input.ts:227:9
 
   private _validateInput() {
     this.format(this._inputElement.value);
-    if (this._inputElement.id === CARD_NUMBER_INPUT) {
+    if (this._inputElement.id !== CARD_NUMBER_INPUT) {
       this.validation.luhnCheck(this._cardNumberInput, this._inputElement, this._messageElement);
     }

[Survived] ConditionalExpression
core/shared/input/Input.ts:227:9
 
   private _validateInput() {
     this.format(this._inputElement.value);
-    if (this._inputElement.id === CARD_NUMBER_INPUT) {
+    if (true) {
       this.validation.luhnCheck(this._cardNumberInput, this._inputElement, this._messageElement);
     }
