[Survived] BlockStatement
core/shared/message-bus/MessageBus.ts:30:5
     private framesHub: FramesHub,
     private identifier: FrameIdentifier,
     private frameAccessor: FrameAccessor
-  ) {
-    this.messageStream$ = this.getMessageStream();
-    this.pipe = this.messageStream$.pipe.bind(this.messageStream$);
-
-    if (this.identifier.isControlFrame()) {
-      ((window as unknown) as ControlFrameWindow).stMessages = this.messageStream$;
-    }
-  }
+  ) {}
 
   public publish<T>(event: IMessageBusEvent<T>, publishToParent?: boolean): void {

[Survived] ConditionalExpression
core/shared/message-bus/MessageBus.ts:34:9
     this.messageStream$ = this.getMessageStream();
     this.pipe = this.messageStream$.pipe.bind(this.messageStream$);
 
-    if (this.identifier.isControlFrame()) {
+    if (false) {
       ((window as unknown) as ControlFrameWindow).stMessages = this.messageStream$;
     }

[Survived] ConditionalExpression
core/shared/message-bus/MessageBus.ts:34:9
     this.messageStream$ = this.getMessageStream();
     this.pipe = this.messageStream$.pipe.bind(this.messageStream$);
 
-    if (this.identifier.isControlFrame()) {
+    if (true) {
       ((window as unknown) as ControlFrameWindow).stMessages = this.messageStream$;
     }

[Survived] BlockStatement
core/shared/message-bus/MessageBus.ts:39:82
     }
   }
 
-  public publish<T>(event: IMessageBusEvent<T>, publishToParent?: boolean): void {
-    this.framesHub.waitForFrame(CONTROL_FRAME_IFRAME).subscribe(controlFrame => {
-      try {
-        this.communicator.send(event, controlFrame);
-      } catch (e) {
-        console.warn(`Cannot send event to ControlFrame. ${e}`);
-      }
-    });
-
-    if (publishToParent) {
-      this.publishToParent(event);
-    }
-  }
+  public publish<T>(event: IMessageBusEvent<T>, publishToParent?: boolean): void {}
 
   public subscribe<T>(observer?: PartialObserver<IMessageBusEvent<T>>): Unsubscribable;

[Survived] BlockStatement
core/shared/message-bus/MessageBus.ts:40:81
   }
 
   public publish<T>(event: IMessageBusEvent<T>, publishToParent?: boolean): void {
-    this.framesHub.waitForFrame(CONTROL_FRAME_IFRAME).subscribe(controlFrame => {
-      try {
-        this.communicator.send(event, controlFrame);
-      } catch (e) {
-        console.warn(`Cannot send event to ControlFrame. ${e}`);
-      }
-    });
+    this.framesHub.waitForFrame(CONTROL_FRAME_IFRAME).subscribe(controlFrame => {});
 
     if (publishToParent) {

[Survived] BlockStatement
core/shared/message-bus/MessageBus.ts:41:11
 
   public publish<T>(event: IMessageBusEvent<T>, publishToParent?: boolean): void {
     this.framesHub.waitForFrame(CONTROL_FRAME_IFRAME).subscribe(controlFrame => {
-      try {
-        this.communicator.send(event, controlFrame);
-      } catch (e) {
+      try {} catch (e) {
         console.warn(`Cannot send event to ControlFrame. ${e}`);
       }

[Survived] BlockStatement
core/shared/message-bus/MessageBus.ts:43:19
     this.framesHub.waitForFrame(CONTROL_FRAME_IFRAME).subscribe(controlFrame => {
       try {
         this.communicator.send(event, controlFrame);
-      } catch (e) {
-        console.warn(`Cannot send event to ControlFrame. ${e}`);
-      }
+      } catch (e) {}
     });
 

[Survived] ConditionalExpression
core/shared/message-bus/MessageBus.ts:48:9
       }
     });
 
-    if (publishToParent) {
+    if (true) {
       this.publishToParent(event);
     }

[Survived] BlockStatement
core/shared/message-bus/MessageBus.ts:48:26
       }
     });
 
-    if (publishToParent) {
-      this.publishToParent(event);
-    }
+    if (publishToParent) {}
   }
 

[Survived] BlockStatement
core/shared/message-bus/MessageBus.ts:64:55
   /** @deprecated use RxJS implementation instead */
   public subscribe<T>(eventType: string, callback: (data: T) => void): Unsubscribable;
 
-  public subscribe<T>(...args: any[]): Unsubscribable {
-    if (typeof args[0] === 'string' && typeof args[1] === 'function') {
-      const [eventType, callback] = args;
-
-      return this.messageStream$
-        .pipe(
-          ofType(eventType),
-          map((event: IMessageBusEvent<T>) => event.data)
-        )
-        .subscribe(callback);
-    }
-
-    return this.messageStream$.subscribe.apply(this.messageStream$, args);
-  }
+  public subscribe<T>(...args: any[]): Unsubscribable {}
 
   private publishToParent<T>(event: IMessageBusEvent<T>): void {

[Survived] ConditionalExpression
core/shared/message-bus/MessageBus.ts:65:9
   public subscribe<T>(eventType: string, callback: (data: T) => void): Unsubscribable;
 
   public subscribe<T>(...args: any[]): Unsubscribable {
-    if (typeof args[0] === 'string' && typeof args[1] === 'function') {
+    if (true) {
       const [eventType, callback] = args;
 

[Survived] ConditionalExpression
core/shared/message-bus/MessageBus.ts:65:9
   public subscribe<T>(eventType: string, callback: (data: T) => void): Unsubscribable;
 
   public subscribe<T>(...args: any[]): Unsubscribable {
-    if (typeof args[0] === 'string' && typeof args[1] === 'function') {
+    if (true && typeof args[1] === 'function') {
       const [eventType, callback] = args;
 

[Survived] ArrowFunction
core/shared/message-bus/MessageBus.ts:71:15
       return this.messageStream$
         .pipe(
           ofType(eventType),
-          map((event: IMessageBusEvent<T>) => event.data)
+          map(() => undefined)
         )
         .subscribe(callback);

[Survived] BlockStatement
core/shared/message-bus/MessageBus.ts:79:64
     return this.messageStream$.subscribe.apply(this.messageStream$, args);
   }
 
-  private publishToParent<T>(event: IMessageBusEvent<T>): void {
-    if (!Object.values(MessageBus.EVENTS_PUBLIC).includes(event.type)) {
-      throw new Error(`Cannot publish private event "${event.type}" to parent frame.`);
-    }
-
-    if (this.identifier.isParentFrame()) {
-      this.parentFrameStream$.next(event);
-      return;
-    }
-
-    this.communicator.send(event, MERCHANT_PARENT_FRAME);
-  }
+  private publishToParent<T>(event: IMessageBusEvent<T>): void {}
 
   private getMessageStream(): Observable<IMessageBusEvent> {

[Survived] ConditionalExpression
core/shared/message-bus/MessageBus.ts:80:9
   }
 
   private publishToParent<T>(event: IMessageBusEvent<T>): void {
-    if (!Object.values(MessageBus.EVENTS_PUBLIC).includes(event.type)) {
+    if (false) {
       throw new Error(`Cannot publish private event "${event.type}" to parent frame.`);
     }

[Survived] ConditionalExpression
core/shared/message-bus/MessageBus.ts:80:9
   }
 
   private publishToParent<T>(event: IMessageBusEvent<T>): void {
-    if (!Object.values(MessageBus.EVENTS_PUBLIC).includes(event.type)) {
+    if (true) {
       throw new Error(`Cannot publish private event "${event.type}" to parent frame.`);
     }

[Survived] StringLiteral
core/shared/message-bus/MessageBus.ts:81:23
 
   private publishToParent<T>(event: IMessageBusEvent<T>): void {
     if (!Object.values(MessageBus.EVENTS_PUBLIC).includes(event.type)) {
-      throw new Error(`Cannot publish private event "${event.type}" to parent frame.`);
+      throw new Error(``);
     }
 

[Survived] BlockStatement
core/shared/message-bus/MessageBus.ts:84:42
       throw new Error(`Cannot publish private event "${event.type}" to parent frame.`);
     }
 
-    if (this.identifier.isParentFrame()) {
-      this.parentFrameStream$.next(event);
-      return;
-    }
+    if (this.identifier.isParentFrame()) {}
 
     this.communicator.send(event, MERCHANT_PARENT_FRAME);

[Survived] ConditionalExpression
core/shared/message-bus/MessageBus.ts:84:9
       throw new Error(`Cannot publish private event "${event.type}" to parent frame.`);
     }
 
-    if (this.identifier.isParentFrame()) {
+    if (true) {
       this.parentFrameStream$.next(event);
       return;

[Survived] BlockStatement
core/shared/message-bus/MessageBus.ts:92:60
     this.communicator.send(event, MERCHANT_PARENT_FRAME);
   }
 
-  private getMessageStream(): Observable<IMessageBusEvent> {
-    if (this.identifier.isControlFrame()) {
-      return this.communicator.incomingEvent$;
-    }
-
-    if (this.identifier.isParentFrame()) {
-      return merge(this.communicator.incomingEvent$, this.parentFrameStream$);
-    }
-
-    return this.framesHub.waitForFrame(CONTROL_FRAME_IFRAME).pipe(
-      switchMap(frameName => {
-        const frames: FrameCollection = this.frameAccessor.getFrameCollection();
-        const controlFrame: ControlFrameWindow = frames[frameName] as ControlFrameWindow;
-
-        return new Observable<IMessageBusEvent>(subscriber => {
-          controlFrame.stMessages.subscribe(value => subscriber.next(value));
-        });
-      })
-    );
-  }
+  private getMessageStream(): Observable<IMessageBusEvent> {}
 }
 

[Survived] BlockStatement
core/shared/message-bus/MessageBus.ts:93:43
   }
 
   private getMessageStream(): Observable<IMessageBusEvent> {
-    if (this.identifier.isControlFrame()) {
-      return this.communicator.incomingEvent$;
-    }
+    if (this.identifier.isControlFrame()) {}
 
     if (this.identifier.isParentFrame()) {

[Survived] ConditionalExpression
core/shared/message-bus/MessageBus.ts:93:9
   }
 
   private getMessageStream(): Observable<IMessageBusEvent> {
-    if (this.identifier.isControlFrame()) {
+    if (true) {
       return this.communicator.incomingEvent$;
     }

[Survived] BlockStatement
core/shared/message-bus/MessageBus.ts:97:42
       return this.communicator.incomingEvent$;
     }
 
-    if (this.identifier.isParentFrame()) {
-      return merge(this.communicator.incomingEvent$, this.parentFrameStream$);
-    }
+    if (this.identifier.isParentFrame()) {}
 
     return this.framesHub.waitForFrame(CONTROL_FRAME_IFRAME).pipe(

[Survived] ConditionalExpression
core/shared/message-bus/MessageBus.ts:97:9
       return this.communicator.incomingEvent$;
     }
 
-    if (this.identifier.isParentFrame()) {
+    if (false) {
       return merge(this.communicator.incomingEvent$, this.parentFrameStream$);
     }

[Survived] BlockStatement
core/shared/message-bus/MessageBus.ts:102:30
     }
 
     return this.framesHub.waitForFrame(CONTROL_FRAME_IFRAME).pipe(
-      switchMap(frameName => {
-        const frames: FrameCollection = this.frameAccessor.getFrameCollection();
-        const controlFrame: ControlFrameWindow = frames[frameName] as ControlFrameWindow;
-
-        return new Observable<IMessageBusEvent>(subscriber => {
-          controlFrame.stMessages.subscribe(value => subscriber.next(value));
-        });
-      })
+      switchMap(frameName => {})
     );
   }

[Survived] BlockStatement
core/shared/message-bus/MessageBus.ts:106:63
         const frames: FrameCollection = this.frameAccessor.getFrameCollection();
         const controlFrame: ControlFrameWindow = frames[frameName] as ControlFrameWindow;
 
-        return new Observable<IMessageBusEvent>(subscriber => {
-          controlFrame.stMessages.subscribe(value => subscriber.next(value));
-        });
+        return new Observable<IMessageBusEvent>(subscriber => {});
       })
     );

[Survived] ArrowFunction
core/shared/message-bus/MessageBus.ts:107:45
         const controlFrame: ControlFrameWindow = frames[frameName] as ControlFrameWindow;
 
         return new Observable<IMessageBusEvent>(subscriber => {
-          controlFrame.stMessages.subscribe(value => subscriber.next(value));
+          controlFrame.stMessages.subscribe(() => undefined);
         });
       })
