[Survived] BlockStatement
core/shared/notification/Notification.ts:33:5
     private _configProvider: ConfigProvider,
     private _framesHub: FramesHub,
     private _frame: Frame
-  ) {
-    this._applyStyles();
-    this._translator = new Translator('en_GB');
-    this._messageMap = new Map(Object.entries(NotificationsClasses));
-    this._messageBus.subscribe(MessageBus.EVENTS_PUBLIC.NOTIFICATION, (event: INotificationEvent) => {
-      this._displayNotification(event);
-    });
-
-    this._framesHub.waitForFrame(CONTROL_FRAME_IFRAME).subscribe(() => {
-      this._translator = new Translator(this._browserLocalStorage.getItem('locale'));
-    });
-  }
+  ) {}
 
   private _applyStyles(): void {

[Survived] BlockStatement
core/shared/notification/Notification.ts:37:102
     this._applyStyles();
     this._translator = new Translator('en_GB');
     this._messageMap = new Map(Object.entries(NotificationsClasses));
-    this._messageBus.subscribe(MessageBus.EVENTS_PUBLIC.NOTIFICATION, (event: INotificationEvent) => {
-      this._displayNotification(event);
-    });
+    this._messageBus.subscribe(MessageBus.EVENTS_PUBLIC.NOTIFICATION, (event: INotificationEvent) => {});
 
     this._framesHub.waitForFrame(CONTROL_FRAME_IFRAME).subscribe(() => {

[Survived] BlockStatement
core/shared/notification/Notification.ts:41:72
       this._displayNotification(event);
     });
 
-    this._framesHub.waitForFrame(CONTROL_FRAME_IFRAME).subscribe(() => {
-      this._translator = new Translator(this._browserLocalStorage.getItem('locale'));
-    });
+    this._framesHub.waitForFrame(CONTROL_FRAME_IFRAME).subscribe(() => {});
   }
 

[Survived] StringLiteral
core/shared/notification/Notification.ts:42:75
     });
 
     this._framesHub.waitForFrame(CONTROL_FRAME_IFRAME).subscribe(() => {
-      this._translator = new Translator(this._browserLocalStorage.getItem('locale'));
+      this._translator = new Translator(this._browserLocalStorage.getItem(""));
     });
   }

[Survived] BlockStatement
core/shared/notification/Notification.ts:46:32
     });
   }
 
-  private _applyStyles(): void {
-    this._configProvider.getConfig$().subscribe((config: IConfig) => {
-      const definedStyles = config.styles.notificationFrame || {};
-      const styles = Object.keys(definedStyles).map((item: string) => {
-        return { [item]: definedStyles[item] };
-      });
-      const styler: Styler = new Styler(this._getAllowedStyles(), styles);
-    });
-  }
+  private _applyStyles(): void {}
 
   private _getAllowedStyles(): IAllowedStyles {

[Survived] BlockStatement
core/shared/notification/Notification.ts:47:70
   }
 
   private _applyStyles(): void {
-    this._configProvider.getConfig$().subscribe((config: IConfig) => {
-      const definedStyles = config.styles.notificationFrame || {};
-      const styles = Object.keys(definedStyles).map((item: string) => {
-        return { [item]: definedStyles[item] };
-      });
-      const styler: Styler = new Styler(this._getAllowedStyles(), styles);
-    });
+    this._configProvider.getConfig$().subscribe((config: IConfig) => {});
   }
 

[Survived] ConditionalExpression
core/shared/notification/Notification.ts:48:29
 
   private _applyStyles(): void {
     this._configProvider.getConfig$().subscribe((config: IConfig) => {
-      const definedStyles = config.styles.notificationFrame || {};
+      const definedStyles = true;
       const styles = Object.keys(definedStyles).map((item: string) => {
         return { [item]: definedStyles[item] };

[Survived] LogicalOperator
core/shared/notification/Notification.ts:48:29
 
   private _applyStyles(): void {
     this._configProvider.getConfig$().subscribe((config: IConfig) => {
-      const definedStyles = config.styles.notificationFrame || {};
+      const definedStyles = config.styles.notificationFrame && {};
       const styles = Object.keys(definedStyles).map((item: string) => {
         return { [item]: definedStyles[item] };

[Survived] BlockStatement
core/shared/notification/Notification.ts:49:71
   private _applyStyles(): void {
     this._configProvider.getConfig$().subscribe((config: IConfig) => {
       const definedStyles = config.styles.notificationFrame || {};
-      const styles = Object.keys(definedStyles).map((item: string) => {
-        return { [item]: definedStyles[item] };
-      });
+      const styles = Object.keys(definedStyles).map((item: string) => {});
       const styler: Styler = new Styler(this._getAllowedStyles(), styles);
     });

[Survived] StringLiteral
core/shared/notification/Notification.ts:58:74
 
   private _getAllowedStyles(): IAllowedStyles {
     let allowed: IAllowedStyles = {
-      'background-color-body': { property: 'background-color', selector: 'body' },
+      'background-color-body': { property: 'background-color', selector: "" },
       'color-body': { property: 'color', selector: 'body' },
       'font-size-body': { property: 'font-size', selector: 'body' },

[Survived] ObjectLiteral
core/shared/notification/Notification.ts:58:32
 
   private _getAllowedStyles(): IAllowedStyles {
     let allowed: IAllowedStyles = {
-      'background-color-body': { property: 'background-color', selector: 'body' },
+      'background-color-body': {},
       'color-body': { property: 'color', selector: 'body' },
       'font-size-body': { property: 'font-size', selector: 'body' },

[Survived] StringLiteral
core/shared/notification/Notification.ts:62:39
       'color-body': { property: 'color', selector: 'body' },
       'font-size-body': { property: 'font-size', selector: 'body' },
       'line-height-body': { property: 'line-height', selector: 'body' },
-      'space-inset-body': { property: 'padding', selector: 'body' },
+      'space-inset-body': { property: "", selector: 'body' },
       'space-outset-body': { property: 'margin', selector: 'body' }
     };

[Survived] ObjectLiteral
core/shared/notification/Notification.ts:62:27
       'color-body': { property: 'color', selector: 'body' },
       'font-size-body': { property: 'font-size', selector: 'body' },
       'line-height-body': { property: 'line-height', selector: 'body' },
-      'space-inset-body': { property: 'padding', selector: 'body' },
+      'space-inset-body': {},
       'space-outset-body': { property: 'margin', selector: 'body' }
     };

[Survived] ObjectLiteral
core/shared/notification/Notification.ts:63:28
       'font-size-body': { property: 'font-size', selector: 'body' },
       'line-height-body': { property: 'line-height', selector: 'body' },
       'space-inset-body': { property: 'padding', selector: 'body' },
-      'space-outset-body': { property: 'margin', selector: 'body' }
+      'space-outset-body': {}
     };
     const notification = `#${NOTIFICATION_FRAME_ID}`;

[Survived] StringLiteral
core/shared/notification/Notification.ts:69:18
     const error = `.${NotificationsClasses.error}${notification}`;
     const success = `.${NotificationsClasses.success}${notification}`;
     const cancel = `.${NotificationsClasses.cancel}${notification}`;
-    const info = `.${NotificationsClasses.info}${notification}`;
+    const info = ``;
     allowed = {
       ...allowed,

[Survived] StringLiteral
core/shared/notification/Notification.ts:77:19
         selector: notification
       },
       'background-color-notification-error': {
-        property: 'background-color',
+        property: "",
         selector: error
       },

[Survived] StringLiteral
core/shared/notification/Notification.ts:81:19
         selector: error
       },
       'background-color-notification-info': {
-        property: 'background-color',
+        property: "",
         selector: info
       },

[Survived] ObjectLiteral
core/shared/notification/Notification.ts:84:48
         property: 'background-color',
         selector: info
       },
-      'background-color-notification-success': {
-        property: 'background-color',
-        selector: success
-      },
+      'background-color-notification-success': {},
       'background-color-notification-cancel': {
         property: 'background-color',

[Survived] StringLiteral
core/shared/notification/Notification.ts:93:54
         selector: cancel
       },
       'border-color-notification': { property: 'border-color', selector: notification },
-      'border-color-notification-error': { property: 'border-color', selector: error },
+      'border-color-notification-error': { property: "", selector: error },
       'border-color-notification-info': { property: 'border-color', selector: info },
       'border-color-notification-success': {

[Survived] StringLiteral
core/shared/notification/Notification.ts:94:53
       },
       'border-color-notification': { property: 'border-color', selector: notification },
       'border-color-notification-error': { property: 'border-color', selector: error },
-      'border-color-notification-info': { property: 'border-color', selector: info },
+      'border-color-notification-info': { property: "", selector: info },
       'border-color-notification-success': {
         property: 'border-color',

[Survived] ObjectLiteral
core/shared/notification/Notification.ts:95:44
       'border-color-notification': { property: 'border-color', selector: notification },
       'border-color-notification-error': { property: 'border-color', selector: error },
       'border-color-notification-info': { property: 'border-color', selector: info },
-      'border-color-notification-success': {
-        property: 'border-color',
-        selector: success
-      },
+      'border-color-notification-success': {},
       'border-color-notification-cancel': {
         property: 'border-color',

[Survived] StringLiteral
core/shared/notification/Notification.ts:96:19
       'border-color-notification-error': { property: 'border-color', selector: error },
       'border-color-notification-info': { property: 'border-color', selector: info },
       'border-color-notification-success': {
-        property: 'border-color',
+        property: "",
         selector: success
       },

[Survived] ObjectLiteral
core/shared/notification/Notification.ts:99:43
         property: 'border-color',
         selector: success
       },
-      'border-color-notification-cancel': {
-        property: 'border-color',
-        selector: cancel
-      },
+      'border-color-notification-cancel': {},
       'border-radius-notification': { property: 'border-radius', selector: notification },
       'border-radius-notification-error': { property: 'border-radius', selector: error },

[Survived] ObjectLiteral
core/shared/notification/Notification.ts:105:42
       },
       'border-radius-notification': { property: 'border-radius', selector: notification },
       'border-radius-notification-error': { property: 'border-radius', selector: error },
-      'border-radius-notification-info': { property: 'border-radius', selector: info },
+      'border-radius-notification-info': {},
       'border-radius-notification-success': {
         property: 'border-radius',

[Survived] ObjectLiteral
core/shared/notification/Notification.ts:110:44
         property: 'border-radius',
         selector: success
       },
-      'border-radius-notification-cancel': {
-        property: 'border-radius',
-        selector: cancel
-      },
+      'border-radius-notification-cancel': {},
       'border-size-notification': { property: 'border-width', selector: notification },
       'border-size-notification-error': { property: 'border-width', selector: error },

[Survived] ObjectLiteral
core/shared/notification/Notification.ts:114:35
         property: 'border-radius',
         selector: cancel
       },
-      'border-size-notification': { property: 'border-width', selector: notification },
+      'border-size-notification': {},
       'border-size-notification-error': { property: 'border-width', selector: error },
       'border-size-notification-info': { property: 'border-width', selector: info },

[Survived] StringLiteral
core/shared/notification/Notification.ts:114:47
         property: 'border-radius',
         selector: cancel
       },
-      'border-size-notification': { property: 'border-width', selector: notification },
+      'border-size-notification': { property: "", selector: notification },
       'border-size-notification-error': { property: 'border-width', selector: error },
       'border-size-notification-info': { property: 'border-width', selector: info },

[Survived] StringLiteral
core/shared/notification/Notification.ts:121:46
       'border-size-notification-cancel': { property: 'border-width', selector: cancel },
       'color-notification': { property: 'color', selector: notification },
       'color-notification-error': { property: 'color', selector: error },
-      'color-notification-info': { property: 'color', selector: info },
+      'color-notification-info': { property: "", selector: info },
       'color-notification-success': { property: 'color', selector: success },
       'color-notification-cancel': { property: 'color', selector: cancel },

[Survived] ObjectLiteral
core/shared/notification/Notification.ts:121:34
       'border-size-notification-cancel': { property: 'border-width', selector: cancel },
       'color-notification': { property: 'color', selector: notification },
       'color-notification-error': { property: 'color', selector: error },
-      'color-notification-info': { property: 'color', selector: info },
+      'color-notification-info': {},
       'color-notification-success': { property: 'color', selector: success },
       'color-notification-cancel': { property: 'color', selector: cancel },

[Survived] ObjectLiteral
core/shared/notification/Notification.ts:122:37
       'color-notification': { property: 'color', selector: notification },
       'color-notification-error': { property: 'color', selector: error },
       'color-notification-info': { property: 'color', selector: info },
-      'color-notification-success': { property: 'color', selector: success },
+      'color-notification-success': {},
       'color-notification-cancel': { property: 'color', selector: cancel },
       'font-size-notification': { property: 'font-size', selector: notification },

[Survived] StringLiteral
core/shared/notification/Notification.ts:123:48
       'color-notification-error': { property: 'color', selector: error },
       'color-notification-info': { property: 'color', selector: info },
       'color-notification-success': { property: 'color', selector: success },
-      'color-notification-cancel': { property: 'color', selector: cancel },
+      'color-notification-cancel': { property: "", selector: cancel },
       'font-size-notification': { property: 'font-size', selector: notification },
       'line-height-notification': { property: 'line-height', selector: notification },

[Survived] ObjectLiteral
core/shared/notification/Notification.ts:124:33
       'color-notification-info': { property: 'color', selector: info },
       'color-notification-success': { property: 'color', selector: success },
       'color-notification-cancel': { property: 'color', selector: cancel },
-      'font-size-notification': { property: 'font-size', selector: notification },
+      'font-size-notification': {},
       'line-height-notification': { property: 'line-height', selector: notification },
       'space-inset-notification': { property: 'padding', selector: notification },

[Survived] StringLiteral
core/shared/notification/Notification.ts:126:47
       'color-notification-cancel': { property: 'color', selector: cancel },
       'font-size-notification': { property: 'font-size', selector: notification },
       'line-height-notification': { property: 'line-height', selector: notification },
-      'space-inset-notification': { property: 'padding', selector: notification },
+      'space-inset-notification': { property: "", selector: notification },
       'space-inset-notification-error': { property: 'padding', selector: error },
       'space-inset-notification-info': { property: 'padding', selector: info },

[Survived] StringLiteral
core/shared/notification/Notification.ts:127:53
       'font-size-notification': { property: 'font-size', selector: notification },
       'line-height-notification': { property: 'line-height', selector: notification },
       'space-inset-notification': { property: 'padding', selector: notification },
-      'space-inset-notification-error': { property: 'padding', selector: error },
+      'space-inset-notification-error': { property: "", selector: error },
       'space-inset-notification-info': { property: 'padding', selector: info },
       'space-inset-notification-success': { property: 'padding', selector: success },

[Survived] StringLiteral
core/shared/notification/Notification.ts:128:52
       'line-height-notification': { property: 'line-height', selector: notification },
       'space-inset-notification': { property: 'padding', selector: notification },
       'space-inset-notification-error': { property: 'padding', selector: error },
-      'space-inset-notification-info': { property: 'padding', selector: info },
+      'space-inset-notification-info': { property: "", selector: info },
       'space-inset-notification-success': { property: 'padding', selector: success },
       'space-inset-notification-cancel': { property: 'padding', selector: cancel },

[Survived] ObjectLiteral
core/shared/notification/Notification.ts:129:43
       'space-inset-notification': { property: 'padding', selector: notification },
       'space-inset-notification-error': { property: 'padding', selector: error },
       'space-inset-notification-info': { property: 'padding', selector: info },
-      'space-inset-notification-success': { property: 'padding', selector: success },
+      'space-inset-notification-success': {},
       'space-inset-notification-cancel': { property: 'padding', selector: cancel },
       'space-outset-notification': { property: 'margin', selector: notification },

[Survived] ObjectLiteral
core/shared/notification/Notification.ts:130:42
       'space-inset-notification-error': { property: 'padding', selector: error },
       'space-inset-notification-info': { property: 'padding', selector: info },
       'space-inset-notification-success': { property: 'padding', selector: success },
-      'space-inset-notification-cancel': { property: 'padding', selector: cancel },
+      'space-inset-notification-cancel': {},
       'space-outset-notification': { property: 'margin', selector: notification },
       'space-outset-notification-error': { property: 'margin', selector: error },

[Survived] StringLiteral
core/shared/notification/Notification.ts:133:53
       'space-inset-notification-cancel': { property: 'padding', selector: cancel },
       'space-outset-notification': { property: 'margin', selector: notification },
       'space-outset-notification-error': { property: 'margin', selector: error },
-      'space-outset-notification-info': { property: 'margin', selector: info },
+      'space-outset-notification-info': { property: "", selector: info },
       'space-outset-notification-success': { property: 'margin', selector: success },
       'space-outset-notification-cancel': { property: 'margin', selector: cancel }

[Survived] ObjectLiteral
core/shared/notification/Notification.ts:134:44
       'space-outset-notification': { property: 'margin', selector: notification },
       'space-outset-notification-error': { property: 'margin', selector: error },
       'space-outset-notification-info': { property: 'margin', selector: info },
-      'space-outset-notification-success': { property: 'margin', selector: success },
+      'space-outset-notification-success': {},
       'space-outset-notification-cancel': { property: 'margin', selector: cancel }
     };

[Survived] StringLiteral
core/shared/notification/Notification.ts:135:55
       'space-outset-notification-error': { property: 'margin', selector: error },
       'space-outset-notification-info': { property: 'margin', selector: info },
       'space-outset-notification-success': { property: 'margin', selector: success },
-      'space-outset-notification-cancel': { property: 'margin', selector: cancel }
+      'space-outset-notification-cancel': { property: "", selector: cancel }
     };
     return allowed;

[Survived] BlockStatement
core/shared/notification/Notification.ts:140:88
     return allowed;
   }
 
-  private _insertContent(notificationFrameElement: HTMLElement, content: string): void {
-    notificationFrameElement.textContent = this._translator.translate(content);
-  }
+  private _insertContent(notificationFrameElement: HTMLElement, content: string): void {}
 
   private _getMessageClass = (messageType: string): string => this._messageMap.get(messageType.toLowerCase());

[Survived] ArrowFunction
core/shared/notification/Notification.ts:144:30
     notificationFrameElement.textContent = this._translator.translate(content);
   }
 
-  private _getMessageClass = (messageType: string): string => this._messageMap.get(messageType.toLowerCase());
+  private _getMessageClass = () => undefined;
 
   private _setDataNotificationColorAttribute(notificationFrameElement: HTMLElement, messageType: string): void {

[Survived] BlockStatement
core/shared/notification/Notification.ts:146:112
 
   private _getMessageClass = (messageType: string): string => this._messageMap.get(messageType.toLowerCase());
 
-  private _setDataNotificationColorAttribute(notificationFrameElement: HTMLElement, messageType: string): void {
-    switch (messageType) {
-      case NotificationsMessageTypes.error:
-        notificationFrameElement.setAttribute('data-notification-color', 'red');
-        break;
-      case NotificationsMessageTypes.info:
-        notificationFrameElement.setAttribute('data-notification-color', 'grey');
-        break;
-      case NotificationsMessageTypes.success:
-        notificationFrameElement.setAttribute('data-notification-color', 'green');
-        break;
-      case NotificationsMessageTypes.cancel:
-        notificationFrameElement.setAttribute('data-notification-color', 'yellow');
-        break;
-      default:
-        notificationFrameElement.setAttribute('data-notification-color', 'undefined');
-    }
-  }
+  private _setDataNotificationColorAttribute(notificationFrameElement: HTMLElement, messageType: string): void {}
 
   private _setAttributeClass(notificationFrameElement: HTMLElement, type: string): void {

[Survived] ConditionalExpression
core/shared/notification/Notification.ts:148:7
 
   private _setDataNotificationColorAttribute(notificationFrameElement: HTMLElement, messageType: string): void {
     switch (messageType) {
-      case NotificationsMessageTypes.error:
-        notificationFrameElement.setAttribute('data-notification-color', 'red');
-        break;
+      case NotificationsMessageTypes.error:
       case NotificationsMessageTypes.info:
         notificationFrameElement.setAttribute('data-notification-color', 'grey');

[Survived] ConditionalExpression
core/shared/notification/Notification.ts:151:7
       case NotificationsMessageTypes.error:
         notificationFrameElement.setAttribute('data-notification-color', 'red');
         break;
-      case NotificationsMessageTypes.info:
-        notificationFrameElement.setAttribute('data-notification-color', 'grey');
-        break;
+      case NotificationsMessageTypes.info:
       case NotificationsMessageTypes.success:
         notificationFrameElement.setAttribute('data-notification-color', 'green');

[Survived] StringLiteral
core/shared/notification/Notification.ts:152:74
         notificationFrameElement.setAttribute('data-notification-color', 'red');
         break;
       case NotificationsMessageTypes.info:
-        notificationFrameElement.setAttribute('data-notification-color', 'grey');
+        notificationFrameElement.setAttribute('data-notification-color', "");
         break;
       case NotificationsMessageTypes.success:

[Survived] ConditionalExpression
core/shared/notification/Notification.ts:154:7
       case NotificationsMessageTypes.info:
         notificationFrameElement.setAttribute('data-notification-color', 'grey');
         break;
-      case NotificationsMessageTypes.success:
-        notificationFrameElement.setAttribute('data-notification-color', 'green');
-        break;
+      case NotificationsMessageTypes.success:
       case NotificationsMessageTypes.cancel:
         notificationFrameElement.setAttribute('data-notification-color', 'yellow');

[Survived] ConditionalExpression
core/shared/notification/Notification.ts:157:7
       case NotificationsMessageTypes.success:
         notificationFrameElement.setAttribute('data-notification-color', 'green');
         break;
-      case NotificationsMessageTypes.cancel:
-        notificationFrameElement.setAttribute('data-notification-color', 'yellow');
-        break;
+      case NotificationsMessageTypes.cancel:
       default:
         notificationFrameElement.setAttribute('data-notification-color', 'undefined');

[Survived] StringLiteral
core/shared/notification/Notification.ts:158:47
         notificationFrameElement.setAttribute('data-notification-color', 'green');
         break;
       case NotificationsMessageTypes.cancel:
-        notificationFrameElement.setAttribute('data-notification-color', 'yellow');
+        notificationFrameElement.setAttribute("", 'yellow');
         break;
       default:

[Survived] ConditionalExpression
core/shared/notification/Notification.ts:160:7
       case NotificationsMessageTypes.cancel:
         notificationFrameElement.setAttribute('data-notification-color', 'yellow');
         break;
-      default:
-        notificationFrameElement.setAttribute('data-notification-color', 'undefined');
+      default:
     }
   }

[Survived] BlockStatement
core/shared/notification/Notification.ts:165:89
     }
   }
 
-  private _setAttributeClass(notificationFrameElement: HTMLElement, type: string): void {
-    const notificationElementClass = this._getMessageClass(type);
-    notificationFrameElement.classList.add(NOTIFICATION_FRAME_CORE_CLASS);
-    if (notificationElementClass) {
-      notificationFrameElement.classList.remove(...Object.values(NotificationsClasses));
-      notificationFrameElement.classList.add(notificationElementClass);
-      this._setDataNotificationColorAttribute(notificationFrameElement, type);
-      if (type === NotificationsMessageTypes.success) {
-        window.clearTimeout(this._timeoutId);
-        return;
-      }
-      this._timeoutId = window.setTimeout(() => {
-        notificationFrameElement.classList.remove(notificationElementClass);
-        notificationFrameElement.classList.remove(NOTIFICATION_FRAME_CORE_CLASS);
-        this._insertContent(notificationFrameElement, '');
-      }, environment.NOTIFICATION_TTL);
-    }
-  }
+  private _setAttributeClass(notificationFrameElement: HTMLElement, type: string): void {}
 
   private _displayNotification(data: INotificationEvent): void {

[Survived] ConditionalExpression
core/shared/notification/Notification.ts:168:9
   private _setAttributeClass(notificationFrameElement: HTMLElement, type: string): void {
     const notificationElementClass = this._getMessageClass(type);
     notificationFrameElement.classList.add(NOTIFICATION_FRAME_CORE_CLASS);
-    if (notificationElementClass) {
+    if (false) {
       notificationFrameElement.classList.remove(...Object.values(NotificationsClasses));
       notificationFrameElement.classList.add(notificationElementClass);

[Survived] BlockStatement
core/shared/notification/Notification.ts:168:35
   private _setAttributeClass(notificationFrameElement: HTMLElement, type: string): void {
     const notificationElementClass = this._getMessageClass(type);
     notificationFrameElement.classList.add(NOTIFICATION_FRAME_CORE_CLASS);
-    if (notificationElementClass) {
-      notificationFrameElement.classList.remove(...Object.values(NotificationsClasses));
-      notificationFrameElement.classList.add(notificationElementClass);
-      this._setDataNotificationColorAttribute(notificationFrameElement, type);
-      if (type === NotificationsMessageTypes.success) {
-        window.clearTimeout(this._timeoutId);
-        return;
-      }
-      this._timeoutId = window.setTimeout(() => {
-        notificationFrameElement.classList.remove(notificationElementClass);
-        notificationFrameElement.classList.remove(NOTIFICATION_FRAME_CORE_CLASS);
-        this._insertContent(notificationFrameElement, '');
-      }, environment.NOTIFICATION_TTL);
-    }
+    if (notificationElementClass) {}
   }
 

[Survived] ConditionalExpression
core/shared/notification/Notification.ts:172:11
       notificationFrameElement.classList.remove(...Object.values(NotificationsClasses));
       notificationFrameElement.classList.add(notificationElementClass);
       this._setDataNotificationColorAttribute(notificationFrameElement, type);
-      if (type === NotificationsMessageTypes.success) {
+      if (false) {
         window.clearTimeout(this._timeoutId);
         return;

[Survived] EqualityOperator
core/shared/notification/Notification.ts:172:11
       notificationFrameElement.classList.remove(...Object.values(NotificationsClasses));
       notificationFrameElement.classList.add(notificationElementClass);
       this._setDataNotificationColorAttribute(notificationFrameElement, type);
-      if (type === NotificationsMessageTypes.success) {
+      if (type !== NotificationsMessageTypes.success) {
         window.clearTimeout(this._timeoutId);
         return;
