[Survived] BlockStatement
core/shared/notification/Notification.ts:176:49
         window.clearTimeout(this._timeoutId);
         return;
       }
-      this._timeoutId = window.setTimeout(() => {
-        notificationFrameElement.classList.remove(notificationElementClass);
-        notificationFrameElement.classList.remove(NOTIFICATION_FRAME_CORE_CLASS);
-        this._insertContent(notificationFrameElement, '');
-      }, environment.NOTIFICATION_TTL);
+      this._timeoutId = window.setTimeout(() => {}, environment.NOTIFICATION_TTL);
     }
   }

[Survived] StringLiteral
core/shared/notification/Notification.ts:179:55
       this._timeoutId = window.setTimeout(() => {
         notificationFrameElement.classList.remove(notificationElementClass);
         notificationFrameElement.classList.remove(NOTIFICATION_FRAME_CORE_CLASS);
-        this._insertContent(notificationFrameElement, '');
+        this._insertContent(notificationFrameElement, "Stryker was here!");
       }, environment.NOTIFICATION_TTL);
     }

[Survived] BlockStatement
core/shared/notification/Notification.ts:184:64
     }
   }
 
-  private _displayNotification(data: INotificationEvent): void {
-    const { content, type } = data;
-    const notificationFrameElement = document.getElementById(
-      this._configProvider.getConfig().componentIds.notificationFrame
-    );
-
-    if (!notificationFrameElement) {
-      return;
-    }
-
-    this._insertContent(notificationFrameElement, content);
-    this._setAttributeClass(notificationFrameElement, type);
-  }
+  private _displayNotification(data: INotificationEvent): void {}
 }
 

[Survived] BooleanLiteral
core/shared/notification/Notification.ts:190:9
       this._configProvider.getConfig().componentIds.notificationFrame
     );
 
-    if (!notificationFrameElement) {
+    if (notificationFrameElement) {
       return;
     }

[Survived] BlockStatement
core/shared/notification/Notification.ts:190:36
       this._configProvider.getConfig().componentIds.notificationFrame
     );
 
-    if (!notificationFrameElement) {
-      return;
-    }
+    if (!notificationFrameElement) {}
 
     this._insertContent(notificationFrameElement, content);
