[Survived] BlockStatement
core/shared/on-input-wrapper/onInputWrapper.ts:5:64
  * This wrapper disables the "input" event being fired when placeholder changes on IE
  * @link https://stackoverflow.com/a/57607005
  */
-export function onInputWraper(cb: (event: InputEvent) => void) {
-  if (!window.navigator.userAgent.match(/MSIE|Trident/)) return cb;
-
-  return (e: InputEvent) => {
-    const t = e.target as (HTMLInputElement | HTMLTextAreaElement) & { composition_started: boolean };
-    const active = t === document.activeElement;
-    if (!active || (t.placeholder && t.composition_started !== true)) {
-      t.composition_started = active;
-      if ((!active && t.tagName === 'TEXTAREA') || t.tagName === 'INPUT') {
-        e.stopPropagation();
-        e.preventDefault();
-
-        return false;
-      }
-    }
-    cb(e);
-  };
-}
+export function onInputWraper(cb: (event: InputEvent) => void) {}
 

[Survived] ConditionalExpression
core/shared/on-input-wrapper/onInputWrapper.ts:6:7
  * @link https://stackoverflow.com/a/57607005
  */
 export function onInputWraper(cb: (event: InputEvent) => void) {
-  if (!window.navigator.userAgent.match(/MSIE|Trident/)) return cb;
+  if (false) return cb;
 
   return (e: InputEvent) => {

[Survived] BooleanLiteral
core/shared/on-input-wrapper/onInputWrapper.ts:6:7
  * @link https://stackoverflow.com/a/57607005
  */
 export function onInputWraper(cb: (event: InputEvent) => void) {
-  if (!window.navigator.userAgent.match(/MSIE|Trident/)) return cb;
+  if (window.navigator.userAgent.match(/MSIE|Trident/)) return cb;
 
   return (e: InputEvent) => {

[Survived] BlockStatement
core/shared/on-input-wrapper/onInputWrapper.ts:8:29
 export function onInputWraper(cb: (event: InputEvent) => void) {
   if (!window.navigator.userAgent.match(/MSIE|Trident/)) return cb;
 
-  return (e: InputEvent) => {
-    const t = e.target as (HTMLInputElement | HTMLTextAreaElement) & { composition_started: boolean };
-    const active = t === document.activeElement;
-    if (!active || (t.placeholder && t.composition_started !== true)) {
-      t.composition_started = active;
-      if ((!active && t.tagName === 'TEXTAREA') || t.tagName === 'INPUT') {
-        e.stopPropagation();
-        e.preventDefault();
-
-        return false;
-      }
-    }
-    cb(e);
-  };
+  return (e: InputEvent) => {};
 }
 

[Survived] ConditionalExpression
core/shared/on-input-wrapper/onInputWrapper.ts:10:20
 
   return (e: InputEvent) => {
     const t = e.target as (HTMLInputElement | HTMLTextAreaElement) & { composition_started: boolean };
-    const active = t === document.activeElement;
+    const active = true;
     if (!active || (t.placeholder && t.composition_started !== true)) {
       t.composition_started = active;

[Survived] EqualityOperator
core/shared/on-input-wrapper/onInputWrapper.ts:10:20
 
   return (e: InputEvent) => {
     const t = e.target as (HTMLInputElement | HTMLTextAreaElement) & { composition_started: boolean };
-    const active = t === document.activeElement;
+    const active = t !== document.activeElement;
     if (!active || (t.placeholder && t.composition_started !== true)) {
       t.composition_started = active;

[Survived] ConditionalExpression
core/shared/on-input-wrapper/onInputWrapper.ts:11:38
   return (e: InputEvent) => {
     const t = e.target as (HTMLInputElement | HTMLTextAreaElement) & { composition_started: boolean };
     const active = t === document.activeElement;
-    if (!active || (t.placeholder && t.composition_started !== true)) {
+    if (!active || (t.placeholder && true)) {
       t.composition_started = active;
       if ((!active && t.tagName === 'TEXTAREA') || t.tagName === 'INPUT') {

[Survived] ConditionalExpression
core/shared/on-input-wrapper/onInputWrapper.ts:11:9
   return (e: InputEvent) => {
     const t = e.target as (HTMLInputElement | HTMLTextAreaElement) & { composition_started: boolean };
     const active = t === document.activeElement;
-    if (!active || (t.placeholder && t.composition_started !== true)) {
+    if (false) {
       t.composition_started = active;
       if ((!active && t.tagName === 'TEXTAREA') || t.tagName === 'INPUT') {

[Survived] ConditionalExpression
core/shared/on-input-wrapper/onInputWrapper.ts:13:23
     const active = t === document.activeElement;
     if (!active || (t.placeholder && t.composition_started !== true)) {
       t.composition_started = active;
-      if ((!active && t.tagName === 'TEXTAREA') || t.tagName === 'INPUT') {
+      if ((!active && true) || t.tagName === 'INPUT') {
         e.stopPropagation();
         e.preventDefault();

[Survived] LogicalOperator
core/shared/on-input-wrapper/onInputWrapper.ts:13:11
     const active = t === document.activeElement;
     if (!active || (t.placeholder && t.composition_started !== true)) {
       t.composition_started = active;
-      if ((!active && t.tagName === 'TEXTAREA') || t.tagName === 'INPUT') {
+      if (!active && t.tagName === 'TEXTAREA' && t.tagName === 'INPUT') {
         e.stopPropagation();
         e.preventDefault();
