[Survived] BlockStatement
core/shared/override-domain/OverrideDomain.ts:3:33
 import { environment } from '../../../../environments/environment';
 
-if (environment.overrideDomain) {
-  document.domain = environment.overrideDomain;
-}
+if (environment.overrideDomain) {}
 

[Survived] ConditionalExpression
core/shared/override-domain/OverrideDomain.ts:3:5
 import { environment } from '../../../../environments/environment';
 
-if (environment.overrideDomain) {
+if (true) {
   document.domain = environment.overrideDomain;
 }
