[Survived] BlockStatement
core/shared/payment/Payment.ts:22:17
   private _cybertonica: Cybertonica;
   private readonly _walletVerifyRequest: IStRequest;
 
-  constructor() {
-    this._notification = Container.get(NotificationService);
-    this._cybertonica = Container.get(Cybertonica);
-    this._stTransport = Container.get(StTransport);
-    this._validation = new Validation();
-    this._walletVerifyRequest = {
-      requesttypedescriptions: ['WALLETVERIFY']
-    };
-  }
+  constructor() {}
 
   public setCardinalCommerceCacheToken(cachetoken: string) {

[Survived] ObjectLiteral
core/shared/payment/Payment.ts:27:33
     this._cybertonica = Container.get(Cybertonica);
     this._stTransport = Container.get(StTransport);
     this._validation = new Validation();
-    this._walletVerifyRequest = {
-      requesttypedescriptions: ['WALLETVERIFY']
-    };
+    this._walletVerifyRequest = {};
   }
 

[Survived] BlockStatement
core/shared/payment/Payment.ts:32:60
     };
   }
 
-  public setCardinalCommerceCacheToken(cachetoken: string) {
-    this._cardinalCommerceCacheToken = cachetoken;
-  }
+  public setCardinalCommerceCacheToken(cachetoken: string) {}
 
   public async processPayment(

[Survived] ConditionalExpression
core/shared/payment/Payment.ts:42:9
     merchantData: IMerchantData,
     additionalData?: any
   ): Promise<object> {
-    if (requestTypes.length === 0) {
+    if (true) {
       // This should only happen if were processing a 3DS payment with no requests after the THREEDQUERY
       const responseData = {

[Survived] EqualityOperator
core/shared/payment/Payment.ts:42:9
     merchantData: IMerchantData,
     additionalData?: any
   ): Promise<object> {
-    if (requestTypes.length === 0) {
+    if (requestTypes.length !== 0) {
       // This should only happen if were processing a 3DS payment with no requests after the THREEDQUERY
       const responseData = {

[Survived] BooleanLiteral
core/shared/payment/Payment.ts:46:20
       // This should only happen if were processing a 3DS payment with no requests after the THREEDQUERY
       const responseData = {
         ...this._stTransport._threeDQueryResult.response,
-        validated: true
+        validated: false
       };
 

[Survived] ConditionalExpression
core/shared/payment/Payment.ts:64:9
     };
     const cybertonicaTid = await this._cybertonica.getTransactionId();
 
-    if (cybertonicaTid) {
+    if (false) {
       (processPaymentRequestBody as any).fraudcontroltransactionid = cybertonicaTid;
     }

[Survived] BlockStatement
core/shared/payment/Payment.ts:64:25
     };
     const cybertonicaTid = await this._cybertonica.getTransactionId();
 
-    if (cybertonicaTid) {
-      (processPaymentRequestBody as any).fraudcontroltransactionid = cybertonicaTid;
-    }
+    if (cybertonicaTid) {}
 
     return this._stTransport.sendRequest(processPaymentRequestBody);

[Survived] BlockStatement
core/shared/payment/Payment.ts:71:52
     return this._stTransport.sendRequest(processPaymentRequestBody);
   }
 
-  public walletVerify(walletVerify: IWalletVerify) {
-    Object.assign(this._walletVerifyRequest, walletVerify);
-    return this._stTransport.sendRequest(this._walletVerifyRequest);
-  }
+  public walletVerify(walletVerify: IWalletVerify) {}
 }
 
