[Survived] BlockStatement
core/shared/styler/Styler.ts:12:60
 
 @Service()
 export class Styler {
-  private static _getTagStyles(styles: ISubStyles): string {
-    const results = [];
-    // tslint:disable-next-line:forin
-    for (const style in styles) {
-      results.push(`${style}: ${styles[style]};`);
-    }
-    return results.join(' ');
-  }
+  private static _getTagStyles(styles: ISubStyles): string {}
 
   private _frame: Frame;

[Survived] BlockStatement
core/shared/styler/Styler.ts:15:33
   private static _getTagStyles(styles: ISubStyles): string {
     const results = [];
     // tslint:disable-next-line:forin
-    for (const style in styles) {
-      results.push(`${style}: ${styles[style]};`);
-    }
+    for (const style in styles) {}
     return results.join(' ');
   }

[Survived] StringLiteral
core/shared/styler/Styler.ts:18:25
     for (const style in styles) {
       results.push(`${style}: ${styles[style]};`);
     }
-    return results.join(' ');
+    return results.join("");
   }
 

[Survived] BlockStatement
core/shared/styler/Styler.ts:24:59
   private _frame: Frame;
   private readonly _allowed: IAllowedStyles;
 
-  constructor(allowed: IAllowedStyles, styles: IStyles[]) {
-    this._frame = Container.get(Frame);
-    this._allowed = allowed;
-    this.inject(styles);
-  }
+  constructor(allowed: IAllowedStyles, styles: IStyles[]) {}
 
   public inject(styles: IStyles[]): void {

[Survived] BlockStatement
core/shared/styler/Styler.ts:30:42
     this.inject(styles);
   }
 
-  public inject(styles: IStyles[]): void {
-    DomMethods.insertStyle(this._getStyleString(styles));
-  }
+  public inject(styles: IStyles[]): void {}
 
   public isLinedUp(styles: IStyle): boolean {

[Survived] BlockStatement
core/shared/styler/Styler.ts:34:45
     DomMethods.insertStyle(this._getStyleString(styles));
   }
 
-  public isLinedUp(styles: IStyle): boolean {
-    // tslint:disable-next-line:forin
-    for (const style in styles) {
-      if (style === 'isLinedUp' && styles[style] === 'true') {
-        return true;
-      }
-    }
-    return false;
-  }
+  public isLinedUp(styles: IStyle): boolean {}
 
   public lineUp(wrapperId: string, labelId: string, wrapperClassList: string[], labelClassList: string[]): void {

[Survived] BlockStatement
core/shared/styler/Styler.ts:36:33
 
   public isLinedUp(styles: IStyle): boolean {
     // tslint:disable-next-line:forin
-    for (const style in styles) {
-      if (style === 'isLinedUp' && styles[style] === 'true') {
-        return true;
-      }
-    }
+    for (const style in styles) {}
     return false;
   }

[Survived] ConditionalExpression
core/shared/styler/Styler.ts:37:36
   public isLinedUp(styles: IStyle): boolean {
     // tslint:disable-next-line:forin
     for (const style in styles) {
-      if (style === 'isLinedUp' && styles[style] === 'true') {
+      if (style === 'isLinedUp' && false) {
         return true;
       }

[Survived] EqualityOperator
core/shared/styler/Styler.ts:37:11
   public isLinedUp(styles: IStyle): boolean {
     // tslint:disable-next-line:forin
     for (const style in styles) {
-      if (style === 'isLinedUp' && styles[style] === 'true') {
+      if (style !== 'isLinedUp' && styles[style] === 'true') {
         return true;
       }

[Survived] BooleanLiteral
core/shared/styler/Styler.ts:38:16
     // tslint:disable-next-line:forin
     for (const style in styles) {
       if (style === 'isLinedUp' && styles[style] === 'true') {
-        return true;
+        return false;
       }
     }

[Survived] BlockStatement
core/shared/styler/Styler.ts:44:113
     return false;
   }
 
-  public lineUp(wrapperId: string, labelId: string, wrapperClassList: string[], labelClassList: string[]): void {
-    const wrapper = document.getElementById(wrapperId);
-    const label = document.getElementById(labelId);
-    wrapper.className = '';
-    label.className = '';
-    wrapperClassList.forEach(className => wrapper.classList.add(className));
-    labelClassList.forEach(className => label.classList.add(className));
-  }
+  public lineUp(wrapperId: string, labelId: string, wrapperClassList: string[], labelClassList: string[]): void {}
 
   private _filter(styles: IStyles[]): IStyle {

[Survived] ArrowFunction
core/shared/styler/Styler.ts:49:30
     const label = document.getElementById(labelId);
     wrapper.className = '';
     label.className = '';
-    wrapperClassList.forEach(className => wrapper.classList.add(className));
+    wrapperClassList.forEach(() => undefined);
     labelClassList.forEach(className => label.classList.add(className));
   }

[Survived] ArrowFunction
core/shared/styler/Styler.ts:50:28
     wrapper.className = '';
     label.className = '';
     wrapperClassList.forEach(className => wrapper.classList.add(className));
-    labelClassList.forEach(className => label.classList.add(className));
+    labelClassList.forEach(() => undefined);
   }
 

[Survived] BlockStatement
core/shared/styler/Styler.ts:53:46
     labelClassList.forEach(className => label.classList.add(className));
   }
 
-  private _filter(styles: IStyles[]): IStyle {
-    const filtered: IStyle = {};
-    // tslint:disable-next-line:forin
-    styles.forEach((style: IStyle, index) => {
-      const propName: string = Object.keys(style)[0];
-      if (this._allowed.hasOwnProperty(propName)) {
-        // @ts-ignore
-        filtered[propName] = styles[index][propName];
-      }
-    });
-    return filtered;
-  }
+  private _filter(styles: IStyles[]): IStyle {}
 
   private _sanitize(styles: IStyle): IStyle {

[Survived] BlockStatement
core/shared/styler/Styler.ts:56:46
   private _filter(styles: IStyles[]): IStyle {
     const filtered: IStyle = {};
     // tslint:disable-next-line:forin
-    styles.forEach((style: IStyle, index) => {
-      const propName: string = Object.keys(style)[0];
-      if (this._allowed.hasOwnProperty(propName)) {
-        // @ts-ignore
-        filtered[propName] = styles[index][propName];
-      }
-    });
+    styles.forEach((style: IStyle, index) => {});
     return filtered;
   }

[Survived] ConditionalExpression
core/shared/styler/Styler.ts:58:11
     // tslint:disable-next-line:forin
     styles.forEach((style: IStyle, index) => {
       const propName: string = Object.keys(style)[0];
-      if (this._allowed.hasOwnProperty(propName)) {
+      if (false) {
         // @ts-ignore
         filtered[propName] = styles[index][propName];

[Survived] BlockStatement
core/shared/styler/Styler.ts:58:51
     // tslint:disable-next-line:forin
     styles.forEach((style: IStyle, index) => {
       const propName: string = Object.keys(style)[0];
-      if (this._allowed.hasOwnProperty(propName)) {
-        // @ts-ignore
-        filtered[propName] = styles[index][propName];
-      }
+      if (this._allowed.hasOwnProperty(propName)) {}
     });
     return filtered;

[Survived] BlockStatement
core/shared/styler/Styler.ts:66:45
     return filtered;
   }
 
-  private _sanitize(styles: IStyle): IStyle {
-    const sanitized: IStyle = {};
-    // tslint:disable-next-line:forin
-    for (const style in styles) {
-      if (/^[A-Za-z0-9 _%#)(,.-]*[A-Za-z0-9][A-Za-z0-9 _%#)(,.-]*$/i.test(styles[style])) {
-        sanitized[style] = styles[style];
-      }
-    }
-    return sanitized;
-  }
+  private _sanitize(styles: IStyle): IStyle {}
 
   private _group(styles: IStyle): IGroupedStyles {

[Survived] BlockStatement
core/shared/styler/Styler.ts:69:33
   private _sanitize(styles: IStyle): IStyle {
     const sanitized: IStyle = {};
     // tslint:disable-next-line:forin
-    for (const style in styles) {
-      if (/^[A-Za-z0-9 _%#)(,.-]*[A-Za-z0-9][A-Za-z0-9 _%#)(,.-]*$/i.test(styles[style])) {
-        sanitized[style] = styles[style];
-      }
-    }
+    for (const style in styles) {}
     return sanitized;
   }

[Survived] ConditionalExpression
core/shared/styler/Styler.ts:70:11
     const sanitized: IStyle = {};
     // tslint:disable-next-line:forin
     for (const style in styles) {
-      if (/^[A-Za-z0-9 _%#)(,.-]*[A-Za-z0-9][A-Za-z0-9 _%#)(,.-]*$/i.test(styles[style])) {
+      if (true) {
         sanitized[style] = styles[style];
       }

[Survived] BlockStatement
core/shared/styler/Styler.ts:70:91
     const sanitized: IStyle = {};
     // tslint:disable-next-line:forin
     for (const style in styles) {
-      if (/^[A-Za-z0-9 _%#)(,.-]*[A-Za-z0-9][A-Za-z0-9 _%#)(,.-]*$/i.test(styles[style])) {
-        sanitized[style] = styles[style];
-      }
+      if (/^[A-Za-z0-9 _%#)(,.-]*[A-Za-z0-9][A-Za-z0-9 _%#)(,.-]*$/i.test(styles[style])) {}
     }
     return sanitized;

[Survived] BlockStatement
core/shared/styler/Styler.ts:77:50
     return sanitized;
   }
 
-  private _group(styles: IStyle): IGroupedStyles {
-    const grouped: IGroupedStyles = {};
-    // tslint:disable-next-line:forin
-    for (const style in styles) {
-      const allowed = this._allowed[style];
-      if (!grouped.hasOwnProperty(allowed.selector)) {
-        grouped[allowed.selector] = {};
-      }
-      grouped[allowed.selector][allowed.property] = styles[style];
-    }
-    return grouped;
-  }
+  private _group(styles: IStyle): IGroupedStyles {}
 
   private _getStyleString(styles: IStyles[]): string[] {

[Survived] BlockStatement
core/shared/styler/Styler.ts:80:33
   private _group(styles: IStyle): IGroupedStyles {
     const grouped: IGroupedStyles = {};
     // tslint:disable-next-line:forin
-    for (const style in styles) {
-      const allowed = this._allowed[style];
-      if (!grouped.hasOwnProperty(allowed.selector)) {
-        grouped[allowed.selector] = {};
-      }
-      grouped[allowed.selector][allowed.property] = styles[style];
-    }
+    for (const style in styles) {}
     return grouped;
   }

[Survived] BlockStatement
core/shared/styler/Styler.ts:82:54
     // tslint:disable-next-line:forin
     for (const style in styles) {
       const allowed = this._allowed[style];
-      if (!grouped.hasOwnProperty(allowed.selector)) {
-        grouped[allowed.selector] = {};
-      }
+      if (!grouped.hasOwnProperty(allowed.selector)) {}
       grouped[allowed.selector][allowed.property] = styles[style];
     }

[Survived] BooleanLiteral
core/shared/styler/Styler.ts:82:11
     // tslint:disable-next-line:forin
     for (const style in styles) {
       const allowed = this._allowed[style];
-      if (!grouped.hasOwnProperty(allowed.selector)) {
+      if (grouped.hasOwnProperty(allowed.selector)) {
         grouped[allowed.selector] = {};
       }

[Survived] BlockStatement
core/shared/styler/Styler.ts:90:56
     return grouped;
   }
 
-  private _getStyleString(styles: IStyles[]): string[] {
-    let groupedStyles: IGroupedStyles;
-    let styled: IStyle;
-    let tag: string;
-    const templates: string[] = [`body { display: block; }`];
-    styled = this._filter(styles);
-    styled = this._sanitize(styled);
-    groupedStyles = this._group(styled);
-    // tslint:disable-next-line:forin
-    for (tag in groupedStyles) {
-      const tagStyle = Styler._getTagStyles(groupedStyles[tag]);
-      templates.push(`${tag} { ${tagStyle} }`);
-    }
-    return templates;
-  }
+  private _getStyleString(styles: IStyles[]): string[] {}
 }
 

[Survived] StringLiteral
core/shared/styler/Styler.ts:94:34
     let groupedStyles: IGroupedStyles;
     let styled: IStyle;
     let tag: string;
-    const templates: string[] = [`body { display: block; }`];
+    const templates: string[] = [``];
     styled = this._filter(styles);
     styled = this._sanitize(styled);

[Survived] BlockStatement
core/shared/styler/Styler.ts:99:32
     styled = this._sanitize(styled);
     groupedStyles = this._group(styled);
     // tslint:disable-next-line:forin
-    for (tag in groupedStyles) {
-      const tagStyle = Styler._getTagStyles(groupedStyles[tag]);
-      templates.push(`${tag} { ${tagStyle} }`);
-    }
+    for (tag in groupedStyles) {}
     return templates;
   }
