[Survived] BlockStatement
core/shared/translator/Translator.ts:28:31
 export class Translator {
   private _storage: BrowserLocalStorage = Container.get(BrowserLocalStorage);
 
-  constructor(locale: string) {
-    i18next.init({
-      debug: false,
-      lng: locale,
-      resources: {
-        cy_GB: { translation: cy_GB },
-        da_DK: { translation: da_DK },
-        de_DE: { translation: de_DE },
-        en_GB: { translation: en_GB },
-        en_US: { translation: en_US },
-        es_ES: { translation: es_ES },
-        fr_FR: { translation: fr_FR },
-        nl_NL: { translation: nl_NL },
-        no_NO: { translation: no_NO },
-        sv_SE: { translation: sv_SE }
-      }
-    });
-  }
+  constructor(locale: string) {}
 
   public translate = (text: string) => {

[Survived] BooleanLiteral
core/shared/translator/Translator.ts:30:14
 
   constructor(locale: string) {
     i18next.init({
-      debug: false,
+      debug: true,
       lng: locale,
       resources: {

[Survived] ObjectLiteral
core/shared/translator/Translator.ts:33:16
       debug: false,
       lng: locale,
       resources: {
-        cy_GB: { translation: cy_GB },
+        cy_GB: {},
         da_DK: { translation: da_DK },
         de_DE: { translation: de_DE },

[Survived] ObjectLiteral
core/shared/translator/Translator.ts:35:16
       resources: {
         cy_GB: { translation: cy_GB },
         da_DK: { translation: da_DK },
-        de_DE: { translation: de_DE },
+        de_DE: {},
         en_GB: { translation: en_GB },
         en_US: { translation: en_US },

[Survived] ObjectLiteral
core/shared/translator/Translator.ts:38:16
         de_DE: { translation: de_DE },
         en_GB: { translation: en_GB },
         en_US: { translation: en_US },
-        es_ES: { translation: es_ES },
+        es_ES: {},
         fr_FR: { translation: fr_FR },
         nl_NL: { translation: nl_NL },

[Survived] ObjectLiteral
core/shared/translator/Translator.ts:40:16
         en_US: { translation: en_US },
         es_ES: { translation: es_ES },
         fr_FR: { translation: fr_FR },
-        nl_NL: { translation: nl_NL },
+        nl_NL: {},
         no_NO: { translation: no_NO },
         sv_SE: { translation: sv_SE }

[Survived] BlockStatement
core/shared/translator/Translator.ts:47:40
     });
   }
 
-  public translate = (text: string) => {
-    let json: object;
-
-    try {
-      const translations: string = this._storage.getItem('merchantTranslations');
-      json = translations ? JSON.parse(translations) : {};
-    } catch (e) {
-      json = {};
-    }
-
-    // @ts-ignore
-    const translation: string = Object.keys(json).includes(text) ? json[text] : '';
-    return translation ? translation : i18next.t(text, { content: text });
-  };
+  public translate = (text: string) => {};
 
   changeLanguage(language: string): void {

[Survived] BlockStatement
core/shared/translator/Translator.ts:50:9
   public translate = (text: string) => {
     let json: object;
 
-    try {
-      const translations: string = this._storage.getItem('merchantTranslations');
-      json = translations ? JSON.parse(translations) : {};
-    } catch (e) {
+    try {} catch (e) {
       json = {};
     }

[Survived] BlockStatement
core/shared/translator/Translator.ts:53:17
     try {
       const translations: string = this._storage.getItem('merchantTranslations');
       json = translations ? JSON.parse(translations) : {};
-    } catch (e) {
-      json = {};
-    }
+    } catch (e) {}
 
     // @ts-ignore

[Survived] BlockStatement
core/shared/translator/Translator.ts:62:42
     return translation ? translation : i18next.t(text, { content: text });
   };
 
-  changeLanguage(language: string): void {
-    i18next.changeLanguage(language);
-  }
+  changeLanguage(language: string): void {}
 }
 
