[Survived] BlockStatement
core/shared/utils/Utils.ts:2:58
 export class Utils {
-  public static inArray<T>(array: ArrayLike<T>, item: T) {
-    return Array.from(array).indexOf(item) >= 0;
-  }
+  public static inArray<T>(array: ArrayLike<T>, item: T) {}
 
   public static forEachBreak<inputType, returnType>(

[Survived] EqualityOperator
core/shared/utils/Utils.ts:3:12
 export class Utils {
   public static inArray<T>(array: ArrayLike<T>, item: T) {
-    return Array.from(array).indexOf(item) >= 0;
+    return Array.from(array).indexOf(item) < 0;
   }
 

[Survived] ConditionalExpression
core/shared/utils/Utils.ts:3:12
 export class Utils {
   public static inArray<T>(array: ArrayLike<T>, item: T) {
-    return Array.from(array).indexOf(item) >= 0;
+    return false;
   }
 

[Survived] BlockStatement
core/shared/utils/Utils.ts:9:17
   public static forEachBreak<inputType, returnType>(
     iterable: ArrayLike<inputType>,
     callback: (item: inputType) => returnType
-  ): returnType {
-    let result: returnType = null;
-    // tslint:disable-next-line:forin
-    for (const i in iterable) {
-      result = callback(iterable[i]);
-      if (result) {
-        break;
-      }
-    }
-    return result || null;
-  }
+  ): returnType {}
 
   public static timeoutPromise(timeout: number, err = new Error()): Promise<never> {

[Survived] BlockStatement
core/shared/utils/Utils.ts:12:31
   ): returnType {
     let result: returnType = null;
     // tslint:disable-next-line:forin
-    for (const i in iterable) {
-      result = callback(iterable[i]);
-      if (result) {
-        break;
-      }
-    }
+    for (const i in iterable) {}
     return result || null;
   }

[Survived] ConditionalExpression
core/shared/utils/Utils.ts:14:11
     // tslint:disable-next-line:forin
     for (const i in iterable) {
       result = callback(iterable[i]);
-      if (result) {
+      if (true) {
         break;
       }

[Survived] ConditionalExpression
core/shared/utils/Utils.ts:14:11
     // tslint:disable-next-line:forin
     for (const i in iterable) {
       result = callback(iterable[i]);
-      if (result) {
+      if (false) {
         break;
       }

[Survived] LogicalOperator
core/shared/utils/Utils.ts:18:12
         break;
       }
     }
-    return result || null;
+    return result && null;
   }
 

[Survived] ConditionalExpression
core/shared/utils/Utils.ts:18:12
         break;
       }
     }
-    return result || null;
+    return true;
   }
 

[Survived] BlockStatement
core/shared/utils/Utils.ts:21:84
     return result || null;
   }
 
-  public static timeoutPromise(timeout: number, err = new Error()): Promise<never> {
-    return new Promise((_, reject) => setTimeout(() => reject(err), timeout));
-  }
+  public static timeoutPromise(timeout: number, err = new Error()): Promise<never> {}
 
   public static promiseWithTimeout<T>(promissory: () => Promise<T>, timeout = 10, err = new Error()): Promise<T> {

[Survived] ArrowFunction
core/shared/utils/Utils.ts:22:24
   }
 
   public static timeoutPromise(timeout: number, err = new Error()): Promise<never> {
-    return new Promise((_, reject) => setTimeout(() => reject(err), timeout));
+    return new Promise(() => undefined);
   }
 

[Survived] ArrowFunction
core/shared/utils/Utils.ts:22:50
   }
 
   public static timeoutPromise(timeout: number, err = new Error()): Promise<never> {
-    return new Promise((_, reject) => setTimeout(() => reject(err), timeout));
+    return new Promise((_, reject) => setTimeout(() => undefined, timeout));
   }
 

[Survived] BlockStatement
core/shared/utils/Utils.ts:25:114
     return new Promise((_, reject) => setTimeout(() => reject(err), timeout));
   }
 
-  public static promiseWithTimeout<T>(promissory: () => Promise<T>, timeout = 10, err = new Error()): Promise<T> {
-    return Promise.race([promissory(), Utils.timeoutPromise(timeout, err)]);
-  }
+  public static promiseWithTimeout<T>(promissory: () => Promise<T>, timeout = 10, err = new Error()): Promise<T> {}
 
   public static retryPromise<T>(promissory: () => Promise<T>, delay = 0, retries = 5, retryTimeout = 100): Promise<T> {

[Survived] BlockStatement
core/shared/utils/Utils.ts:29:119
     return Promise.race([promissory(), Utils.timeoutPromise(timeout, err)]);
   }
 
-  public static retryPromise<T>(promissory: () => Promise<T>, delay = 0, retries = 5, retryTimeout = 100): Promise<T> {
-    return new Promise((resolve, reject) => {
-      const endtime = Date.now() + retryTimeout;
-      let error: Error;
-
-      function attempt() {
-        if (retries > 0 && Date.now() < endtime) {
-          promissory()
-            .then(resolve)
-            .catch(e => {
-              retries--;
-              error = e;
-              setTimeout(() => attempt(), delay);
-            });
-        } else {
-          reject(error);
-        }
-      }
-
-      attempt();
-    });
-  }
+  public static retryPromise<T>(promissory: () => Promise<T>, delay = 0, retries = 5, retryTimeout = 100): Promise<T> {}
 
   public static stripChars(string: string, regex: any) {

[Survived] BlockStatement
core/shared/utils/Utils.ts:30:45
   }
 
   public static retryPromise<T>(promissory: () => Promise<T>, delay = 0, retries = 5, retryTimeout = 100): Promise<T> {
-    return new Promise((resolve, reject) => {
-      const endtime = Date.now() + retryTimeout;
-      let error: Error;
-
-      function attempt() {
-        if (retries > 0 && Date.now() < endtime) {
-          promissory()
-            .then(resolve)
-            .catch(e => {
-              retries--;
-              error = e;
-              setTimeout(() => attempt(), delay);
-            });
-        } else {
-          reject(error);
-        }
-      }
-
-      attempt();
-    });
+    return new Promise((resolve, reject) => {});
   }
 

[Survived] ArithmeticOperator
core/shared/utils/Utils.ts:31:23
 
   public static retryPromise<T>(promissory: () => Promise<T>, delay = 0, retries = 5, retryTimeout = 100): Promise<T> {
     return new Promise((resolve, reject) => {
-      const endtime = Date.now() + retryTimeout;
+      const endtime = Date.now() - retryTimeout;
       let error: Error;
 

[Survived] BlockStatement
core/shared/utils/Utils.ts:34:26
       const endtime = Date.now() + retryTimeout;
       let error: Error;
 
-      function attempt() {
-        if (retries > 0 && Date.now() < endtime) {
-          promissory()
-            .then(resolve)
-            .catch(e => {
-              retries--;
-              error = e;
-              setTimeout(() => attempt(), delay);
-            });
-        } else {
-          reject(error);
-        }
-      }
+      function attempt() {}
 
       attempt();

[Survived] EqualityOperator
core/shared/utils/Utils.ts:35:28
       let error: Error;
 
       function attempt() {
-        if (retries > 0 && Date.now() < endtime) {
+        if (retries > 0 && Date.now() <= endtime) {
           promissory()
             .then(resolve)

[Survived] BlockStatement
core/shared/utils/Utils.ts:35:50
       let error: Error;
 
       function attempt() {
-        if (retries > 0 && Date.now() < endtime) {
-          promissory()
-            .then(resolve)
-            .catch(e => {
-              retries--;
-              error = e;
-              setTimeout(() => attempt(), delay);
-            });
-        } else {
+        if (retries > 0 && Date.now() < endtime) {} else {
           reject(error);
         }

[Survived] BlockStatement
core/shared/utils/Utils.ts:38:25
         if (retries > 0 && Date.now() < endtime) {
           promissory()
             .then(resolve)
-            .catch(e => {
-              retries--;
-              error = e;
-              setTimeout(() => attempt(), delay);
-            });
+            .catch(e => {});
         } else {
           reject(error);

[Survived] UpdateOperator
core/shared/utils/Utils.ts:39:15
           promissory()
             .then(resolve)
             .catch(e => {
-              retries--;
+              retries++;
               error = e;
               setTimeout(() => attempt(), delay);

[Survived] ArrowFunction
core/shared/utils/Utils.ts:41:26
             .catch(e => {
               retries--;
               error = e;
-              setTimeout(() => attempt(), delay);
+              setTimeout(() => undefined, delay);
             });
         } else {

[Survived] BlockStatement
core/shared/utils/Utils.ts:43:16
               error = e;
               setTimeout(() => attempt(), delay);
             });
-        } else {
-          reject(error);
-        }
+        } else {}
       }
 

[Survived] BlockStatement
core/shared/utils/Utils.ts:52:56
     });
   }
 
-  public static stripChars(string: string, regex: any) {
-    if (typeof regex === 'undefined' || !Boolean(regex)) {
-      regex = /[\D+]/g;
-      return string.replace(regex, '');
-    } else {
-      return string.replace(regex, '');
-    }
-  }
+  public static stripChars(string: string, regex: any) {}
 
   public static getLastElementOfArray = (array: number[]) => array && array.slice(-1).pop();

[Survived] BooleanLiteral
core/shared/utils/Utils.ts:53:41
   }
 
   public static stripChars(string: string, regex: any) {
-    if (typeof regex === 'undefined' || !Boolean(regex)) {
+    if (typeof regex === 'undefined' || Boolean(regex)) {
       regex = /[\D+]/g;
       return string.replace(regex, '');

[Survived] ConditionalExpression
core/shared/utils/Utils.ts:53:9
   }
 
   public static stripChars(string: string, regex: any) {
-    if (typeof regex === 'undefined' || !Boolean(regex)) {
+    if (false) {
       regex = /[\D+]/g;
       return string.replace(regex, '');

[Survived] StringLiteral
core/shared/utils/Utils.ts:55:36
   public static stripChars(string: string, regex: any) {
     if (typeof regex === 'undefined' || !Boolean(regex)) {
       regex = /[\D+]/g;
-      return string.replace(regex, '');
+      return string.replace(regex, "Stryker was here!");
     } else {
       return string.replace(regex, '');

[Survived] BlockStatement
core/shared/utils/Utils.ts:56:12
     if (typeof regex === 'undefined' || !Boolean(regex)) {
       regex = /[\D+]/g;
       return string.replace(regex, '');
-    } else {
-      return string.replace(regex, '');
-    }
+    } else {}
   }
 

[Survived] UnaryOperator
core/shared/utils/Utils.ts:61:83
     }
   }
 
-  public static getLastElementOfArray = (array: number[]) => array && array.slice(-1).pop();
+  public static getLastElementOfArray = (array: number[]) => array && array.slice(+1).pop();
 
   public static setElementAttributes(attributes: any, element: HTMLInputElement) {

[Survived] ArrowFunction
core/shared/utils/Utils.ts:61:41
     }
   }
 
-  public static getLastElementOfArray = (array: number[]) => array && array.slice(-1).pop();
+  public static getLastElementOfArray = () => undefined;
 
   public static setElementAttributes(attributes: any, element: HTMLInputElement) {

[Survived] BlockStatement
core/shared/utils/Utils.ts:63:82
 
   public static getLastElementOfArray = (array: number[]) => array && array.slice(-1).pop();
 
-  public static setElementAttributes(attributes: any, element: HTMLInputElement) {
-    // tslint:disable-next-line: forin
-    for (const attribute in attributes) {
-      const value = attributes[attribute];
-      if (Utils.inArray(['value'], attribute)) {
-        // @ts-ignore
-        element[attribute] = value;
-      } else if (value === false) {
-        element.removeAttribute(attribute);
-      } else {
-        element.setAttribute(attribute, value);
-      }
-    }
-  }
+  public static setElementAttributes(attributes: any, element: HTMLInputElement) {}
 }
 

[Survived] BlockStatement
core/shared/utils/Utils.ts:65:41
 
   public static setElementAttributes(attributes: any, element: HTMLInputElement) {
     // tslint:disable-next-line: forin
-    for (const attribute in attributes) {
-      const value = attributes[attribute];
-      if (Utils.inArray(['value'], attribute)) {
-        // @ts-ignore
-        element[attribute] = value;
-      } else if (value === false) {
-        element.removeAttribute(attribute);
-      } else {
-        element.setAttribute(attribute, value);
-      }
-    }
+    for (const attribute in attributes) {}
   }
 }

[Survived] ConditionalExpression
core/shared/utils/Utils.ts:67:11
     // tslint:disable-next-line: forin
     for (const attribute in attributes) {
       const value = attributes[attribute];
-      if (Utils.inArray(['value'], attribute)) {
+      if (false) {
         // @ts-ignore
         element[attribute] = value;

[Survived] BlockStatement
core/shared/utils/Utils.ts:67:48
     // tslint:disable-next-line: forin
     for (const attribute in attributes) {
       const value = attributes[attribute];
-      if (Utils.inArray(['value'], attribute)) {
-        // @ts-ignore
-        element[attribute] = value;
-      } else if (value === false) {
+      if (Utils.inArray(['value'], attribute)) {} else if (value === false) {
         element.removeAttribute(attribute);
       } else {

[Survived] ConditionalExpression
core/shared/utils/Utils.ts:70:18
       if (Utils.inArray(['value'], attribute)) {
         // @ts-ignore
         element[attribute] = value;
-      } else if (value === false) {
+      } else if (false) {
         element.removeAttribute(attribute);
       } else {

[Survived] BooleanLiteral
core/shared/utils/Utils.ts:70:28
       if (Utils.inArray(['value'], attribute)) {
         // @ts-ignore
         element[attribute] = value;
-      } else if (value === false) {
+      } else if (value === true) {
         element.removeAttribute(attribute);
       } else {

[Survived] BlockStatement
core/shared/utils/Utils.ts:72:14
         element[attribute] = value;
       } else if (value === false) {
         element.removeAttribute(attribute);
-      } else {
-        element.setAttribute(attribute, value);
-      }
+      } else {}
     }
   }
