[Survived] BlockStatement
core/shared/uuid/Uuid.ts:2:27
 export class Uuid {
-  static uuidv4(): string {
-    return window.crypto ? Uuid.uuidv4crypto() : Uuid.uuidv4random();
-  }
+  static uuidv4(): string {}
 
   private static uuidv4crypto(): string {

[Survived] BlockStatement
core/shared/uuid/Uuid.ts:6:41
     return window.crypto ? Uuid.uuidv4crypto() : Uuid.uuidv4random();
   }
 
-  private static uuidv4crypto(): string {
-    // @ts-ignore
-    return ([1e7] + -1e3 + -4e3 + -8e3 + -1e11).replace(/[018]/g, (c: any) =>
-      (c ^ (crypto.getRandomValues(new Uint8Array(1))[0] & (15 >> (c / 4)))).toString(16)
-    );
-  }
+  private static uuidv4crypto(): string {}
 
   private static uuidv4random(): string {

[Survived] ArithmeticOperator
core/shared/uuid/Uuid.ts:8:13
 
   private static uuidv4crypto(): string {
     // @ts-ignore
-    return ([1e7] + -1e3 + -4e3 + -8e3 + -1e11).replace(/[018]/g, (c: any) =>
+    return ([1e7] + -1e3 - -4e3 + -8e3 + -1e11).replace(/[018]/g, (c: any) =>
       (c ^ (crypto.getRandomValues(new Uint8Array(1))[0] & (15 >> (c / 4)))).toString(16)
     );

[Survived] ArithmeticOperator
core/shared/uuid/Uuid.ts:8:13
 
   private static uuidv4crypto(): string {
     // @ts-ignore
-    return ([1e7] + -1e3 + -4e3 + -8e3 + -1e11).replace(/[018]/g, (c: any) =>
+    return ([1e7] - -1e3 + -4e3 + -8e3 + -1e11).replace(/[018]/g, (c: any) =>
       (c ^ (crypto.getRandomValues(new Uint8Array(1))[0] & (15 >> (c / 4)))).toString(16)
     );

[Survived] ArithmeticOperator
core/shared/uuid/Uuid.ts:9:68
   private static uuidv4crypto(): string {
     // @ts-ignore
     return ([1e7] + -1e3 + -4e3 + -8e3 + -1e11).replace(/[018]/g, (c: any) =>
-      (c ^ (crypto.getRandomValues(new Uint8Array(1))[0] & (15 >> (c / 4)))).toString(16)
+      (c ^ (crypto.getRandomValues(new Uint8Array(1))[0] & (15 >> (c * 4)))).toString(16)
     );
   }

[Survived] BlockStatement
core/shared/uuid/Uuid.ts:13:41
     );
   }
 
-  private static uuidv4random(): string {
-    return 'xxxxxxxx-xxxx-4xxx-yxxx-xxxxxxxxxxxx'.replace(/[xy]/g, (c: string) => {
-      const r = (Math.random() * 16) | 0;
-      const v = c === 'x' ? r : (r & 0x3) | 0x8;
-
-      return v.toString(16);
-    });
-  }
+  private static uuidv4random(): string {}
 }
 

[Survived] BlockStatement
core/shared/uuid/Uuid.ts:14:83
   }
 
   private static uuidv4random(): string {
-    return 'xxxxxxxx-xxxx-4xxx-yxxx-xxxxxxxxxxxx'.replace(/[xy]/g, (c: string) => {
-      const r = (Math.random() * 16) | 0;
-      const v = c === 'x' ? r : (r & 0x3) | 0x8;
-
-      return v.toString(16);
-    });
+    return 'xxxxxxxx-xxxx-4xxx-yxxx-xxxxxxxxxxxx'.replace(/[xy]/g, (c: string) => {});
   }
 }

[Survived] ArithmeticOperator
core/shared/uuid/Uuid.ts:15:18
 
   private static uuidv4random(): string {
     return 'xxxxxxxx-xxxx-4xxx-yxxx-xxxxxxxxxxxx'.replace(/[xy]/g, (c: string) => {
-      const r = (Math.random() * 16) | 0;
+      const r = (Math.random() / 16) | 0;
       const v = c === 'x' ? r : (r & 0x3) | 0x8;
 

[Survived] ConditionalExpression
core/shared/uuid/Uuid.ts:16:17
   private static uuidv4random(): string {
     return 'xxxxxxxx-xxxx-4xxx-yxxx-xxxxxxxxxxxx'.replace(/[xy]/g, (c: string) => {
       const r = (Math.random() * 16) | 0;
-      const v = c === 'x' ? r : (r & 0x3) | 0x8;
+      const v = false ? r : (r & 0x3) | 0x8;
 
       return v.toString(16);

[Survived] ConditionalExpression
core/shared/uuid/Uuid.ts:16:17
   private static uuidv4random(): string {
     return 'xxxxxxxx-xxxx-4xxx-yxxx-xxxxxxxxxxxx'.replace(/[xy]/g, (c: string) => {
       const r = (Math.random() * 16) | 0;
-      const v = c === 'x' ? r : (r & 0x3) | 0x8;
+      const v = true ? r : (r & 0x3) | 0x8;
 
       return v.toString(16);
