[Survived] StringLiteral
core/shared/validation/Validation.ts:26:45
 
 @Service()
 export class Validation {
-  public static ERROR_FIELD_CLASS: string = 'error-field';
+  public static ERROR_FIELD_CLASS: string = "";
 
   public static clearNonDigitsChars(value: string): string {

[Survived] BlockStatement
core/shared/validation/Validation.ts:28:60
 export class Validation {
   public static ERROR_FIELD_CLASS: string = 'error-field';
 
-  public static clearNonDigitsChars(value: string): string {
-    return value.replace(Validation.ESCAPE_DIGITS_REGEXP, Validation.CLEAR_VALUE);
-  }
+  public static clearNonDigitsChars(value: string): string {}
 
   public static getValidationMessage(state: ValidityState): string {

[Survived] BlockStatement
core/shared/validation/Validation.ts:32:68
     return value.replace(Validation.ESCAPE_DIGITS_REGEXP, Validation.CLEAR_VALUE);
   }
 
-  public static getValidationMessage(state: ValidityState): string {
-    const { patternMismatch, valid, valueMissing } = state;
-    if (!valid) {
-      if (valueMissing) {
-        return VALIDATION_ERROR_FIELD_IS_REQUIRED;
-      } else if (patternMismatch) {
-        return VALIDATION_ERROR_PATTERN_MISMATCH;
-      } else {
-        return VALIDATION_ERROR;
-      }
-    }
-  }
+  public static getValidationMessage(state: ValidityState): string {}
 
   public static isCharNumber(event: KeyboardEvent): boolean {

[Survived] ConditionalExpression
core/shared/validation/Validation.ts:34:9
 
   public static getValidationMessage(state: ValidityState): string {
     const { patternMismatch, valid, valueMissing } = state;
-    if (!valid) {
+    if (false) {
       if (valueMissing) {
         return VALIDATION_ERROR_FIELD_IS_REQUIRED;

[Survived] BlockStatement
core/shared/validation/Validation.ts:34:17
 
   public static getValidationMessage(state: ValidityState): string {
     const { patternMismatch, valid, valueMissing } = state;
-    if (!valid) {
-      if (valueMissing) {
-        return VALIDATION_ERROR_FIELD_IS_REQUIRED;
-      } else if (patternMismatch) {
-        return VALIDATION_ERROR_PATTERN_MISMATCH;
-      } else {
-        return VALIDATION_ERROR;
-      }
-    }
+    if (!valid) {}
   }
 

[Survived] ConditionalExpression
core/shared/validation/Validation.ts:35:11
   public static getValidationMessage(state: ValidityState): string {
     const { patternMismatch, valid, valueMissing } = state;
     if (!valid) {
-      if (valueMissing) {
+      if (false) {
         return VALIDATION_ERROR_FIELD_IS_REQUIRED;
       } else if (patternMismatch) {

[Survived] ConditionalExpression
core/shared/validation/Validation.ts:35:11
   public static getValidationMessage(state: ValidityState): string {
     const { patternMismatch, valid, valueMissing } = state;
     if (!valid) {
-      if (valueMissing) {
+      if (true) {
         return VALIDATION_ERROR_FIELD_IS_REQUIRED;
       } else if (patternMismatch) {

[Survived] ConditionalExpression
core/shared/validation/Validation.ts:37:18
     if (!valid) {
       if (valueMissing) {
         return VALIDATION_ERROR_FIELD_IS_REQUIRED;
-      } else if (patternMismatch) {
+      } else if (false) {
         return VALIDATION_ERROR_PATTERN_MISMATCH;
       } else {

[Survived] BlockStatement
core/shared/validation/Validation.ts:37:35
     if (!valid) {
       if (valueMissing) {
         return VALIDATION_ERROR_FIELD_IS_REQUIRED;
-      } else if (patternMismatch) {
-        return VALIDATION_ERROR_PATTERN_MISMATCH;
-      } else {
+      } else if (patternMismatch) {} else {
         return VALIDATION_ERROR;
       }

[Survived] BlockStatement
core/shared/validation/Validation.ts:39:14
         return VALIDATION_ERROR_FIELD_IS_REQUIRED;
       } else if (patternMismatch) {
         return VALIDATION_ERROR_PATTERN_MISMATCH;
-      } else {
-        return VALIDATION_ERROR;
-      }
+      } else {}
     }
   }

[Survived] BlockStatement
core/shared/validation/Validation.ts:45:61
     }
   }
 
-  public static isCharNumber(event: KeyboardEvent): boolean {
-    const key: string = event.key;
-    const regex = new RegExp(Validation.ESCAPE_DIGITS_REGEXP);
-    return regex.test(key);
-  }
+  public static isCharNumber(event: KeyboardEvent): boolean {}
 
   public static isEnter(event: KeyboardEvent): boolean {

[Survived] BlockStatement
core/shared/validation/Validation.ts:51:56
     return regex.test(key);
   }
 
-  public static isEnter(event: KeyboardEvent): boolean {
-    if (event) {
-      const keyCode: number = event.keyCode;
-      return keyCode === Validation.ENTER_KEY_CODE;
-    } else {
-      return false;
-    }
-  }
+  public static isEnter(event: KeyboardEvent): boolean {}
 
   public static setCustomValidationError(errorContent: string, inputElement: HTMLInputElement) {

[Survived] BlockStatement
core/shared/validation/Validation.ts:52:16
   }
 
   public static isEnter(event: KeyboardEvent): boolean {
-    if (event) {
-      const keyCode: number = event.keyCode;
-      return keyCode === Validation.ENTER_KEY_CODE;
-    } else {
+    if (event) {} else {
       return false;
     }

[Survived] ConditionalExpression
core/shared/validation/Validation.ts:52:9
   }
 
   public static isEnter(event: KeyboardEvent): boolean {
-    if (event) {
+    if (false) {
       const keyCode: number = event.keyCode;
       return keyCode === Validation.ENTER_KEY_CODE;

[Survived] ConditionalExpression
core/shared/validation/Validation.ts:54:14
   public static isEnter(event: KeyboardEvent): boolean {
     if (event) {
       const keyCode: number = event.keyCode;
-      return keyCode === Validation.ENTER_KEY_CODE;
+      return false;
     } else {
       return false;

[Survived] ConditionalExpression
core/shared/validation/Validation.ts:54:14
   public static isEnter(event: KeyboardEvent): boolean {
     if (event) {
       const keyCode: number = event.keyCode;
-      return keyCode === Validation.ENTER_KEY_CODE;
+      return true;
     } else {
       return false;

[Survived] BlockStatement
core/shared/validation/Validation.ts:55:12
     if (event) {
       const keyCode: number = event.keyCode;
       return keyCode === Validation.ENTER_KEY_CODE;
-    } else {
-      return false;
-    }
+    } else {}
   }
 

[Survived] BlockStatement
core/shared/validation/Validation.ts:60:96
     }
   }
 
-  public static setCustomValidationError(errorContent: string, inputElement: HTMLInputElement) {
-    inputElement.setCustomValidity(errorContent);
-  }
+  public static setCustomValidationError(errorContent: string, inputElement: HTMLInputElement) {}
 
   public static addErrorContainer(inputElement: HTMLInputElement, inputTarget: InsertPosition, errorContent: string) {

[Survived] BlockStatement
core/shared/validation/Validation.ts:64:118
     inputElement.setCustomValidity(errorContent);
   }
 
-  public static addErrorContainer(inputElement: HTMLInputElement, inputTarget: InsertPosition, errorContent: string) {
-    inputElement.insertAdjacentHTML(inputTarget, errorContent);
-  }
+  public static addErrorContainer(inputElement: HTMLInputElement, inputTarget: InsertPosition, errorContent: string) {}
 
   public static resetValidationProperties(input: HTMLInputElement): void {

[Survived] BlockStatement
core/shared/validation/Validation.ts:68:74
     inputElement.insertAdjacentHTML(inputTarget, errorContent);
   }
 
-  public static resetValidationProperties(input: HTMLInputElement): void {
-    input.setCustomValidity(Validation.CLEAR_VALUE);
-    input.classList.remove(Validation.ERROR_FIELD_CLASS);
-    input.nextSibling.textContent = Validation.CLEAR_VALUE;
-  }
+  public static resetValidationProperties(input: HTMLInputElement): void {}
 
   public static returnInputAndErrorContainerPair(item: HTMLInputElement) {

[Survived] BlockStatement
core/shared/validation/Validation.ts:74:74
     input.nextSibling.textContent = Validation.CLEAR_VALUE;
   }
 
-  public static returnInputAndErrorContainerPair(item: HTMLInputElement) {
-    return {
-      inputElement: document.getElementById(item.id) as HTMLInputElement,
-      messageElement: document.getElementById(item.id).nextSibling as HTMLElement
-    };
-  }
+  public static returnInputAndErrorContainerPair(item: HTMLInputElement) {}
 
   private static BACKSPACE_KEY_CODE: number = 8;

[Survived] StringLiteral
core/shared/validation/Validation.ts:84:40
   private static BACKSPACE_KEY_CODE: number = 8;
   private static CARD_NUMBER_DEFAULT_LENGTH: number = 16;
   private static CARD_NUMBER_FIELD_NAME: string = 'pan';
-  private static CLEAR_VALUE: string = '';
+  private static CLEAR_VALUE: string = "Stryker was here!";
   private static DELETE_KEY_CODE: number = 46;
   private static ENTER_KEY_CODE = 13;

[Survived] StringLiteral
core/shared/validation/Validation.ts:87:40
   private static CLEAR_VALUE: string = '';
   private static DELETE_KEY_CODE: number = 46;
   private static ENTER_KEY_CODE = 13;
-  private static ERROR_CLASS: string = 'error';
+  private static ERROR_CLASS: string = "";
   private static ESCAPE_DIGITS_REGEXP = /[^\d]/g;
   private static EXPIRY_DATE_FIELD_NAME: string = 'expirydate';

[Survived] StringLiteral
core/shared/validation/Validation.ts:98:19
   private static BACKEND_ERROR_FIELDS_NAMES = {
     cardNumber: 'pan',
     expirationDate: 'expirydate',
-    securityCode: 'securitycode'
+    securityCode: ""
   };
 

[Survived] BlockStatement
core/shared/validation/Validation.ts:101:98
     securityCode: 'securitycode'
   };
 
-  private static _setValidateEvent(errordata: string, event: IMessageBusEvent): IMessageBusEvent {
-    switch (errordata) {
-      case Validation.BACKEND_ERROR_FIELDS_NAMES.cardNumber:
-        event.type = MessageBus.EVENTS.VALIDATE_CARD_NUMBER_FIELD;
-        break;
-      case Validation.BACKEND_ERROR_FIELDS_NAMES.expirationDate:
-        event.type = MessageBus.EVENTS.VALIDATE_EXPIRATION_DATE_FIELD;
-        break;
-      case Validation.BACKEND_ERROR_FIELDS_NAMES.securityCode:
-        event.type = MessageBus.EVENTS.VALIDATE_SECURITY_CODE_FIELD;
-        break;
-    }
-    return event;
-  }
+  private static _setValidateEvent(errordata: string, event: IMessageBusEvent): IMessageBusEvent {}
 
   private static _isFormValid(

[Survived] ConditionalExpression
core/shared/validation/Validation.ts:103:7
 
   private static _setValidateEvent(errordata: string, event: IMessageBusEvent): IMessageBusEvent {
     switch (errordata) {
-      case Validation.BACKEND_ERROR_FIELDS_NAMES.cardNumber:
-        event.type = MessageBus.EVENTS.VALIDATE_CARD_NUMBER_FIELD;
-        break;
+      case Validation.BACKEND_ERROR_FIELDS_NAMES.cardNumber:
       case Validation.BACKEND_ERROR_FIELDS_NAMES.expirationDate:
         event.type = MessageBus.EVENTS.VALIDATE_EXPIRATION_DATE_FIELD;

[Survived] ConditionalExpression
core/shared/validation/Validation.ts:106:7
       case Validation.BACKEND_ERROR_FIELDS_NAMES.cardNumber:
         event.type = MessageBus.EVENTS.VALIDATE_CARD_NUMBER_FIELD;
         break;
-      case Validation.BACKEND_ERROR_FIELDS_NAMES.expirationDate:
-        event.type = MessageBus.EVENTS.VALIDATE_EXPIRATION_DATE_FIELD;
-        break;
+      case Validation.BACKEND_ERROR_FIELDS_NAMES.expirationDate:
       case Validation.BACKEND_ERROR_FIELDS_NAMES.securityCode:
         event.type = MessageBus.EVENTS.VALIDATE_SECURITY_CODE_FIELD;

[Survived] ConditionalExpression
core/shared/validation/Validation.ts:109:7
       case Validation.BACKEND_ERROR_FIELDS_NAMES.expirationDate:
         event.type = MessageBus.EVENTS.VALIDATE_EXPIRATION_DATE_FIELD;
         break;
-      case Validation.BACKEND_ERROR_FIELDS_NAMES.securityCode:
-        event.type = MessageBus.EVENTS.VALIDATE_SECURITY_CODE_FIELD;
-        break;
+      case Validation.BACKEND_ERROR_FIELDS_NAMES.securityCode:
     }
     return event;

[Survived] BlockStatement
core/shared/validation/Validation.ts:124:14
     },
     fieldsToSubmit: string[],
     isPanPiba: boolean
-  ): boolean {
-    const isPanValid: boolean = fieldsToSubmit.includes(Validation.CARD_NUMBER_FIELD_NAME)
-      ? formFields.cardNumber.validity
-      : true;
-    const isExpiryDateValid: boolean = fieldsToSubmit.includes(Validation.EXPIRY_DATE_FIELD_NAME)
-      ? formFields.expirationDate.validity
-      : true;
-    const isSecurityCodeValid: boolean =
-      fieldsToSubmit.includes(Validation.SECURITY_CODE_FIELD_NAME) && !isPanPiba
-        ? formFields.securityCode.validity
-        : true;
-    return isPanValid && isExpiryDateValid && isSecurityCodeValid;
-  }
+  ): boolean {}
 
   public cardDetails: any;

[Survived] BooleanLiteral
core/shared/validation/Validation.ts:127:9
   ): boolean {
     const isPanValid: boolean = fieldsToSubmit.includes(Validation.CARD_NUMBER_FIELD_NAME)
       ? formFields.cardNumber.validity
-      : true;
+      : false;
     const isExpiryDateValid: boolean = fieldsToSubmit.includes(Validation.EXPIRY_DATE_FIELD_NAME)
       ? formFields.expirationDate.validity

[Survived] BooleanLiteral
core/shared/validation/Validation.ts:130:9
       : true;
     const isExpiryDateValid: boolean = fieldsToSubmit.includes(Validation.EXPIRY_DATE_FIELD_NAME)
       ? formFields.expirationDate.validity
-      : true;
+      : false;
     const isSecurityCodeValid: boolean =
       fieldsToSubmit.includes(Validation.SECURITY_CODE_FIELD_NAME) && !isPanPiba

[Survived] LogicalOperator
core/shared/validation/Validation.ts:132:7
       ? formFields.expirationDate.validity
       : true;
     const isSecurityCodeValid: boolean =
-      fieldsToSubmit.includes(Validation.SECURITY_CODE_FIELD_NAME) && !isPanPiba
+      fieldsToSubmit.includes(Validation.SECURITY_CODE_FIELD_NAME) || !isPanPiba
         ? formFields.securityCode.validity
         : true;

[Survived] BooleanLiteral
core/shared/validation/Validation.ts:132:71
       ? formFields.expirationDate.validity
       : true;
     const isSecurityCodeValid: boolean =
-      fieldsToSubmit.includes(Validation.SECURITY_CODE_FIELD_NAME) && !isPanPiba
+      fieldsToSubmit.includes(Validation.SECURITY_CODE_FIELD_NAME) && isPanPiba
         ? formFields.securityCode.validity
         : true;

[Survived] BooleanLiteral
core/shared/validation/Validation.ts:134:11
     const isSecurityCodeValid: boolean =
       fieldsToSubmit.includes(Validation.SECURITY_CODE_FIELD_NAME) && !isPanPiba
         ? formFields.securityCode.validity
-        : true;
+        : false;
     return isPanValid && isExpiryDateValid && isSecurityCodeValid;
   }

[Survived] ConditionalExpression
core/shared/validation/Validation.ts:135:12
       fieldsToSubmit.includes(Validation.SECURITY_CODE_FIELD_NAME) && !isPanPiba
         ? formFields.securityCode.validity
         : true;
-    return isPanValid && isExpiryDateValid && isSecurityCodeValid;
+    return false;
   }
 

[Survived] ConditionalExpression
core/shared/validation/Validation.ts:135:12
       fieldsToSubmit.includes(Validation.SECURITY_CODE_FIELD_NAME) && !isPanPiba
         ? formFields.securityCode.validity
         : true;
-    return isPanValid && isExpiryDateValid && isSecurityCodeValid;
+    return false && isSecurityCodeValid;
   }
 

[Survived] BlockStatement
core/shared/validation/Validation.ts:154:17
   private _messageBus: MessageBus;
   private _frame: Frame;
 
-  constructor() {
-    this._messageBus = Container.get(MessageBus);
-    this._frame = Container.get(Frame);
-    this.init();
-  }
+  constructor() {}
 
   public backendValidation(inputElement: HTMLInputElement, messageElement: HTMLElement, event: string) {

[Survived] BlockStatement
core/shared/validation/Validation.ts:160:104
     this.init();
   }
 
-  public backendValidation(inputElement: HTMLInputElement, messageElement: HTMLElement, event: string) {
-    this._messageBus.subscribe(event, (data: IMessageBusValidateField) => {
-      this.setError(inputElement, messageElement, data);
-    });
-  }
+  public backendValidation(inputElement: HTMLInputElement, messageElement: HTMLElement, event: string) {}
 
   public blockForm(state: FormState) {

[Survived] BlockStatement
core/shared/validation/Validation.ts:161:75
   }
 
   public backendValidation(inputElement: HTMLInputElement, messageElement: HTMLElement, event: string) {
-    this._messageBus.subscribe(event, (data: IMessageBusValidateField) => {
-      this.setError(inputElement, messageElement, data);
-    });
+    this._messageBus.subscribe(event, (data: IMessageBusValidateField) => {});
   }
 

[Survived] BlockStatement
core/shared/validation/Validation.ts:166:38
     });
   }
 
-  public blockForm(state: FormState) {
-    const messageBusEvent: IMessageBusEvent = {
-      data: state,
-      type: MessageBus.EVENTS_PUBLIC.BLOCK_FORM
-    };
-    this._messageBus.publish(messageBusEvent, true);
-  }
+  public blockForm(state: FormState) {}
 
   public callSubmitEvent() {

[Survived] ObjectLiteral
core/shared/validation/Validation.ts:167:47
   }
 
   public blockForm(state: FormState) {
-    const messageBusEvent: IMessageBusEvent = {
-      data: state,
-      type: MessageBus.EVENTS_PUBLIC.BLOCK_FORM
-    };
+    const messageBusEvent: IMessageBusEvent = {};
     this._messageBus.publish(messageBusEvent, true);
   }

[Survived] BooleanLiteral
core/shared/validation/Validation.ts:171:47
       data: state,
       type: MessageBus.EVENTS_PUBLIC.BLOCK_FORM
     };
-    this._messageBus.publish(messageBusEvent, true);
+    this._messageBus.publish(messageBusEvent, false);
   }
 

[Survived] BlockStatement
core/shared/validation/Validation.ts:174:28
     this._messageBus.publish(messageBusEvent, true);
   }
 
-  public callSubmitEvent() {
-    const messageBusEvent: IMessageBusEvent = {
-      type: MessageBus.EVENTS_PUBLIC.CALL_SUBMIT_EVENT
-    };
-    this._messageBus.publish(messageBusEvent, true);
-  }
+  public callSubmitEvent() {}
 
   public formValidation(

[Survived] BlockStatement
core/shared/validation/Validation.ts:191:41
     },
     isPanPiba: boolean,
     paymentReady: boolean
-  ): { card: ICard; validity: boolean } {
-    this._setValidationResult(dataInJwt, fieldsToSubmit, formFields, isPanPiba, paymentReady);
-    const isFormReadyToSubmit: boolean = this._isFormReadyToSubmit();
-    if (isFormReadyToSubmit) {
-      this.blockForm(FormState.BLOCKED);
-    }
-    return {
-      card: this._card,
-      validity: isFormReadyToSubmit
-    };
-  }
+  ): { card: ICard; validity: boolean } {}
 
   public getErrorData(errorData: IErrorData) {

[Survived] ConditionalExpression
core/shared/validation/Validation.ts:194:9
   ): { card: ICard; validity: boolean } {
     this._setValidationResult(dataInJwt, fieldsToSubmit, formFields, isPanPiba, paymentReady);
     const isFormReadyToSubmit: boolean = this._isFormReadyToSubmit();
-    if (isFormReadyToSubmit) {
+    if (false) {
       this.blockForm(FormState.BLOCKED);
     }

[Survived] ConditionalExpression
core/shared/validation/Validation.ts:194:9
   ): { card: ICard; validity: boolean } {
     this._setValidationResult(dataInJwt, fieldsToSubmit, formFields, isPanPiba, paymentReady);
     const isFormReadyToSubmit: boolean = this._isFormReadyToSubmit();
-    if (isFormReadyToSubmit) {
+    if (true) {
       this.blockForm(FormState.BLOCKED);
     }

[Survived] BlockStatement
core/shared/validation/Validation.ts:203:46
     };
   }
 
-  public getErrorData(errorData: IErrorData) {
-    const { errordata, errormessage } = StCodec.getErrorData(errorData);
-    const validationEvent: IMessageBusEvent = {
-      data: { field: errordata[0], message: errormessage },
-      type: Validation.CLEAR_VALUE
-    };
-
-    this._broadcastFormFieldError(errordata[0], validationEvent);
-
-    if (errordata.find((element: string) => element.includes(Validation.MERCHANT_EXTRA_FIELDS_PREFIX))) {
-      validationEvent.type = MessageBus.EVENTS.VALIDATE_MERCHANT_FIELD;
-      this._messageBus.publish(validationEvent);
-    }
-
-    return { field: errordata[0], errormessage };
-  }
+  public getErrorData(errorData: IErrorData) {}
 
   public keepCursorsPosition(element: HTMLInputElement) {

[Survived] ObjectLiteral
core/shared/validation/Validation.ts:205:47
 
   public getErrorData(errorData: IErrorData) {
     const { errordata, errormessage } = StCodec.getErrorData(errorData);
-    const validationEvent: IMessageBusEvent = {
-      data: { field: errordata[0], message: errormessage },
-      type: Validation.CLEAR_VALUE
-    };
+    const validationEvent: IMessageBusEvent = {};
 
     this._broadcastFormFieldError(errordata[0], validationEvent);

[Survived] ArrowFunction
core/shared/validation/Validation.ts:212:24
 
     this._broadcastFormFieldError(errordata[0], validationEvent);
 
-    if (errordata.find((element: string) => element.includes(Validation.MERCHANT_EXTRA_FIELDS_PREFIX))) {
+    if (errordata.find(() => undefined)) {
       validationEvent.type = MessageBus.EVENTS.VALIDATE_MERCHANT_FIELD;
       this._messageBus.publish(validationEvent);

[Survived] ConditionalExpression
core/shared/validation/Validation.ts:212:9
 
     this._broadcastFormFieldError(errordata[0], validationEvent);
 
-    if (errordata.find((element: string) => element.includes(Validation.MERCHANT_EXTRA_FIELDS_PREFIX))) {
+    if (true) {
       validationEvent.type = MessageBus.EVENTS.VALIDATE_MERCHANT_FIELD;
       this._messageBus.publish(validationEvent);

[Survived] ObjectLiteral
core/shared/validation/Validation.ts:217:12
       this._messageBus.publish(validationEvent);
     }
 
-    return { field: errordata[0], errormessage };
+    return {};
   }
 

[Survived] BlockStatement
core/shared/validation/Validation.ts:220:57
     return { field: errordata[0], errormessage };
   }
 
-  public keepCursorsPosition(element: HTMLInputElement) {
-    const cursorSingleSkip: number = 1;
-    const cursorDoubleSkip: number = 2;
-    const dateSlash: string = '/';
-    const end: number = this._selectionRangeEnd;
-    const start: number = this._selectionRangeStart;
-    const noSelection: number = 0;
-    const selectionLength: number = start - end;
-    const spaceInPan: string = ' ';
-    const lengthFormatted: number = element.value.length;
-    const isLastCharSlash: boolean = element.value.charAt(lengthFormatted - cursorDoubleSkip) === dateSlash;
-
-    if (this._isPressedKeyDelete()) {
-      element.setSelectionRange(start, end);
-    } else if (this._isPressedKeyBackspace()) {
-      element.setSelectionRange(start - cursorSingleSkip, end - cursorSingleSkip);
-    } else if (isLastCharSlash || (element.value.charAt(end) === spaceInPan && selectionLength === noSelection)) {
-      element.setSelectionRange(start + cursorDoubleSkip, end + cursorDoubleSkip);
-    } else if (selectionLength === noSelection) {
-      element.setSelectionRange(start + cursorSingleSkip, end + cursorSingleSkip);
-    } else {
-      element.setSelectionRange(start + cursorSingleSkip, start + cursorSingleSkip);
-    }
-  }
+  public keepCursorsPosition(element: HTMLInputElement) {}
 
   public luhnCheck(field: HTMLInputElement, input: HTMLInputElement, message: HTMLDivElement) {

[Survived] StringLiteral
core/shared/validation/Validation.ts:223:31
   public keepCursorsPosition(element: HTMLInputElement) {
     const cursorSingleSkip: number = 1;
     const cursorDoubleSkip: number = 2;
-    const dateSlash: string = '/';
+    const dateSlash: string = "";
     const end: number = this._selectionRangeEnd;
     const start: number = this._selectionRangeStart;

[Survived] ArithmeticOperator
core/shared/validation/Validation.ts:227:37
     const end: number = this._selectionRangeEnd;
     const start: number = this._selectionRangeStart;
     const noSelection: number = 0;
-    const selectionLength: number = start - end;
+    const selectionLength: number = start + end;
     const spaceInPan: string = ' ';
     const lengthFormatted: number = element.value.length;

[Survived] ConditionalExpression
core/shared/validation/Validation.ts:230:38
     const selectionLength: number = start - end;
     const spaceInPan: string = ' ';
     const lengthFormatted: number = element.value.length;
-    const isLastCharSlash: boolean = element.value.charAt(lengthFormatted - cursorDoubleSkip) === dateSlash;
+    const isLastCharSlash: boolean = false;
 
     if (this._isPressedKeyDelete()) {

[Survived] EqualityOperator
core/shared/validation/Validation.ts:230:38
     const selectionLength: number = start - end;
     const spaceInPan: string = ' ';
     const lengthFormatted: number = element.value.length;
-    const isLastCharSlash: boolean = element.value.charAt(lengthFormatted - cursorDoubleSkip) === dateSlash;
+    const isLastCharSlash: boolean = element.value.charAt(lengthFormatted - cursorDoubleSkip) !== dateSlash;
 
     if (this._isPressedKeyDelete()) {

[Survived] BlockStatement
core/shared/validation/Validation.ts:232:37
     const lengthFormatted: number = element.value.length;
     const isLastCharSlash: boolean = element.value.charAt(lengthFormatted - cursorDoubleSkip) === dateSlash;
 
-    if (this._isPressedKeyDelete()) {
-      element.setSelectionRange(start, end);
-    } else if (this._isPressedKeyBackspace()) {
+    if (this._isPressedKeyDelete()) {} else if (this._isPressedKeyBackspace()) {
       element.setSelectionRange(start - cursorSingleSkip, end - cursorSingleSkip);
     } else if (isLastCharSlash || (element.value.charAt(end) === spaceInPan && selectionLength === noSelection)) {

[Survived] ConditionalExpression
core/shared/validation/Validation.ts:232:9
     const lengthFormatted: number = element.value.length;
     const isLastCharSlash: boolean = element.value.charAt(lengthFormatted - cursorDoubleSkip) === dateSlash;
 
-    if (this._isPressedKeyDelete()) {
+    if (true) {
       element.setSelectionRange(start, end);
     } else if (this._isPressedKeyBackspace()) {

[Survived] ConditionalExpression
core/shared/validation/Validation.ts:234:16
 
     if (this._isPressedKeyDelete()) {
       element.setSelectionRange(start, end);
-    } else if (this._isPressedKeyBackspace()) {
+    } else if (false) {
       element.setSelectionRange(start - cursorSingleSkip, end - cursorSingleSkip);
     } else if (isLastCharSlash || (element.value.charAt(end) === spaceInPan && selectionLength === noSelection)) {

[Survived] ConditionalExpression
core/shared/validation/Validation.ts:234:16
 
     if (this._isPressedKeyDelete()) {
       element.setSelectionRange(start, end);
-    } else if (this._isPressedKeyBackspace()) {
+    } else if (true) {
       element.setSelectionRange(start - cursorSingleSkip, end - cursorSingleSkip);
     } else if (isLastCharSlash || (element.value.charAt(end) === spaceInPan && selectionLength === noSelection)) {

[Survived] ArithmeticOperator
core/shared/validation/Validation.ts:235:59
     if (this._isPressedKeyDelete()) {
       element.setSelectionRange(start, end);
     } else if (this._isPressedKeyBackspace()) {
-      element.setSelectionRange(start - cursorSingleSkip, end - cursorSingleSkip);
+      element.setSelectionRange(start - cursorSingleSkip, end + cursorSingleSkip);
     } else if (isLastCharSlash || (element.value.charAt(end) === spaceInPan && selectionLength === noSelection)) {
       element.setSelectionRange(start + cursorDoubleSkip, end + cursorDoubleSkip);

[Survived] ArithmeticOperator
core/shared/validation/Validation.ts:235:33
     if (this._isPressedKeyDelete()) {
       element.setSelectionRange(start, end);
     } else if (this._isPressedKeyBackspace()) {
-      element.setSelectionRange(start - cursorSingleSkip, end - cursorSingleSkip);
+      element.setSelectionRange(start + cursorSingleSkip, end - cursorSingleSkip);
     } else if (isLastCharSlash || (element.value.charAt(end) === spaceInPan && selectionLength === noSelection)) {
       element.setSelectionRange(start + cursorDoubleSkip, end + cursorDoubleSkip);

[Survived] LogicalOperator
core/shared/validation/Validation.ts:236:36
       element.setSelectionRange(start, end);
     } else if (this._isPressedKeyBackspace()) {
       element.setSelectionRange(start - cursorSingleSkip, end - cursorSingleSkip);
-    } else if (isLastCharSlash || (element.value.charAt(end) === spaceInPan && selectionLength === noSelection)) {
+    } else if (isLastCharSlash || (element.value.charAt(end) === spaceInPan || selectionLength === noSelection)) {
       element.setSelectionRange(start + cursorDoubleSkip, end + cursorDoubleSkip);
     } else if (selectionLength === noSelection) {

[Survived] ConditionalExpression
core/shared/validation/Validation.ts:236:36
       element.setSelectionRange(start, end);
     } else if (this._isPressedKeyBackspace()) {
       element.setSelectionRange(start - cursorSingleSkip, end - cursorSingleSkip);
-    } else if (isLastCharSlash || (element.value.charAt(end) === spaceInPan && selectionLength === noSelection)) {
+    } else if (isLastCharSlash || (false)) {
       element.setSelectionRange(start + cursorDoubleSkip, end + cursorDoubleSkip);
     } else if (selectionLength === noSelection) {

[Survived] ArithmeticOperator
core/shared/validation/Validation.ts:237:33
     } else if (this._isPressedKeyBackspace()) {
       element.setSelectionRange(start - cursorSingleSkip, end - cursorSingleSkip);
     } else if (isLastCharSlash || (element.value.charAt(end) === spaceInPan && selectionLength === noSelection)) {
-      element.setSelectionRange(start + cursorDoubleSkip, end + cursorDoubleSkip);
+      element.setSelectionRange(start - cursorDoubleSkip, end + cursorDoubleSkip);
     } else if (selectionLength === noSelection) {
       element.setSelectionRange(start + cursorSingleSkip, end + cursorSingleSkip);
