[Survived] ArithmeticOperator
core/shared/validation/Validation.ts:237:59
     } else if (this._isPressedKeyBackspace()) {
       element.setSelectionRange(start - cursorSingleSkip, end - cursorSingleSkip);
     } else if (isLastCharSlash || (element.value.charAt(end) === spaceInPan && selectionLength === noSelection)) {
-      element.setSelectionRange(start + cursorDoubleSkip, end + cursorDoubleSkip);
+      element.setSelectionRange(start + cursorDoubleSkip, end - cursorDoubleSkip);
     } else if (selectionLength === noSelection) {
       element.setSelectionRange(start + cursorSingleSkip, end + cursorSingleSkip);

[Survived] ConditionalExpression
core/shared/validation/Validation.ts:238:16
       element.setSelectionRange(start - cursorSingleSkip, end - cursorSingleSkip);
     } else if (isLastCharSlash || (element.value.charAt(end) === spaceInPan && selectionLength === noSelection)) {
       element.setSelectionRange(start + cursorDoubleSkip, end + cursorDoubleSkip);
-    } else if (selectionLength === noSelection) {
+    } else if (false) {
       element.setSelectionRange(start + cursorSingleSkip, end + cursorSingleSkip);
     } else {

[Survived] ConditionalExpression
core/shared/validation/Validation.ts:238:16
       element.setSelectionRange(start - cursorSingleSkip, end - cursorSingleSkip);
     } else if (isLastCharSlash || (element.value.charAt(end) === spaceInPan && selectionLength === noSelection)) {
       element.setSelectionRange(start + cursorDoubleSkip, end + cursorDoubleSkip);
-    } else if (selectionLength === noSelection) {
+    } else if (true) {
       element.setSelectionRange(start + cursorSingleSkip, end + cursorSingleSkip);
     } else {

[Survived] ArithmeticOperator
core/shared/validation/Validation.ts:239:33
     } else if (isLastCharSlash || (element.value.charAt(end) === spaceInPan && selectionLength === noSelection)) {
       element.setSelectionRange(start + cursorDoubleSkip, end + cursorDoubleSkip);
     } else if (selectionLength === noSelection) {
-      element.setSelectionRange(start + cursorSingleSkip, end + cursorSingleSkip);
+      element.setSelectionRange(start - cursorSingleSkip, end + cursorSingleSkip);
     } else {
       element.setSelectionRange(start + cursorSingleSkip, start + cursorSingleSkip);

[Survived] ArithmeticOperator
core/shared/validation/Validation.ts:239:59
     } else if (isLastCharSlash || (element.value.charAt(end) === spaceInPan && selectionLength === noSelection)) {
       element.setSelectionRange(start + cursorDoubleSkip, end + cursorDoubleSkip);
     } else if (selectionLength === noSelection) {
-      element.setSelectionRange(start + cursorSingleSkip, end + cursorSingleSkip);
+      element.setSelectionRange(start + cursorSingleSkip, end - cursorSingleSkip);
     } else {
       element.setSelectionRange(start + cursorSingleSkip, start + cursorSingleSkip);

[Survived] BlockStatement
core/shared/validation/Validation.ts:240:12
       element.setSelectionRange(start + cursorDoubleSkip, end + cursorDoubleSkip);
     } else if (selectionLength === noSelection) {
       element.setSelectionRange(start + cursorSingleSkip, end + cursorSingleSkip);
-    } else {
-      element.setSelectionRange(start + cursorSingleSkip, start + cursorSingleSkip);
-    }
+    } else {}
   }
 

[Survived] ArithmeticOperator
core/shared/validation/Validation.ts:241:33
     } else if (selectionLength === noSelection) {
       element.setSelectionRange(start + cursorSingleSkip, end + cursorSingleSkip);
     } else {
-      element.setSelectionRange(start + cursorSingleSkip, start + cursorSingleSkip);
+      element.setSelectionRange(start - cursorSingleSkip, start + cursorSingleSkip);
     }
   }

[Survived] ArithmeticOperator
core/shared/validation/Validation.ts:241:59
     } else if (selectionLength === noSelection) {
       element.setSelectionRange(start + cursorSingleSkip, end + cursorSingleSkip);
     } else {
-      element.setSelectionRange(start + cursorSingleSkip, start + cursorSingleSkip);
+      element.setSelectionRange(start + cursorSingleSkip, start - cursorSingleSkip);
     }
   }

[Survived] BlockStatement
core/shared/validation/Validation.ts:245:95
     }
   }
 
-  public luhnCheck(field: HTMLInputElement, input: HTMLInputElement, message: HTMLDivElement) {
-    const { value } = input;
-    if (!luhnCheck(value)) {
-      Validation.setCustomValidationError(VALIDATION_ERROR_PATTERN_MISMATCH, field);
-      this.validate(input, message, VALIDATION_ERROR_PATTERN_MISMATCH);
-    } else {
-      Validation.setCustomValidationError(Validation.CLEAR_VALUE, field);
-    }
-  }
+  public luhnCheck(field: HTMLInputElement, input: HTMLInputElement, message: HTMLDivElement) {}
 
   public limitLength(value: string, length: number): string {

[Survived] ConditionalExpression
core/shared/validation/Validation.ts:247:9
 
   public luhnCheck(field: HTMLInputElement, input: HTMLInputElement, message: HTMLDivElement) {
     const { value } = input;
-    if (!luhnCheck(value)) {
+    if (false) {
       Validation.setCustomValidationError(VALIDATION_ERROR_PATTERN_MISMATCH, field);
       this.validate(input, message, VALIDATION_ERROR_PATTERN_MISMATCH);

[Survived] BlockStatement
core/shared/validation/Validation.ts:247:28
 
   public luhnCheck(field: HTMLInputElement, input: HTMLInputElement, message: HTMLDivElement) {
     const { value } = input;
-    if (!luhnCheck(value)) {
-      Validation.setCustomValidationError(VALIDATION_ERROR_PATTERN_MISMATCH, field);
-      this.validate(input, message, VALIDATION_ERROR_PATTERN_MISMATCH);
-    } else {
+    if (!luhnCheck(value)) {} else {
       Validation.setCustomValidationError(Validation.CLEAR_VALUE, field);
     }

[Survived] BlockStatement
core/shared/validation/Validation.ts:250:12
     if (!luhnCheck(value)) {
       Validation.setCustomValidationError(VALIDATION_ERROR_PATTERN_MISMATCH, field);
       this.validate(input, message, VALIDATION_ERROR_PATTERN_MISMATCH);
-    } else {
-      Validation.setCustomValidationError(Validation.CLEAR_VALUE, field);
-    }
+    } else {}
   }
 

[Survived] BlockStatement
core/shared/validation/Validation.ts:255:61
     }
   }
 
-  public limitLength(value: string, length: number): string {
-    return value ? value.substring(0, length) : Validation.CLEAR_VALUE;
-  }
+  public limitLength(value: string, length: number): string {}
 
   public removeError(element: HTMLInputElement, errorContainer: HTMLElement) {

[Survived] BlockStatement
core/shared/validation/Validation.ts:259:78
     return value ? value.substring(0, length) : Validation.CLEAR_VALUE;
   }
 
-  public removeError(element: HTMLInputElement, errorContainer: HTMLElement) {
-    element.classList.remove(Validation.ERROR_CLASS);
-    errorContainer.textContent = Validation.CLEAR_VALUE;
-  }
+  public removeError(element: HTMLInputElement, errorContainer: HTMLElement) {}
 
   public setError(inputElement: HTMLInputElement, messageElement: HTMLElement, data: IMessageBusValidateField) {

[Survived] BlockStatement
core/shared/validation/Validation.ts:264:112
     errorContainer.textContent = Validation.CLEAR_VALUE;
   }
 
-  public setError(inputElement: HTMLInputElement, messageElement: HTMLElement, data: IMessageBusValidateField) {
-    const { message } = data;
-    if (message && messageElement && messageElement.innerText !== VALIDATION_ERROR_PATTERN_MISMATCH) {
-      messageElement.innerText = this._translator.translate(message);
-      inputElement.classList.add(Validation.ERROR_FIELD_CLASS);
-      messageElement.style.visibility = 'visible';
-      inputElement.setCustomValidity(message);
-    } else {
-      inputElement.classList.remove(Validation.ERROR_FIELD_CLASS);
-      messageElement.style.visibility = 'hidden';
-      inputElement.setCustomValidity(message);
-    }
-  }
+  public setError(inputElement: HTMLInputElement, messageElement: HTMLElement, data: IMessageBusValidateField) {}
 
   public setOnKeyDownProperties(element: HTMLInputElement, event: KeyboardEvent) {

[Survived] ConditionalExpression
core/shared/validation/Validation.ts:266:38
 
   public setError(inputElement: HTMLInputElement, messageElement: HTMLElement, data: IMessageBusValidateField) {
     const { message } = data;
-    if (message && messageElement && messageElement.innerText !== VALIDATION_ERROR_PATTERN_MISMATCH) {
+    if (message && messageElement && true) {
       messageElement.innerText = this._translator.translate(message);
       inputElement.classList.add(Validation.ERROR_FIELD_CLASS);

[Survived] ConditionalExpression
core/shared/validation/Validation.ts:266:38
 
   public setError(inputElement: HTMLInputElement, messageElement: HTMLElement, data: IMessageBusValidateField) {
     const { message } = data;
-    if (message && messageElement && messageElement.innerText !== VALIDATION_ERROR_PATTERN_MISMATCH) {
+    if (message && messageElement && false) {
       messageElement.innerText = this._translator.translate(message);
       inputElement.classList.add(Validation.ERROR_FIELD_CLASS);

[Survived] BlockStatement
core/shared/validation/Validation.ts:271:12
       inputElement.classList.add(Validation.ERROR_FIELD_CLASS);
       messageElement.style.visibility = 'visible';
       inputElement.setCustomValidity(message);
-    } else {
-      inputElement.classList.remove(Validation.ERROR_FIELD_CLASS);
-      messageElement.style.visibility = 'hidden';
-      inputElement.setCustomValidity(message);
-    }
+    } else {}
   }
 

[Survived] StringLiteral
core/shared/validation/Validation.ts:273:41
       inputElement.setCustomValidity(message);
     } else {
       inputElement.classList.remove(Validation.ERROR_FIELD_CLASS);
-      messageElement.style.visibility = 'hidden';
+      messageElement.style.visibility = "";
       inputElement.setCustomValidity(message);
     }

[Survived] BlockStatement
core/shared/validation/Validation.ts:278:82
     }
   }
 
-  public setOnKeyDownProperties(element: HTMLInputElement, event: KeyboardEvent) {
-    this._currentKeyCode = event.keyCode;
-    this._selectionRangeStart = element.selectionStart;
-    this._selectionRangeEnd = element.selectionEnd;
-  }
+  public setOnKeyDownProperties(element: HTMLInputElement, event: KeyboardEvent) {}
 
   public setFormValidity(state: any) {

[Survived] BlockStatement
core/shared/validation/Validation.ts:284:38
     this._selectionRangeEnd = element.selectionEnd;
   }
 
-  public setFormValidity(state: any) {
-    const validationEvent: IMessageBusEvent = {
-      data: { ...state },
-      type: MessageBus.EVENTS.VALIDATE_FORM
-    };
-    this._messageBus.publish(validationEvent);
-  }
+  public setFormValidity(state: any) {}
 
   public validate(inputElement: HTMLInputElement, messageElement: HTMLElement, customErrorMessage?: string): void {

[Survived] BlockStatement
core/shared/validation/Validation.ts:292:115
     this._messageBus.publish(validationEvent);
   }
 
-  public validate(inputElement: HTMLInputElement, messageElement: HTMLElement, customErrorMessage?: string): void {
-    this._toggleErrorClass(inputElement);
-    this._toggleErrorContainer(inputElement, messageElement);
-    this._setMessage(inputElement, messageElement, customErrorMessage);
-  }
+  public validate(inputElement: HTMLInputElement, messageElement: HTMLElement, customErrorMessage?: string): void {}
 
   public init() {

[Survived] BlockStatement
core/shared/validation/Validation.ts:298:17
     this._setMessage(inputElement, messageElement, customErrorMessage);
   }
 
-  public init() {
-    this._matchDigitsRegexp = new RegExp(Validation.MATCH_DIGITS);
-    this._translator = new Translator(this._frame.parseUrl().locale);
-  }
+  public init() {}
 
   public removeNonDigits(value: string): string {

[Survived] BlockStatement
core/shared/validation/Validation.ts:303:49
     this._translator = new Translator(this._frame.parseUrl().locale);
   }
 
-  public removeNonDigits(value: string): string {
-    if (value) {
-      return value.replace(Validation.MATCH_CHARS, Validation.CLEAR_VALUE);
-    }
-  }
+  public removeNonDigits(value: string): string {}
 
   public getCardDetails(cardNumber: string = Validation.CLEAR_VALUE): BrandDetailsType {

[Survived] BlockStatement
core/shared/validation/Validation.ts:304:16
   }
 
   public removeNonDigits(value: string): string {
-    if (value) {
-      return value.replace(Validation.MATCH_CHARS, Validation.CLEAR_VALUE);
-    }
+    if (value) {}
   }
 

[Survived] ConditionalExpression
core/shared/validation/Validation.ts:304:9
   }
 
   public removeNonDigits(value: string): string {
-    if (value) {
+    if (true) {
       return value.replace(Validation.MATCH_CHARS, Validation.CLEAR_VALUE);
     }

[Survived] BlockStatement
core/shared/validation/Validation.ts:309:88
     }
   }
 
-  public getCardDetails(cardNumber: string = Validation.CLEAR_VALUE): BrandDetailsType {
-    return iinLookup.lookup(cardNumber);
-  }
+  public getCardDetails(cardNumber: string = Validation.CLEAR_VALUE): BrandDetailsType {}
 
   public cardNumber(value: string) {

[Survived] BlockStatement
core/shared/validation/Validation.ts:313:36
     return iinLookup.lookup(cardNumber);
   }
 
-  public cardNumber(value: string) {
-    this.cardNumberValue = this.removeNonDigits(value);
-    this.cardDetails = this.getCardDetails(this.cardNumberValue);
-    const length = this.cardDetails.type
-      ? Utils.getLastElementOfArray(this.cardDetails.length)
-      : Validation.CARD_NUMBER_DEFAULT_LENGTH;
-    this.cardNumberValue = this.limitLength(this.cardNumberValue, length);
-  }
+  public cardNumber(value: string) {}
 
   public expirationDate(value: string) {

[Survived] BlockStatement
core/shared/validation/Validation.ts:322:40
     this.cardNumberValue = this.limitLength(this.cardNumberValue, length);
   }
 
-  public expirationDate(value: string) {
-    this.expirationDateValue = value ? this.removeNonDigits(value) : Validation.CLEAR_VALUE;
-  }
+  public expirationDate(value: string) {}
 
   public securityCode(value: string, length: number) {

[Survived] BlockStatement
core/shared/validation/Validation.ts:326:54
     this.expirationDateValue = value ? this.removeNonDigits(value) : Validation.CLEAR_VALUE;
   }
 
-  public securityCode(value: string, length: number) {
-    this.securityCodeValue = value ? this.limitLength(this.removeNonDigits(value), length) : Validation.CLEAR_VALUE;
-  }
+  public securityCode(value: string, length: number) {}
 
   private _broadcastFormFieldError(errordata: string, event: IMessageBusEvent) {

[Survived] BlockStatement
core/shared/validation/Validation.ts:330:80
     this.securityCodeValue = value ? this.limitLength(this.removeNonDigits(value), length) : Validation.CLEAR_VALUE;
   }
 
-  private _broadcastFormFieldError(errordata: string, event: IMessageBusEvent) {
-    this._messageBus.publish(Validation._setValidateEvent(errordata, event));
-  }
+  private _broadcastFormFieldError(errordata: string, event: IMessageBusEvent) {}
 
   private _getTranslation(

[Survived] BlockStatement
core/shared/validation/Validation.ts:340:13
     validityState: string,
     messageElement?: HTMLElement,
     customErrorMessage?: string
-  ): string {
-    if (messageElement && customErrorMessage && !isCardNumberInput) {
-      return this._translator.translate(customErrorMessage);
-    } else if (messageElement && inputElement.value && isCardNumberInput && !inputElement.validity.valid) {
-      return this._translator.translate(VALIDATION_ERROR_PATTERN_MISMATCH);
-    } else {
-      return this._translator.translate(validityState);
-    }
-  }
+  ): string {}
 
   private _isFormReadyToSubmit(): boolean {

[Survived] BooleanLiteral
core/shared/validation/Validation.ts:341:49
     messageElement?: HTMLElement,
     customErrorMessage?: string
   ): string {
-    if (messageElement && customErrorMessage && !isCardNumberInput) {
+    if (messageElement && customErrorMessage && isCardNumberInput) {
       return this._translator.translate(customErrorMessage);
     } else if (messageElement && inputElement.value && isCardNumberInput && !inputElement.validity.valid) {

[Survived] BlockStatement
core/shared/validation/Validation.ts:341:69
     messageElement?: HTMLElement,
     customErrorMessage?: string
   ): string {
-    if (messageElement && customErrorMessage && !isCardNumberInput) {
-      return this._translator.translate(customErrorMessage);
-    } else if (messageElement && inputElement.value && isCardNumberInput && !inputElement.validity.valid) {
+    if (messageElement && customErrorMessage && !isCardNumberInput) {} else if (messageElement && inputElement.value && isCardNumberInput && !inputElement.validity.valid) {
       return this._translator.translate(VALIDATION_ERROR_PATTERN_MISMATCH);
     } else {

[Survived] ConditionalExpression
core/shared/validation/Validation.ts:343:16
   ): string {
     if (messageElement && customErrorMessage && !isCardNumberInput) {
       return this._translator.translate(customErrorMessage);
-    } else if (messageElement && inputElement.value && isCardNumberInput && !inputElement.validity.valid) {
+    } else if (true) {
       return this._translator.translate(VALIDATION_ERROR_PATTERN_MISMATCH);
     } else {

[Survived] ConditionalExpression
core/shared/validation/Validation.ts:343:16
   ): string {
     if (messageElement && customErrorMessage && !isCardNumberInput) {
       return this._translator.translate(customErrorMessage);
-    } else if (messageElement && inputElement.value && isCardNumberInput && !inputElement.validity.valid) {
+    } else if (true && !inputElement.validity.valid) {
       return this._translator.translate(VALIDATION_ERROR_PATTERN_MISMATCH);
     } else {

[Survived] BlockStatement
core/shared/validation/Validation.ts:345:12
       return this._translator.translate(customErrorMessage);
     } else if (messageElement && inputElement.value && isCardNumberInput && !inputElement.validity.valid) {
       return this._translator.translate(VALIDATION_ERROR_PATTERN_MISMATCH);
-    } else {
-      return this._translator.translate(validityState);
-    }
+    } else {}
   }
 

[Survived] BlockStatement
core/shared/validation/Validation.ts:350:43
     }
   }
 
-  private _isFormReadyToSubmit(): boolean {
-    return this._isPaymentReady && this._formValidity;
-  }
+  private _isFormReadyToSubmit(): boolean {}
 
   private _isPressedKeyBackspace(): boolean {

[Survived] ConditionalExpression
core/shared/validation/Validation.ts:351:12
   }
 
   private _isFormReadyToSubmit(): boolean {
-    return this._isPaymentReady && this._formValidity;
+    return false;
   }
 

[Survived] LogicalOperator
core/shared/validation/Validation.ts:351:12
   }
 
   private _isFormReadyToSubmit(): boolean {
-    return this._isPaymentReady && this._formValidity;
+    return this._isPaymentReady || this._formValidity;
   }
 

[Survived] BlockStatement
core/shared/validation/Validation.ts:354:45
     return this._isPaymentReady && this._formValidity;
   }
 
-  private _isPressedKeyBackspace(): boolean {
-    return this._currentKeyCode === Validation.BACKSPACE_KEY_CODE;
-  }
+  private _isPressedKeyBackspace(): boolean {}
 
   private _isPressedKeyDelete(): boolean {

[Survived] ConditionalExpression
core/shared/validation/Validation.ts:355:12
   }
 
   private _isPressedKeyBackspace(): boolean {
-    return this._currentKeyCode === Validation.BACKSPACE_KEY_CODE;
+    return true;
   }
 

[Survived] EqualityOperator
core/shared/validation/Validation.ts:355:12
   }
 
   private _isPressedKeyBackspace(): boolean {
-    return this._currentKeyCode === Validation.BACKSPACE_KEY_CODE;
+    return this._currentKeyCode !== Validation.BACKSPACE_KEY_CODE;
   }
 

[Survived] BlockStatement
core/shared/validation/Validation.ts:358:42
     return this._currentKeyCode === Validation.BACKSPACE_KEY_CODE;
   }
 
-  private _isPressedKeyDelete(): boolean {
-    return this._currentKeyCode === Validation.DELETE_KEY_CODE;
-  }
+  private _isPressedKeyDelete(): boolean {}
 
   private _setMessage(inputElement: HTMLInputElement, messageElement: HTMLElement, customErrorMessage?: string) {

[Survived] ConditionalExpression
core/shared/validation/Validation.ts:359:12
   }
 
   private _isPressedKeyDelete(): boolean {
-    return this._currentKeyCode === Validation.DELETE_KEY_CODE;
+    return true;
   }
 

[Survived] ConditionalExpression
core/shared/validation/Validation.ts:359:12
   }
 
   private _isPressedKeyDelete(): boolean {
-    return this._currentKeyCode === Validation.DELETE_KEY_CODE;
+    return false;
   }
 

[Survived] BlockStatement
core/shared/validation/Validation.ts:362:113
     return this._currentKeyCode === Validation.DELETE_KEY_CODE;
   }
 
-  private _setMessage(inputElement: HTMLInputElement, messageElement: HTMLElement, customErrorMessage?: string) {
-    const isCardNumberInput: boolean = inputElement.getAttribute(Validation.ID_PARAM_NAME) === CARD_NUMBER_INPUT;
-    const validityState = Validation.getValidationMessage(inputElement.validity);
-    messageElement.innerText = this._getTranslation(
-      inputElement,
-      isCardNumberInput,
-      validityState,
-      messageElement,
-      customErrorMessage
-    );
-  }
+  private _setMessage(inputElement: HTMLInputElement, messageElement: HTMLElement, customErrorMessage?: string) {}
 
   private _toggleErrorContainer(inputElement: HTMLInputElement, messageElement: HTMLElement): void {

[Survived] EqualityOperator
core/shared/validation/Validation.ts:363:40
   }
 
   private _setMessage(inputElement: HTMLInputElement, messageElement: HTMLElement, customErrorMessage?: string) {
-    const isCardNumberInput: boolean = inputElement.getAttribute(Validation.ID_PARAM_NAME) === CARD_NUMBER_INPUT;
+    const isCardNumberInput: boolean = inputElement.getAttribute(Validation.ID_PARAM_NAME) !== CARD_NUMBER_INPUT;
     const validityState = Validation.getValidationMessage(inputElement.validity);
     messageElement.innerText = this._getTranslation(

[Survived] ConditionalExpression
core/shared/validation/Validation.ts:363:40
   }
 
   private _setMessage(inputElement: HTMLInputElement, messageElement: HTMLElement, customErrorMessage?: string) {
-    const isCardNumberInput: boolean = inputElement.getAttribute(Validation.ID_PARAM_NAME) === CARD_NUMBER_INPUT;
+    const isCardNumberInput: boolean = false;
     const validityState = Validation.getValidationMessage(inputElement.validity);
     messageElement.innerText = this._getTranslation(

[Survived] BlockStatement
core/shared/validation/Validation.ts:374:100
     );
   }
 
-  private _toggleErrorContainer(inputElement: HTMLInputElement, messageElement: HTMLElement): void {
-    inputElement.validity.valid
-      ? (messageElement.style.visibility = 'hidden')
-      : (messageElement.style.visibility = 'visible');
-  }
+  private _toggleErrorContainer(inputElement: HTMLInputElement, messageElement: HTMLElement): void {}
 
   private _toggleErrorClass(inputElement: HTMLInputElement): void {

[Survived] BlockStatement
core/shared/validation/Validation.ts:380:67
       : (messageElement.style.visibility = 'visible');
   }
 
-  private _toggleErrorClass(inputElement: HTMLInputElement): void {
-    inputElement.validity.valid
-      ? inputElement.classList.remove(Validation.ERROR_FIELD_CLASS)
-      : inputElement.classList.add(Validation.ERROR_FIELD_CLASS);
-  }
+  private _toggleErrorClass(inputElement: HTMLInputElement): void {}
 
   private _setValidationResult(

[Survived] BlockStatement
core/shared/validation/Validation.ts:396:5
     },
     isPanPiba: boolean,
     paymentReady: boolean
-  ) {
-    if (dataInJwt) {
-      this._formValidity = true;
-      this._isPaymentReady = true;
-    } else {
-      this._formValidity = Validation._isFormValid(formFields, fieldsToSubmit, isPanPiba);
-      this._isPaymentReady = paymentReady;
-      this._card = {
-        expirydate: formFields.expirationDate.value,
-        pan: formFields.cardNumber.value,
-        securitycode: formFields.securityCode.value
-      };
-    }
-  }
+  ) {}
 }
 

[Survived] BlockStatement
core/shared/validation/Validation.ts:397:20
     isPanPiba: boolean,
     paymentReady: boolean
   ) {
-    if (dataInJwt) {
-      this._formValidity = true;
-      this._isPaymentReady = true;
-    } else {
+    if (dataInJwt) {} else {
       this._formValidity = Validation._isFormValid(formFields, fieldsToSubmit, isPanPiba);
       this._isPaymentReady = paymentReady;

[Survived] ConditionalExpression
core/shared/validation/Validation.ts:397:9
     isPanPiba: boolean,
     paymentReady: boolean
   ) {
-    if (dataInJwt) {
+    if (false) {
       this._formValidity = true;
       this._isPaymentReady = true;

[Survived] BooleanLiteral
core/shared/validation/Validation.ts:398:28
     paymentReady: boolean
   ) {
     if (dataInJwt) {
-      this._formValidity = true;
+      this._formValidity = false;
       this._isPaymentReady = true;
     } else {

[Survived] BooleanLiteral
core/shared/validation/Validation.ts:399:30
   ) {
     if (dataInJwt) {
       this._formValidity = true;
-      this._isPaymentReady = true;
+      this._isPaymentReady = false;
     } else {
       this._formValidity = Validation._isFormValid(formFields, fieldsToSubmit, isPanPiba);

[Survived] BlockStatement
core/shared/validation/Validation.ts:400:12
     if (dataInJwt) {
       this._formValidity = true;
       this._isPaymentReady = true;
-    } else {
-      this._formValidity = Validation._isFormValid(formFields, fieldsToSubmit, isPanPiba);
-      this._isPaymentReady = paymentReady;
-      this._card = {
-        expirydate: formFields.expirationDate.value,
-        pan: formFields.cardNumber.value,
-        securitycode: formFields.securityCode.value
-      };
-    }
+    } else {}
   }
 }
