[Survived] BlockStatement
application/core/store/Store.ts:15:53
 export class Store {
   private readonly state$: Observable<IState>;
 
-  constructor(private storeAccessor: StoreAccessor) {
-    this.state$ = new Observable<IState>(observer => {
-      observer.next(this.store.getState() as IState);
-
-      return this.store.subscribe(() => {
-        observer.next(this.store.getState() as IState);
-      });
-    }).pipe(shareReplay(1));
-  }
+  constructor(private storeAccessor: StoreAccessor) {}
 
   getState(): IState {

[Survived] BlockStatement
application/core/store/Store.ts:16:54
   private readonly state$: Observable<IState>;
 
   constructor(private storeAccessor: StoreAccessor) {
-    this.state$ = new Observable<IState>(observer => {
-      observer.next(this.store.getState() as IState);
-
-      return this.store.subscribe(() => {
-        observer.next(this.store.getState() as IState);
-      });
-    }).pipe(shareReplay(1));
+    this.state$ = new Observable<IState>(observer => {}).pipe(shareReplay(1));
   }
 

[Survived] BlockStatement
application/core/store/Store.ts:19:41
     this.state$ = new Observable<IState>(observer => {
       observer.next(this.store.getState() as IState);
 
-      return this.store.subscribe(() => {
-        observer.next(this.store.getState() as IState);
-      });
+      return this.store.subscribe(() => {});
     }).pipe(shareReplay(1));
   }

[Survived] BlockStatement
application/core/store/Store.ts:25:22
     }).pipe(shareReplay(1));
   }
 
-  getState(): IState {
-    return this.store.getState();
-  }
+  getState(): IState {}
 
   dispatch<T extends ActionName>(action: IAction<T>): void {

[Survived] BlockStatement
application/core/store/Store.ts:29:60
     return this.store.getState();
   }
 
-  dispatch<T extends ActionName>(action: IAction<T>): void {
-    this.store.dispatch(action);
-  }
+  dispatch<T extends ActionName>(action: IAction<T>): void {}
 
   select$<T>(selector: (state: IState) => T): Observable<T> {

[Survived] BlockStatement
application/core/store/Store.ts:33:61
     this.store.dispatch(action);
   }
 
-  select$<T>(selector: (state: IState) => T): Observable<T> {
-    return this.state$.pipe(map(selector));
-  }
+  select$<T>(selector: (state: IState) => T): Observable<T> {}
 
   subscribe<T>(observer?: PartialObserver<IMessageBusEvent<T>>): Unsubscribable;

[Survived] BlockStatement
application/core/store/Store.ts:45:45
     complete?: () => void
   ): Unsubscribable;
 
-  subscribe(...args: any[]): Unsubscribable {
-    return this.state$.subscribe.apply(this.state$, args);
-  }
+  subscribe(...args: any[]): Unsubscribable {}
 
   private get store(): ReduxStore {

[Survived] BlockStatement
application/core/store/Store.ts:49:35
     return this.state$.subscribe.apply(this.state$, args);
   }
 
-  private get store(): ReduxStore {
-    return this.storeAccessor.getStore();
-  }
+  private get store(): ReduxStore {}
 }
 
