[Survived] BlockStatement
application/core/store/StoreFactory.ts:14:24
 
 @Service()
 export class StoreFactory {
-  createStore(): Store {
-    const epicMiddleware = createEpicMiddleware();
-    const middlewares: any[] = [epicMiddleware];
-
-    if (!environment.production) {
-      middlewares.push(logger);
-    }
-
-    const store = createStore(this.getRootReducer(), applyMiddleware(...middlewares));
-
-    epicMiddleware.run(this.getRootEpic());
-
-    return store;
-  }
+  createStore(): Store {}
 
   private getRootReducer(): Reducer {

[Survived] ConditionalExpression
application/core/store/StoreFactory.ts:18:9
     const epicMiddleware = createEpicMiddleware();
     const middlewares: any[] = [epicMiddleware];
 
-    if (!environment.production) {
+    if (true) {
       middlewares.push(logger);
     }

[Survived] BooleanLiteral
application/core/store/StoreFactory.ts:18:9
     const epicMiddleware = createEpicMiddleware();
     const middlewares: any[] = [epicMiddleware];
 
-    if (!environment.production) {
+    if (environment.production) {
       middlewares.push(logger);
     }

[Survived] BlockStatement
application/core/store/StoreFactory.ts:29:37
     return store;
   }
 
-  private getRootReducer(): Reducer {
-    return combineReducers({
-      config: configReducer,
-      storage: storageReducer
-    });
-  }
+  private getRootReducer(): Reducer {}
 
   private getRootEpic(): Epic<IAction> {

[Survived] ObjectLiteral
application/core/store/StoreFactory.ts:30:28
   }
 
   private getRootReducer(): Reducer {
-    return combineReducers({
-      config: configReducer,
-      storage: storageReducer
-    });
+    return combineReducers({});
   }
 

[Survived] BlockStatement
application/core/store/StoreFactory.ts:36:40
     });
   }
 
-  private getRootEpic(): Epic<IAction> {
-    const epics = [dummyEpic];
-
-    return (action$, store$, dependencies) => {
-      return combineEpics(...epics)(action$, store$, dependencies).pipe(
-        catchError((error, source) => {
-          console.error(error);
-
-          return source;
-        })
-      );
-    };
-  }
+  private getRootEpic(): Epic<IAction> {}
 }
 

[Survived] BlockStatement
application/core/store/StoreFactory.ts:39:47
   private getRootEpic(): Epic<IAction> {
     const epics = [dummyEpic];
 
-    return (action$, store$, dependencies) => {
-      return combineEpics(...epics)(action$, store$, dependencies).pipe(
-        catchError((error, source) => {
-          console.error(error);
-
-          return source;
-        })
-      );
-    };
+    return (action$, store$, dependencies) => {};
   }
 }

[Survived] BlockStatement
application/core/store/StoreFactory.ts:41:39
 
     return (action$, store$, dependencies) => {
       return combineEpics(...epics)(action$, store$, dependencies).pipe(
-        catchError((error, source) => {
-          console.error(error);
-
-          return source;
-        })
+        catchError((error, source) => {})
       );
     };
