[Survived] BlockStatement
application/core/store/createReducer.ts:7:100
 type Handler<S, K extends ActionName> = (state: S, action: IAction<K>) => S;
 type ActionHandlerTuple<S> = [ActionName, Handler<S, ActionName>];
 
-export function on<S, K extends ActionName>(action: K, handler: Handler<S, K>): [K, Handler<S, K>] {
-  return [action, handler];
-}
+export function on<S, K extends ActionName>(action: K, handler: Handler<S, K>): [K, Handler<S, K>] {}
 
 export function createReducer<S>(initialState: S, ...handlers: ActionHandlerTuple<S>[]): Reducer<S, IAction> {

[Survived] ArrayDeclaration
application/core/store/createReducer.ts:8:10
 type ActionHandlerTuple<S> = [ActionName, Handler<S, ActionName>];
 
 export function on<S, K extends ActionName>(action: K, handler: Handler<S, K>): [K, Handler<S, K>] {
-  return [action, handler];
+  return [];
 }
 

[Survived] BlockStatement
application/core/store/createReducer.ts:11:110
   return [action, handler];
 }
 
-export function createReducer<S>(initialState: S, ...handlers: ActionHandlerTuple<S>[]): Reducer<S, IAction> {
-  const handlersMap = new Map<ActionName, Handler<S, ActionName>>();
-
-  handlers.forEach(([actionName, handler]) => {
-    handlersMap.set(actionName, handler);
-  });
-
-  return (state: S = initialState, action: IAction) => {
-    if (handlersMap.has(action.type)) {
-      return handlersMap.get(action.type)(state, action);
-    }
-
-    return state;
-  };
-}
+export function createReducer<S>(initialState: S, ...handlers: ActionHandlerTuple<S>[]): Reducer<S, IAction> {}
 

[Survived] BlockStatement
application/core/store/createReducer.ts:14:47
 export function createReducer<S>(initialState: S, ...handlers: ActionHandlerTuple<S>[]): Reducer<S, IAction> {
   const handlersMap = new Map<ActionName, Handler<S, ActionName>>();
 
-  handlers.forEach(([actionName, handler]) => {
-    handlersMap.set(actionName, handler);
-  });
+  handlers.forEach(([actionName, handler]) => {});
 
   return (state: S = initialState, action: IAction) => {

[Survived] BlockStatement
application/core/store/createReducer.ts:18:56
     handlersMap.set(actionName, handler);
   });
 
-  return (state: S = initialState, action: IAction) => {
-    if (handlersMap.has(action.type)) {
-      return handlersMap.get(action.type)(state, action);
-    }
-
-    return state;
-  };
+  return (state: S = initialState, action: IAction) => {};
 }
 

[Survived] BlockStatement
application/core/store/createReducer.ts:19:39
   });
 
   return (state: S = initialState, action: IAction) => {
-    if (handlersMap.has(action.type)) {
-      return handlersMap.get(action.type)(state, action);
-    }
+    if (handlersMap.has(action.type)) {}
 
     return state;

[Survived] ConditionalExpression
application/core/store/createReducer.ts:19:9
   });
 
   return (state: S = initialState, action: IAction) => {
-    if (handlersMap.has(action.type)) {
+    if (false) {
       return handlersMap.get(action.type)(state, action);
     }
