[Survived] ArrowFunction
core/store/epics/dummyEpic.ts:8:41
 import { ofType } from '../operators/ofType';
 import { EMPTY } from 'rxjs';
 
-export const dummyEpic: Epic<IAction> = action$ =>
-  action$.pipe(
-    ofType(UPDATE_CONFIG),
-    mapTo({ type: 'FOO' as ActionName })
-    // switchMap(() => EMPTY),
-  );
+export const dummyEpic: Epic<IAction> = () => undefined;
 
