[Survived] BlockStatement
core/store/operators/ofType.ts:5:55
 import { filter } from 'rxjs/operators';
 import { ActionName, IAction } from '../IAction';
 
-export function ofType<T extends ActionName>(type: T) {
-  return (source: Observable<IAction<T>>): Observable<IAction<T>> => source.pipe(filter(event => event.type === type));
-}
+export function ofType<T extends ActionName>(type: T) {}
 

[Survived] ArrowFunction
core/store/operators/ofType.ts:6:10
 import { ActionName, IAction } from '../IAction';
 
 export function ofType<T extends ActionName>(type: T) {
-  return (source: Observable<IAction<T>>): Observable<IAction<T>> => source.pipe(filter(event => event.type === type));
+  return () => undefined;
 }
 

[Survived] ArrowFunction
core/store/operators/ofType.ts:6:89
 import { ActionName, IAction } from '../IAction';
 
 export function ofType<T extends ActionName>(type: T) {
-  return (source: Observable<IAction<T>>): Observable<IAction<T>> => source.pipe(filter(event => event.type === type));
+  return (source: Observable<IAction<T>>): Observable<IAction<T>> => source.pipe(filter(() => undefined));
 }
 
