[Survived] ArrowFunction
store/reducers/config/ConfigReducer.ts:7:21
 
 export const configReducer = createReducer<IConfigState>(
   INITIAL_STATE,
-  on(UPDATE_CONFIG, (state, action) => ({ ...state, config: action.payload })),
+  on(UPDATE_CONFIG, () => undefined),
   on(CLEAR_CONFIG, state => ({ ...state, config: null }))
 );

[Survived] ArrowFunction
store/reducers/config/ConfigReducer.ts:8:20
 export const configReducer = createReducer<IConfigState>(
   INITIAL_STATE,
   on(UPDATE_CONFIG, (state, action) => ({ ...state, config: action.payload })),
-  on(CLEAR_CONFIG, state => ({ ...state, config: null }))
+  on(CLEAR_CONFIG, () => undefined)
 );
 
