[Survived] ObjectLiteral
store/reducers/config/IConfigState.ts:7:44
   config: IConfig;
 }
 
-export const INITIAL_STATE: IConfigState = {
-  config: null
-};
+export const INITIAL_STATE: IConfigState = {};
 
