[Survived] ArrowFunction
store/reducers/storage/StorageReducer.ts:7:16
 
 export const storageReducer = createReducer<IStorageState>(
   INITIAL_STATE,
-  on(SET_ITEM, (state, action) => ({ ...state, [action.payload.key]: action.payload.value }))
+  on(SET_ITEM, () => undefined)
 );
 
