[Survived] BlockStatement
trust-payments/js-payments/src/bootstrap.ts:5:29
 import { WINDOW } from './shared/dependency-injection/InjectionTokens';
 import './testing/ServicesOverrides';
 
-if (!Container.has(WINDOW)) {
-  Container.set(WINDOW, window);
-}
+if (!Container.has(WINDOW)) {}
 
 if (!Container.has(ContainerInstance)) {

[Survived] ConditionalExpression
trust-payments/js-payments/src/bootstrap.ts:5:5
 import { WINDOW } from './shared/dependency-injection/InjectionTokens';
 import './testing/ServicesOverrides';
 
-if (!Container.has(WINDOW)) {
+if (false) {
   Container.set(WINDOW, window);
 }

[Survived] ConditionalExpression
trust-payments/js-payments/src/bootstrap.ts:9:5
   Container.set(WINDOW, window);
 }
 
-if (!Container.has(ContainerInstance)) {
+if (true) {
   Container.set(ContainerInstance, Container.of(undefined));
 }

[Survived] ConditionalExpression
trust-payments/js-payments/src/bootstrap.ts:9:5
   Container.set(WINDOW, window);
 }
 
-if (!Container.has(ContainerInstance)) {
+if (false) {
   Container.set(ContainerInstance, Container.of(undefined));
 }
