[Survived] StringLiteral
src/client/card-frames/CardFrames.class.ts:34:51
 import { PAY, PROCESSING } from '../../application/core/models/constants/Translations';
 
 export class CardFrames {
-  private static CARD_NUMBER_FIELD_NAME: string = 'pan';
+  private static CARD_NUMBER_FIELD_NAME: string = "";
   private static CLICK_EVENT: string = 'click';
   private static COMPLETE_FORM_NUMBER_OF_FIELDS: number = 3;

[Survived] StringLiteral
src/client/card-frames/CardFrames.class.ts:35:40
 
 export class CardFrames {
   private static CARD_NUMBER_FIELD_NAME: string = 'pan';
-  private static CLICK_EVENT: string = 'click';
+  private static CLICK_EVENT: string = "";
   private static COMPLETE_FORM_NUMBER_OF_FIELDS: number = 3;
   private static EXPIRY_DATE_FIELD_NAME: string = 'expirydate';

[Survived] StringLiteral
src/client/card-frames/CardFrames.class.ts:37:51
   private static CARD_NUMBER_FIELD_NAME: string = 'pan';
   private static CLICK_EVENT: string = 'click';
   private static COMPLETE_FORM_NUMBER_OF_FIELDS: number = 3;
-  private static EXPIRY_DATE_FIELD_NAME: string = 'expirydate';
+  private static EXPIRY_DATE_FIELD_NAME: string = "";
   private static INPUT_EVENT: string = 'input';
   private static NO_CVV_CARDS: string[] = ['PIBA'];

[Survived] ArrayDeclaration
src/client/card-frames/CardFrames.class.ts:39:43
   private static COMPLETE_FORM_NUMBER_OF_FIELDS: number = 3;
   private static EXPIRY_DATE_FIELD_NAME: string = 'expirydate';
   private static INPUT_EVENT: string = 'input';
-  private static NO_CVV_CARDS: string[] = ['PIBA'];
+  private static NO_CVV_CARDS: string[] = [];
   private static ONLY_CVV_NUMBER_OF_FIELDS: number = 1;
   private static SUBMIT_EVENT: string = 'submit';

[Survived] StringLiteral
src/client/card-frames/CardFrames.class.ts:44:58
   private static SUBMIT_EVENT: string = 'submit';
   private static SECURITY_CODE_FIELD_NAME: string = 'securitycode';
   private static SUBMIT_BUTTON_AS_BUTTON_MARKUP: string = 'button[type="submit"]';
-  private static SUBMIT_BUTTON_AS_INPUT_MARKUP: string = 'input[type="submit"]';
+  private static SUBMIT_BUTTON_AS_INPUT_MARKUP: string = "";
   private static SUBMIT_BUTTON_DISABLED_CLASS: string = 'st-button-submit__disabled';
 

[Survived] ObjectLiteral
src/client/card-frames/CardFrames.class.ts:53:48
   private _securityCode: HTMLIFrameElement;
   private _validation: Validation;
   private _translator: Translator;
-  private _messageBusEvent: IMessageBusEvent = { data: { message: '' }, type: '' };
+  private _messageBusEvent: IMessageBusEvent = {};
   private _submitButton: HTMLInputElement | HTMLButtonElement;
   private _buttonId: string;

[Survived] StringLiteral
src/client/card-frames/CardFrames.class.ts:53:67
   private _securityCode: HTMLIFrameElement;
   private _validation: Validation;
   private _translator: Translator;
-  private _messageBusEvent: IMessageBusEvent = { data: { message: '' }, type: '' };
+  private _messageBusEvent: IMessageBusEvent = { data: { message: "Stryker was here!" }, type: '' };
   private _submitButton: HTMLInputElement | HTMLButtonElement;
   private _buttonId: string;

[Survived] BlockStatement
src/client/card-frames/CardFrames.class.ts:95:5
     private _iframeFactory: IframeFactory,
     private _frame: Frame,
     private _messageBus: MessageBus
-  ) {
-    this.fieldsToSubmit = fieldsToSubmit || ['pan', 'expirydate', 'securitycode'];
-    this.elementsToRegister = [];
-    this.componentIds = componentIds;
-    this.formId = formId;
-    this.jwt = jwt;
-    this.origin = origin;
-    this.styles = this._getStyles(styles);
-    this._stJwt = new StJwt(jwt);
-    this.params = { locale: this._stJwt.locale, origin: this.origin };
-    this._config$ = this._configProvider.getConfig$();
-    this._setInitValues(buttonId, defaultPaymentType, paymentTypes, animatedCard, jwt, formId);
-    this.configureFormFieldsAmount(jwt);
-    this._messageBus.subscribe(MessageBus.EVENTS_PUBLIC.UNLOCK_BUTTON, () => {
-      this._disableSubmitButton(FormState.AVAILABLE);
-    });
-    this.styles = this._getStyles(styles);
-  }
+  ) {}
 
   public init() {

[Survived] LogicalOperator
src/client/card-frames/CardFrames.class.ts:96:27
     private _frame: Frame,
     private _messageBus: MessageBus
   ) {
-    this.fieldsToSubmit = fieldsToSubmit || ['pan', 'expirydate', 'securitycode'];
+    this.fieldsToSubmit = fieldsToSubmit && ['pan', 'expirydate', 'securitycode'];
     this.elementsToRegister = [];
     this.componentIds = componentIds;

[Survived] ConditionalExpression
src/client/card-frames/CardFrames.class.ts:96:27
     private _frame: Frame,
     private _messageBus: MessageBus
   ) {
-    this.fieldsToSubmit = fieldsToSubmit || ['pan', 'expirydate', 'securitycode'];
+    this.fieldsToSubmit = true;
     this.elementsToRegister = [];
     this.componentIds = componentIds;

[Survived] BlockStatement
src/client/card-frames/CardFrames.class.ts:108:78
     this._config$ = this._configProvider.getConfig$();
     this._setInitValues(buttonId, defaultPaymentType, paymentTypes, animatedCard, jwt, formId);
     this.configureFormFieldsAmount(jwt);
-    this._messageBus.subscribe(MessageBus.EVENTS_PUBLIC.UNLOCK_BUTTON, () => {
-      this._disableSubmitButton(FormState.AVAILABLE);
-    });
+    this._messageBus.subscribe(MessageBus.EVENTS_PUBLIC.UNLOCK_BUTTON, () => {});
     this.styles = this._getStyles(styles);
   }

[Survived] BlockStatement
src/client/card-frames/CardFrames.class.ts:114:17
     this.styles = this._getStyles(styles);
   }
 
-  public init() {
-    this._preventFormSubmit();
-    this._createSubmitButton();
-    this._initSubscribes();
-    this._initCardFrames();
-    this.elementsTargets = this.setElementsFields();
-    this.registerElements(this.elementsToRegister, this.elementsTargets);
-  }
+  public init() {}
 
   private _getStyles(styles: any) {

[Survived] BlockStatement
src/client/card-frames/CardFrames.class.ts:123:35
     this.registerElements(this.elementsToRegister, this.elementsTargets);
   }
 
-  private _getStyles(styles: any) {
-    for (const key in styles) {
-      if (styles[key] instanceof Object) {
-        return styles;
-      }
-    }
-    styles = { defaultStyles: styles };
-    return styles;
-  }
+  private _getStyles(styles: any) {}
 
   protected configureFormFieldsAmount(jwt: string): void {

[Survived] BlockStatement
src/client/card-frames/CardFrames.class.ts:124:31
   }
 
   private _getStyles(styles: any) {
-    for (const key in styles) {
-      if (styles[key] instanceof Object) {
-        return styles;
-      }
-    }
+    for (const key in styles) {}
     styles = { defaultStyles: styles };
     return styles;

[Survived] ConditionalExpression
src/client/card-frames/CardFrames.class.ts:125:11
 
   private _getStyles(styles: any) {
     for (const key in styles) {
-      if (styles[key] instanceof Object) {
+      if (true) {
         return styles;
       }

[Survived] ConditionalExpression
src/client/card-frames/CardFrames.class.ts:125:11
 
   private _getStyles(styles: any) {
     for (const key in styles) {
-      if (styles[key] instanceof Object) {
+      if (false) {
         return styles;
       }

[Survived] BlockStatement
src/client/card-frames/CardFrames.class.ts:133:58
     return styles;
   }
 
-  protected configureFormFieldsAmount(jwt: string): void {
-    this._fieldsToSubmitLength = this.fieldsToSubmit.length;
-    this._isCardWithNoCvv = jwt && CardFrames.NO_CVV_CARDS.includes(this._getCardType(jwt));
-    this._noFieldConfiguration =
-      this._fieldsToSubmitLength === CardFrames.ONLY_CVV_NUMBER_OF_FIELDS &&
-      this._isCardWithNoCvv &&
-      this.fieldsToSubmit.includes(CardFrames.SECURITY_CODE_FIELD_NAME);
-    this._onlyCvvConfiguration =
-      this._fieldsToSubmitLength === CardFrames.ONLY_CVV_NUMBER_OF_FIELDS &&
-      !this._isCardWithNoCvv &&
-      this.fieldsToSubmit.includes(CardFrames.SECURITY_CODE_FIELD_NAME);
-    this._configurationForStandardCard =
-      this._fieldsToSubmitLength === CardFrames.COMPLETE_FORM_NUMBER_OF_FIELDS &&
-      this._loadAnimatedCard &&
-      !this._isCardWithNoCvv &&
-      this.fieldsToSubmit.includes(CardFrames.CARD_NUMBER_FIELD_NAME) &&
-      this.fieldsToSubmit.includes(CardFrames.EXPIRY_DATE_FIELD_NAME) &&
-      this.fieldsToSubmit.includes(CardFrames.SECURITY_CODE_FIELD_NAME);
-  }
+  protected configureFormFieldsAmount(jwt: string): void {}
 
   protected registerElements(fields: HTMLElement[], targets: string[]): void {

[Survived] ConditionalExpression
src/client/card-frames/CardFrames.class.ts:135:29
 
   protected configureFormFieldsAmount(jwt: string): void {
     this._fieldsToSubmitLength = this.fieldsToSubmit.length;
-    this._isCardWithNoCvv = jwt && CardFrames.NO_CVV_CARDS.includes(this._getCardType(jwt));
+    this._isCardWithNoCvv = true;
     this._noFieldConfiguration =
       this._fieldsToSubmitLength === CardFrames.ONLY_CVV_NUMBER_OF_FIELDS &&

[Survived] ConditionalExpression
src/client/card-frames/CardFrames.class.ts:135:29
 
   protected configureFormFieldsAmount(jwt: string): void {
     this._fieldsToSubmitLength = this.fieldsToSubmit.length;
-    this._isCardWithNoCvv = jwt && CardFrames.NO_CVV_CARDS.includes(this._getCardType(jwt));
+    this._isCardWithNoCvv = false;
     this._noFieldConfiguration =
       this._fieldsToSubmitLength === CardFrames.ONLY_CVV_NUMBER_OF_FIELDS &&

[Survived] ConditionalExpression
src/client/card-frames/CardFrames.class.ts:137:7
     this._fieldsToSubmitLength = this.fieldsToSubmit.length;
     this._isCardWithNoCvv = jwt && CardFrames.NO_CVV_CARDS.includes(this._getCardType(jwt));
     this._noFieldConfiguration =
-      this._fieldsToSubmitLength === CardFrames.ONLY_CVV_NUMBER_OF_FIELDS &&
-      this._isCardWithNoCvv &&
-      this.fieldsToSubmit.includes(CardFrames.SECURITY_CODE_FIELD_NAME);
+      false;
     this._onlyCvvConfiguration =
       this._fieldsToSubmitLength === CardFrames.ONLY_CVV_NUMBER_OF_FIELDS &&

[Survived] ConditionalExpression
src/client/card-frames/CardFrames.class.ts:137:7
     this._fieldsToSubmitLength = this.fieldsToSubmit.length;
     this._isCardWithNoCvv = jwt && CardFrames.NO_CVV_CARDS.includes(this._getCardType(jwt));
     this._noFieldConfiguration =
-      this._fieldsToSubmitLength === CardFrames.ONLY_CVV_NUMBER_OF_FIELDS &&
-      this._isCardWithNoCvv &&
+      false &&
       this.fieldsToSubmit.includes(CardFrames.SECURITY_CODE_FIELD_NAME);
     this._onlyCvvConfiguration =

[Survived] LogicalOperator
src/client/card-frames/CardFrames.class.ts:141:7
       this._isCardWithNoCvv &&
       this.fieldsToSubmit.includes(CardFrames.SECURITY_CODE_FIELD_NAME);
     this._onlyCvvConfiguration =
-      this._fieldsToSubmitLength === CardFrames.ONLY_CVV_NUMBER_OF_FIELDS &&
-      !this._isCardWithNoCvv &&
-      this.fieldsToSubmit.includes(CardFrames.SECURITY_CODE_FIELD_NAME);
+      this._fieldsToSubmitLength === CardFrames.ONLY_CVV_NUMBER_OF_FIELDS && !this._isCardWithNoCvv || this.fieldsToSubmit.includes(CardFrames.SECURITY_CODE_FIELD_NAME);
     this._configurationForStandardCard =
       this._fieldsToSubmitLength === CardFrames.COMPLETE_FORM_NUMBER_OF_FIELDS &&

[Survived] EqualityOperator
src/client/card-frames/CardFrames.class.ts:141:7
       this._isCardWithNoCvv &&
       this.fieldsToSubmit.includes(CardFrames.SECURITY_CODE_FIELD_NAME);
     this._onlyCvvConfiguration =
-      this._fieldsToSubmitLength === CardFrames.ONLY_CVV_NUMBER_OF_FIELDS &&
+      this._fieldsToSubmitLength !== CardFrames.ONLY_CVV_NUMBER_OF_FIELDS &&
       !this._isCardWithNoCvv &&
       this.fieldsToSubmit.includes(CardFrames.SECURITY_CODE_FIELD_NAME);

[Survived] BooleanLiteral
src/client/card-frames/CardFrames.class.ts:142:7
       this.fieldsToSubmit.includes(CardFrames.SECURITY_CODE_FIELD_NAME);
     this._onlyCvvConfiguration =
       this._fieldsToSubmitLength === CardFrames.ONLY_CVV_NUMBER_OF_FIELDS &&
-      !this._isCardWithNoCvv &&
+      this._isCardWithNoCvv &&
       this.fieldsToSubmit.includes(CardFrames.SECURITY_CODE_FIELD_NAME);
     this._configurationForStandardCard =

[Survived] ConditionalExpression
src/client/card-frames/CardFrames.class.ts:145:7
       !this._isCardWithNoCvv &&
       this.fieldsToSubmit.includes(CardFrames.SECURITY_CODE_FIELD_NAME);
     this._configurationForStandardCard =
-      this._fieldsToSubmitLength === CardFrames.COMPLETE_FORM_NUMBER_OF_FIELDS &&
-      this._loadAnimatedCard &&
-      !this._isCardWithNoCvv &&
-      this.fieldsToSubmit.includes(CardFrames.CARD_NUMBER_FIELD_NAME) &&
-      this.fieldsToSubmit.includes(CardFrames.EXPIRY_DATE_FIELD_NAME) &&
-      this.fieldsToSubmit.includes(CardFrames.SECURITY_CODE_FIELD_NAME);
+      true;
   }
 

[Survived] ConditionalExpression
src/client/card-frames/CardFrames.class.ts:145:7
       !this._isCardWithNoCvv &&
       this.fieldsToSubmit.includes(CardFrames.SECURITY_CODE_FIELD_NAME);
     this._configurationForStandardCard =
-      this._fieldsToSubmitLength === CardFrames.COMPLETE_FORM_NUMBER_OF_FIELDS &&
-      this._loadAnimatedCard &&
-      !this._isCardWithNoCvv &&
-      this.fieldsToSubmit.includes(CardFrames.CARD_NUMBER_FIELD_NAME) &&
-      this.fieldsToSubmit.includes(CardFrames.EXPIRY_DATE_FIELD_NAME) &&
+      true &&
       this.fieldsToSubmit.includes(CardFrames.SECURITY_CODE_FIELD_NAME);
   }

[Survived] BooleanLiteral
src/client/card-frames/CardFrames.class.ts:147:7
     this._configurationForStandardCard =
       this._fieldsToSubmitLength === CardFrames.COMPLETE_FORM_NUMBER_OF_FIELDS &&
       this._loadAnimatedCard &&
-      !this._isCardWithNoCvv &&
+      this._isCardWithNoCvv &&
       this.fieldsToSubmit.includes(CardFrames.CARD_NUMBER_FIELD_NAME) &&
       this.fieldsToSubmit.includes(CardFrames.EXPIRY_DATE_FIELD_NAME) &&

[Survived] BlockStatement
src/client/card-frames/CardFrames.class.ts:153:78
       this.fieldsToSubmit.includes(CardFrames.SECURITY_CODE_FIELD_NAME);
   }
 
-  protected registerElements(fields: HTMLElement[], targets: string[]): void {
-    if (fields.length === targets.length) {
-      targets.forEach((item, index) => {
-        const element: HTMLElement = document.getElementById(item);
-        if (element !== null) {
-          element.appendChild(fields[index]);
-        }
-      });
-    }
-  }
+  protected registerElements(fields: HTMLElement[], targets: string[]): void {}
 
   protected setElementsFields(): string[] {

[Survived] BlockStatement
src/client/card-frames/CardFrames.class.ts:154:43
   }
 
   protected registerElements(fields: HTMLElement[], targets: string[]): void {
-    if (fields.length === targets.length) {
-      targets.forEach((item, index) => {
-        const element: HTMLElement = document.getElementById(item);
-        if (element !== null) {
-          element.appendChild(fields[index]);
-        }
-      });
-    }
+    if (fields.length === targets.length) {}
   }
 

[Survived] ConditionalExpression
src/client/card-frames/CardFrames.class.ts:154:9
   }
 
   protected registerElements(fields: HTMLElement[], targets: string[]): void {
-    if (fields.length === targets.length) {
+    if (false) {
       targets.forEach((item, index) => {
         const element: HTMLElement = document.getElementById(item);

[Survived] BlockStatement
src/client/card-frames/CardFrames.class.ts:155:40
 
   protected registerElements(fields: HTMLElement[], targets: string[]): void {
     if (fields.length === targets.length) {
-      targets.forEach((item, index) => {
-        const element: HTMLElement = document.getElementById(item);
-        if (element !== null) {
-          element.appendChild(fields[index]);
-        }
-      });
+      targets.forEach((item, index) => {});
     }
   }

[Survived] BlockStatement
src/client/card-frames/CardFrames.class.ts:157:31
     if (fields.length === targets.length) {
       targets.forEach((item, index) => {
         const element: HTMLElement = document.getElementById(item);
-        if (element !== null) {
-          element.appendChild(fields[index]);
-        }
+        if (element !== null) {}
       });
     }

[Survived] ConditionalExpression
src/client/card-frames/CardFrames.class.ts:157:13
     if (fields.length === targets.length) {
       targets.forEach((item, index) => {
         const element: HTMLElement = document.getElementById(item);
-        if (element !== null) {
+        if (false) {
           element.appendChild(fields[index]);
         }

[Survived] BlockStatement
src/client/card-frames/CardFrames.class.ts:164:43
     }
   }
 
-  protected setElementsFields(): string[] {
-    if (this._configurationForStandardCard) {
-      return [
-        this.componentIds.cardNumber,
-        this.componentIds.expirationDate,
-        this.componentIds.securityCode,
-        this.componentIds.animatedCard
-      ];
-    } else if (this._onlyCvvConfiguration) {
-      return [this.componentIds.securityCode];
-    } else if (this._noFieldConfiguration) {
-      return [];
-    } else {
-      return [
-        this.componentIds.cardNumber, //
-        this.componentIds.expirationDate,
-        this.componentIds.securityCode
-      ];
-    }
-  }
+  protected setElementsFields(): string[] {}
 
   private _createSubmitButton = (): HTMLInputElement | HTMLButtonElement => {

[Survived] ConditionalExpression
src/client/card-frames/CardFrames.class.ts:165:9
   }
 
   protected setElementsFields(): string[] {
-    if (this._configurationForStandardCard) {
+    if (false) {
       return [
         this.componentIds.cardNumber,

[Survived] BlockStatement
src/client/card-frames/CardFrames.class.ts:165:45
   }
 
   protected setElementsFields(): string[] {
-    if (this._configurationForStandardCard) {
-      return [
-        this.componentIds.cardNumber,
-        this.componentIds.expirationDate,
-        this.componentIds.securityCode,
-        this.componentIds.animatedCard
-      ];
-    } else if (this._onlyCvvConfiguration) {
+    if (this._configurationForStandardCard) {} else if (this._onlyCvvConfiguration) {
       return [this.componentIds.securityCode];
     } else if (this._noFieldConfiguration) {

[Survived] ArrayDeclaration
src/client/card-frames/CardFrames.class.ts:166:14
 
   protected setElementsFields(): string[] {
     if (this._configurationForStandardCard) {
-      return [
-        this.componentIds.cardNumber,
-        this.componentIds.expirationDate,
-        this.componentIds.securityCode,
-        this.componentIds.animatedCard
-      ];
+      return [];
     } else if (this._onlyCvvConfiguration) {
       return [this.componentIds.securityCode];

[Survived] ConditionalExpression
src/client/card-frames/CardFrames.class.ts:172:16
         this.componentIds.securityCode,
         this.componentIds.animatedCard
       ];
-    } else if (this._onlyCvvConfiguration) {
+    } else if (true) {
       return [this.componentIds.securityCode];
     } else if (this._noFieldConfiguration) {

[Survived] BlockStatement
src/client/card-frames/CardFrames.class.ts:172:44
         this.componentIds.securityCode,
         this.componentIds.animatedCard
       ];
-    } else if (this._onlyCvvConfiguration) {
-      return [this.componentIds.securityCode];
-    } else if (this._noFieldConfiguration) {
+    } else if (this._onlyCvvConfiguration) {} else if (this._noFieldConfiguration) {
       return [];
     } else {

[Survived] ConditionalExpression
src/client/card-frames/CardFrames.class.ts:174:16
       ];
     } else if (this._onlyCvvConfiguration) {
       return [this.componentIds.securityCode];
-    } else if (this._noFieldConfiguration) {
+    } else if (true) {
       return [];
     } else {

[Survived] BlockStatement
src/client/card-frames/CardFrames.class.ts:174:44
       ];
     } else if (this._onlyCvvConfiguration) {
       return [this.componentIds.securityCode];
-    } else if (this._noFieldConfiguration) {
-      return [];
-    } else {
+    } else if (this._noFieldConfiguration) {} else {
       return [
         this.componentIds.cardNumber, //

[Survived] BlockStatement
src/client/card-frames/CardFrames.class.ts:176:12
       return [this.componentIds.securityCode];
     } else if (this._noFieldConfiguration) {
       return [];
-    } else {
-      return [
-        this.componentIds.cardNumber, //
-        this.componentIds.expirationDate,
-        this.componentIds.securityCode
-      ];
-    }
+    } else {}
   }
 

[Survived] BlockStatement
src/client/card-frames/CardFrames.class.ts:185:77
     }
   }
 
-  private _createSubmitButton = (): HTMLInputElement | HTMLButtonElement => {
-    const form = document.getElementById(this.formId);
-
-    this._submitButton =
-      (document.getElementById(this._buttonId) as HTMLInputElement | HTMLButtonElement) ||
-      form.querySelector(CardFrames.SUBMIT_BUTTON_AS_BUTTON_MARKUP) ||
-      form.querySelector(CardFrames.SUBMIT_BUTTON_AS_INPUT_MARKUP);
-    this._disableSubmitButton(FormState.LOADING);
-
-    this._config$.subscribe(response => {
-      const { deferInit, components } = response;
-
-      if (this._submitButton) {
-        this._submitButton.textContent = this._payMessage;
-      }
-
-      if (deferInit || components.startOnLoad) {
-        this._disableSubmitButton(FormState.AVAILABLE);
-      }
-    });
-
-    return this._submitButton;
-  };
+  private _createSubmitButton = (): HTMLInputElement | HTMLButtonElement => {};
 
   private _disableFormField(state: FormState, eventName: string, target: string): void {

[Survived] ConditionalExpression
src/client/card-frames/CardFrames.class.ts:189:7
     const form = document.getElementById(this.formId);
 
     this._submitButton =
-      (document.getElementById(this._buttonId) as HTMLInputElement | HTMLButtonElement) ||
-      form.querySelector(CardFrames.SUBMIT_BUTTON_AS_BUTTON_MARKUP) ||
-      form.querySelector(CardFrames.SUBMIT_BUTTON_AS_INPUT_MARKUP);
+      true;
     this._disableSubmitButton(FormState.LOADING);
 

[Survived] ConditionalExpression
src/client/card-frames/CardFrames.class.ts:189:7
     const form = document.getElementById(this.formId);
 
     this._submitButton =
-      (document.getElementById(this._buttonId) as HTMLInputElement | HTMLButtonElement) ||
-      form.querySelector(CardFrames.SUBMIT_BUTTON_AS_BUTTON_MARKUP) ||
+      true ||
       form.querySelector(CardFrames.SUBMIT_BUTTON_AS_INPUT_MARKUP);
     this._disableSubmitButton(FormState.LOADING);

[Survived] BlockStatement
src/client/card-frames/CardFrames.class.ts:194:41
       form.querySelector(CardFrames.SUBMIT_BUTTON_AS_INPUT_MARKUP);
     this._disableSubmitButton(FormState.LOADING);
 
-    this._config$.subscribe(response => {
-      const { deferInit, components } = response;
-
-      if (this._submitButton) {
-        this._submitButton.textContent = this._payMessage;
-      }
-
-      if (deferInit || components.startOnLoad) {
-        this._disableSubmitButton(FormState.AVAILABLE);
-      }
-    });
+    this._config$.subscribe(response => {});
 
     return this._submitButton;

[Survived] BlockStatement
src/client/card-frames/CardFrames.class.ts:197:31
     this._config$.subscribe(response => {
       const { deferInit, components } = response;
 
-      if (this._submitButton) {
-        this._submitButton.textContent = this._payMessage;
-      }
+      if (this._submitButton) {}
 
       if (deferInit || components.startOnLoad) {

[Survived] ConditionalExpression
src/client/card-frames/CardFrames.class.ts:197:11
     this._config$.subscribe(response => {
       const { deferInit, components } = response;
 
-      if (this._submitButton) {
+      if (true) {
         this._submitButton.textContent = this._payMessage;
       }

[Survived] ConditionalExpression
src/client/card-frames/CardFrames.class.ts:201:11
         this._submitButton.textContent = this._payMessage;
       }
 
-      if (deferInit || components.startOnLoad) {
+      if (true) {
         this._disableSubmitButton(FormState.AVAILABLE);
       }

[Survived] ConditionalExpression
src/client/card-frames/CardFrames.class.ts:201:11
         this._submitButton.textContent = this._payMessage;
       }
 
-      if (deferInit || components.startOnLoad) {
+      if (false) {
         this._disableSubmitButton(FormState.AVAILABLE);
       }

[Survived] BlockStatement
src/client/card-frames/CardFrames.class.ts:209:88
     return this._submitButton;
   };
 
-  private _disableFormField(state: FormState, eventName: string, target: string): void {
-    const messageBusEvent: IMessageBusEvent = {
-      data: state,
-      type: eventName
-    };
-    this._messageBus.publish(messageBusEvent);
-  }
+  private _disableFormField(state: FormState, eventName: string, target: string): void {}
 
   private _disableSubmitButton(state: FormState): void {

[Survived] BlockStatement
src/client/card-frames/CardFrames.class.ts:217:56
     this._messageBus.publish(messageBusEvent);
   }
 
-  private _disableSubmitButton(state: FormState): void {
-    if (this._submitButton) {
-      this._setSubmitButtonProperties(this._submitButton, state);
-    }
-  }
+  private _disableSubmitButton(state: FormState): void {}
 
   private _getCardType(jwt: string): string {

[Survived] BlockStatement
src/client/card-frames/CardFrames.class.ts:218:29
   }
 
   private _disableSubmitButton(state: FormState): void {
-    if (this._submitButton) {
-      this._setSubmitButtonProperties(this._submitButton, state);
-    }
+    if (this._submitButton) {}
   }
 

[Survived] ConditionalExpression
src/client/card-frames/CardFrames.class.ts:218:9
   }
 
   private _disableSubmitButton(state: FormState): void {
-    if (this._submitButton) {
+    if (false) {
       this._setSubmitButtonProperties(this._submitButton, state);
     }

[Survived] BlockStatement
src/client/card-frames/CardFrames.class.ts:223:45
     }
   }
 
-  private _getCardType(jwt: string): string {
-    const cardDetails = JwtDecode(jwt) as any;
-    if (cardDetails.payload.pan) {
-      return iinLookup.lookup(cardDetails.payload.pan).type;
-    }
-  }
+  private _getCardType(jwt: string): string {}
 
   private _initCardNumberFrame(styles: {}): void {

[Survived] ConditionalExpression
src/client/card-frames/CardFrames.class.ts:225:9
 
   private _getCardType(jwt: string): string {
     const cardDetails = JwtDecode(jwt) as any;
-    if (cardDetails.payload.pan) {
+    if (true) {
       return iinLookup.lookup(cardDetails.payload.pan).type;
     }

[Survived] ConditionalExpression
src/client/card-frames/CardFrames.class.ts:225:9
 
   private _getCardType(jwt: string): string {
     const cardDetails = JwtDecode(jwt) as any;
-    if (cardDetails.payload.pan) {
+    if (false) {
       return iinLookup.lookup(cardDetails.payload.pan).type;
     }

[Survived] BlockStatement
src/client/card-frames/CardFrames.class.ts:230:50
     }
   }
 
-  private _initCardNumberFrame(styles: {}): void {
-    this._cardNumber = this._iframeFactory.create(CARD_NUMBER_COMPONENT_NAME, CARD_NUMBER_IFRAME, styles, this.params);
-    this.elementsToRegister.push(this._cardNumber);
-  }
+  private _initCardNumberFrame(styles: {}): void {}
 
   private _initExpiryDateFrame(styles: {}): void {

[Survived] BlockStatement
src/client/card-frames/CardFrames.class.ts:235:50
     this.elementsToRegister.push(this._cardNumber);
   }
 
-  private _initExpiryDateFrame(styles: {}): void {
-    this._expirationDate = this._iframeFactory.create(
-      EXPIRATION_DATE_COMPONENT_NAME,
-      EXPIRATION_DATE_IFRAME,
-      styles,
-      this.params
-    );
-    this.elementsToRegister.push(this._expirationDate);
-  }
+  private _initExpiryDateFrame(styles: {}): void {}
 
   private _initSecurityCodeFrame(styles: {}): void {

[Survived] BlockStatement
src/client/card-frames/CardFrames.class.ts:245:52
     this.elementsToRegister.push(this._expirationDate);
   }
 
-  private _initSecurityCodeFrame(styles: {}): void {
-    this._securityCode = this._iframeFactory.create(
-      SECURITY_CODE_COMPONENT_NAME,
-      SECURITY_CODE_IFRAME,
-      styles,
-      this.params
-    );
-    this.elementsToRegister.push(this._securityCode);
-  }
+  private _initSecurityCodeFrame(styles: {}): void {}
 
   private _initAnimatedCardFrame(): void {

[Survived] BlockStatement
src/client/card-frames/CardFrames.class.ts:255:42
     this.elementsToRegister.push(this._securityCode);
   }
 
-  private _initAnimatedCardFrame(): void {
-    const animatedCardConfig = { ...this.params };
-    if (this._paymentTypes !== undefined) {
-      animatedCardConfig.paymentTypes = this._paymentTypes;
-    }
-    if (this._defaultPaymentType !== undefined) {
-      animatedCardConfig.defaultPaymentType = this._defaultPaymentType;
-    }
-    this._animatedCard = this._iframeFactory.create(
-      ANIMATED_CARD_COMPONENT_NAME,
-      ANIMATED_CARD_COMPONENT_IFRAME,
-      {},
-      animatedCardConfig,
-      -1
-    );
-    this.elementsToRegister.push(this._animatedCard);
-  }
+  private _initAnimatedCardFrame(): void {}
 
   private _initCardFrames(): void {

[Survived] BlockStatement
src/client/card-frames/CardFrames.class.ts:257:43
 
   private _initAnimatedCardFrame(): void {
     const animatedCardConfig = { ...this.params };
-    if (this._paymentTypes !== undefined) {
-      animatedCardConfig.paymentTypes = this._paymentTypes;
-    }
+    if (this._paymentTypes !== undefined) {}
     if (this._defaultPaymentType !== undefined) {
       animatedCardConfig.defaultPaymentType = this._defaultPaymentType;

[Survived] ConditionalExpression
src/client/card-frames/CardFrames.class.ts:257:9
 
   private _initAnimatedCardFrame(): void {
     const animatedCardConfig = { ...this.params };
-    if (this._paymentTypes !== undefined) {
+    if (false) {
       animatedCardConfig.paymentTypes = this._paymentTypes;
     }
