[Survived] BlockStatement
src/client/card-frames/CardFrames.class.ts:260:49
     if (this._paymentTypes !== undefined) {
       animatedCardConfig.paymentTypes = this._paymentTypes;
     }
-    if (this._defaultPaymentType !== undefined) {
-      animatedCardConfig.defaultPaymentType = this._defaultPaymentType;
-    }
+    if (this._defaultPaymentType !== undefined) {}
     this._animatedCard = this._iframeFactory.create(
       ANIMATED_CARD_COMPONENT_NAME,

[Survived] ConditionalExpression
src/client/card-frames/CardFrames.class.ts:260:9
     if (this._paymentTypes !== undefined) {
       animatedCardConfig.paymentTypes = this._paymentTypes;
     }
-    if (this._defaultPaymentType !== undefined) {
+    if (false) {
       animatedCardConfig.defaultPaymentType = this._defaultPaymentType;
     }

[Survived] UnaryOperator
src/client/card-frames/CardFrames.class.ts:268:7
       ANIMATED_CARD_COMPONENT_IFRAME,
       {},
       animatedCardConfig,
-      -1
+      +1
     );
     this.elementsToRegister.push(this._animatedCard);

[Survived] BlockStatement
src/client/card-frames/CardFrames.class.ts:273:35
     this.elementsToRegister.push(this._animatedCard);
   }
 
-  private _initCardFrames(): void {
-    const { defaultStyles } = this.styles;
-    let { cardNumber, securityCode, expirationDate } = this.styles;
-    cardNumber = Object.assign({}, defaultStyles, cardNumber);
-    securityCode = Object.assign({}, defaultStyles, securityCode);
-    expirationDate = Object.assign({}, defaultStyles, expirationDate);
-    if (this._onlyCvvConfiguration) {
-      this._initSecurityCodeFrame(securityCode);
-    } else if (this._configurationForStandardCard) {
-      this._initCardNumberFrame(cardNumber);
-      this._initExpiryDateFrame(expirationDate);
-      this._initSecurityCodeFrame(securityCode);
-      this._initAnimatedCardFrame();
-    } else {
-      this._initCardNumberFrame(cardNumber);
-      this._initExpiryDateFrame(expirationDate);
-      this._initSecurityCodeFrame(securityCode);
-    }
-  }
+  private _initCardFrames(): void {}
 
   private _initSubscribes(): void {

[Survived] ConditionalExpression
src/client/card-frames/CardFrames.class.ts:279:9
     cardNumber = Object.assign({}, defaultStyles, cardNumber);
     securityCode = Object.assign({}, defaultStyles, securityCode);
     expirationDate = Object.assign({}, defaultStyles, expirationDate);
-    if (this._onlyCvvConfiguration) {
+    if (true) {
       this._initSecurityCodeFrame(securityCode);
     } else if (this._configurationForStandardCard) {

[Survived] ConditionalExpression
src/client/card-frames/CardFrames.class.ts:279:9
     cardNumber = Object.assign({}, defaultStyles, cardNumber);
     securityCode = Object.assign({}, defaultStyles, securityCode);
     expirationDate = Object.assign({}, defaultStyles, expirationDate);
-    if (this._onlyCvvConfiguration) {
+    if (false) {
       this._initSecurityCodeFrame(securityCode);
     } else if (this._configurationForStandardCard) {

[Survived] ConditionalExpression
src/client/card-frames/CardFrames.class.ts:281:16
     expirationDate = Object.assign({}, defaultStyles, expirationDate);
     if (this._onlyCvvConfiguration) {
       this._initSecurityCodeFrame(securityCode);
-    } else if (this._configurationForStandardCard) {
+    } else if (false) {
       this._initCardNumberFrame(cardNumber);
       this._initExpiryDateFrame(expirationDate);

[Survived] ConditionalExpression
src/client/card-frames/CardFrames.class.ts:281:16
     expirationDate = Object.assign({}, defaultStyles, expirationDate);
     if (this._onlyCvvConfiguration) {
       this._initSecurityCodeFrame(securityCode);
-    } else if (this._configurationForStandardCard) {
+    } else if (true) {
       this._initCardNumberFrame(cardNumber);
       this._initExpiryDateFrame(expirationDate);

[Survived] BlockStatement
src/client/card-frames/CardFrames.class.ts:286:12
       this._initExpiryDateFrame(expirationDate);
       this._initSecurityCodeFrame(securityCode);
       this._initAnimatedCardFrame();
-    } else {
-      this._initCardNumberFrame(cardNumber);
-      this._initExpiryDateFrame(expirationDate);
-      this._initSecurityCodeFrame(securityCode);
-    }
+    } else {}
   }
 

[Survived] BlockStatement
src/client/card-frames/CardFrames.class.ts:293:35
     }
   }
 
-  private _initSubscribes(): void {
-    this._submitFormListener();
-    this._subscribeBlockSubmit();
-    this._validateFieldsAfterSubmit();
-    this._setMerchantInputListeners();
-  }
+  private _initSubscribes(): void {}
 
   private _onInput(): void {

[Survived] BlockStatement
src/client/card-frames/CardFrames.class.ts:300:28
     this._setMerchantInputListeners();
   }
 
-  private _onInput(): void {
-    const messageBusEvent: IMessageBusEvent = {
-      data: DomMethods.parseForm(this.formId),
-      type: MessageBus.EVENTS_PUBLIC.UPDATE_MERCHANT_FIELDS
-    };
-    this._messageBus.publish(messageBusEvent);
-  }
+  private _onInput(): void {}
 
   private _publishSubmitEvent(): void {

[Survived] BlockStatement
src/client/card-frames/CardFrames.class.ts:308:39
     this._messageBus.publish(messageBusEvent);
   }
 
-  private _publishSubmitEvent(): void {
-    const messageBusEvent: IMessageBusEvent = {
-      data: {
-        fieldsToSubmit: this.fieldsToSubmit
-      },
-      type: MessageBus.EVENTS_PUBLIC.SUBMIT_FORM
-    };
-    this._messageBus.publish(messageBusEvent, true);
-  }
+  private _publishSubmitEvent(): void {}
 
   private _publishValidatedFieldState(field: { message: string; state: boolean }, eventType: string): void {

[Survived] BlockStatement
src/client/card-frames/CardFrames.class.ts:318:108
     this._messageBus.publish(messageBusEvent, true);
   }
 
-  private _publishValidatedFieldState(field: { message: string; state: boolean }, eventType: string): void {
-    this._messageBusEvent.type = eventType;
-    this._messageBusEvent.data.message = field.message;
-    this._messageBus.publish(this._messageBusEvent);
-  }
+  private _publishValidatedFieldState(field: { message: string; state: boolean }, eventType: string): void {}
 
   private _setMerchantInputListeners(): void {

[Survived] BlockStatement
src/client/card-frames/CardFrames.class.ts:324:46
     this._messageBus.publish(this._messageBusEvent);
   }
 
-  private _setMerchantInputListeners(): void {
-    const els = DomMethods.getAllFormElements(document.getElementById(this.formId));
-    for (const el of els) {
-      el.addEventListener(CardFrames.INPUT_EVENT, this._onInput.bind(this));
-    }
-  }
+  private _setMerchantInputListeners(): void {}
 
   private _setInitValues(

[Survived] BlockStatement
src/client/card-frames/CardFrames.class.ts:326:27
 
   private _setMerchantInputListeners(): void {
     const els = DomMethods.getAllFormElements(document.getElementById(this.formId));
-    for (const el of els) {
-      el.addEventListener(CardFrames.INPUT_EVENT, this._onInput.bind(this));
-    }
+    for (const el of els) {}
   }
 

[Survived] BlockStatement
src/client/card-frames/CardFrames.class.ts:338:11
     loadAnimatedCard: boolean,
     jwt: string,
     formId: string
-  ): void {
-    this._validation = new Validation();
-    const locale: string = this._frame.parseUrl().locale || JwtDecode<IStJwtObj>(jwt).payload.locale;
-    this._translator = new Translator(locale);
-    this._buttonId = buttonId;
-    this.formId = formId;
-    this._defaultPaymentType = defaultPaymentType;
-    this._paymentTypes = paymentTypes;
-    this.jwt = jwt;
-    this._payMessage = this._translator.translate(PAY);
-    this._processingMessage = `${this._translator.translate(PROCESSING)} ...`;
-    this._loadAnimatedCard = loadAnimatedCard !== undefined ? loadAnimatedCard : true;
-  }
+  ): void {}
 
   private _setSubmitButtonProperties(element: any, state: FormState): HTMLElement {

[Survived] ConditionalExpression
src/client/card-frames/CardFrames.class.ts:340:28
     formId: string
   ): void {
     this._validation = new Validation();
-    const locale: string = this._frame.parseUrl().locale || JwtDecode<IStJwtObj>(jwt).payload.locale;
+    const locale: string = false;
     this._translator = new Translator(locale);
     this._buttonId = buttonId;

[Survived] ConditionalExpression
src/client/card-frames/CardFrames.class.ts:340:28
     formId: string
   ): void {
     this._validation = new Validation();
-    const locale: string = this._frame.parseUrl().locale || JwtDecode<IStJwtObj>(jwt).payload.locale;
+    const locale: string = true;
     this._translator = new Translator(locale);
     this._buttonId = buttonId;

[Survived] ConditionalExpression
src/client/card-frames/CardFrames.class.ts:349:30
     this.jwt = jwt;
     this._payMessage = this._translator.translate(PAY);
     this._processingMessage = `${this._translator.translate(PROCESSING)} ...`;
-    this._loadAnimatedCard = loadAnimatedCard !== undefined ? loadAnimatedCard : true;
+    this._loadAnimatedCard = true ? loadAnimatedCard : true;
   }
 

[Survived] EqualityOperator
src/client/card-frames/CardFrames.class.ts:349:30
     this.jwt = jwt;
     this._payMessage = this._translator.translate(PAY);
     this._processingMessage = `${this._translator.translate(PROCESSING)} ...`;
-    this._loadAnimatedCard = loadAnimatedCard !== undefined ? loadAnimatedCard : true;
+    this._loadAnimatedCard = loadAnimatedCard === undefined ? loadAnimatedCard : true;
   }
 

[Survived] BlockStatement
src/client/card-frames/CardFrames.class.ts:352:83
     this._loadAnimatedCard = loadAnimatedCard !== undefined ? loadAnimatedCard : true;
   }
 
-  private _setSubmitButtonProperties(element: any, state: FormState): HTMLElement {
-    let disabledState;
-    if (state === FormState.BLOCKED) {
-      element.textContent = this._processingMessage;
-      element.classList.add(CardFrames.SUBMIT_BUTTON_DISABLED_CLASS);
-      disabledState = true;
-    } else if (state === FormState.COMPLETE) {
-      element.textContent = this._payMessage;
-      element.classList.add(CardFrames.SUBMIT_BUTTON_DISABLED_CLASS); // Keep it locked but return it to original text
-      disabledState = true;
-    } else if (state === FormState.LOADING) {
-      element.textContent = this._payMessage;
-      disabledState = true;
-    } else {
-      element.textContent = this._payMessage;
-      element.classList.remove(CardFrames.SUBMIT_BUTTON_DISABLED_CLASS);
-      disabledState = false;
-    }
-    element.disabled = disabledState;
-    return element;
-  }
+  private _setSubmitButtonProperties(element: any, state: FormState): HTMLElement {}
 
   private _submitFormListener(): void {

[Survived] EqualityOperator
src/client/card-frames/CardFrames.class.ts:354:9
 
   private _setSubmitButtonProperties(element: any, state: FormState): HTMLElement {
     let disabledState;
-    if (state === FormState.BLOCKED) {
+    if (state !== FormState.BLOCKED) {
       element.textContent = this._processingMessage;
       element.classList.add(CardFrames.SUBMIT_BUTTON_DISABLED_CLASS);

[Survived] ConditionalExpression
src/client/card-frames/CardFrames.class.ts:354:9
 
   private _setSubmitButtonProperties(element: any, state: FormState): HTMLElement {
     let disabledState;
-    if (state === FormState.BLOCKED) {
+    if (false) {
       element.textContent = this._processingMessage;
       element.classList.add(CardFrames.SUBMIT_BUTTON_DISABLED_CLASS);

[Survived] BooleanLiteral
src/client/card-frames/CardFrames.class.ts:357:23
     if (state === FormState.BLOCKED) {
       element.textContent = this._processingMessage;
       element.classList.add(CardFrames.SUBMIT_BUTTON_DISABLED_CLASS);
-      disabledState = true;
+      disabledState = false;
     } else if (state === FormState.COMPLETE) {
       element.textContent = this._payMessage;

[Survived] BlockStatement
src/client/card-frames/CardFrames.class.ts:358:46
       element.textContent = this._processingMessage;
       element.classList.add(CardFrames.SUBMIT_BUTTON_DISABLED_CLASS);
       disabledState = true;
-    } else if (state === FormState.COMPLETE) {
-      element.textContent = this._payMessage;
-      element.classList.add(CardFrames.SUBMIT_BUTTON_DISABLED_CLASS); // Keep it locked but return it to original text
-      disabledState = true;
-    } else if (state === FormState.LOADING) {
+    } else if (state === FormState.COMPLETE) {} else if (state === FormState.LOADING) {
       element.textContent = this._payMessage;
       disabledState = true;

[Survived] ConditionalExpression
src/client/card-frames/CardFrames.class.ts:358:16
       element.textContent = this._processingMessage;
       element.classList.add(CardFrames.SUBMIT_BUTTON_DISABLED_CLASS);
       disabledState = true;
-    } else if (state === FormState.COMPLETE) {
+    } else if (true) {
       element.textContent = this._payMessage;
       element.classList.add(CardFrames.SUBMIT_BUTTON_DISABLED_CLASS); // Keep it locked but return it to original text

[Survived] BooleanLiteral
src/client/card-frames/CardFrames.class.ts:361:23
     } else if (state === FormState.COMPLETE) {
       element.textContent = this._payMessage;
       element.classList.add(CardFrames.SUBMIT_BUTTON_DISABLED_CLASS); // Keep it locked but return it to original text
-      disabledState = true;
+      disabledState = false;
     } else if (state === FormState.LOADING) {
       element.textContent = this._payMessage;

[Survived] ConditionalExpression
src/client/card-frames/CardFrames.class.ts:362:16
       element.textContent = this._payMessage;
       element.classList.add(CardFrames.SUBMIT_BUTTON_DISABLED_CLASS); // Keep it locked but return it to original text
       disabledState = true;
-    } else if (state === FormState.LOADING) {
+    } else if (true) {
       element.textContent = this._payMessage;
       disabledState = true;

[Survived] EqualityOperator
src/client/card-frames/CardFrames.class.ts:362:16
       element.textContent = this._payMessage;
       element.classList.add(CardFrames.SUBMIT_BUTTON_DISABLED_CLASS); // Keep it locked but return it to original text
       disabledState = true;
-    } else if (state === FormState.LOADING) {
+    } else if (state !== FormState.LOADING) {
       element.textContent = this._payMessage;
       disabledState = true;

[Survived] BooleanLiteral
src/client/card-frames/CardFrames.class.ts:364:23
       disabledState = true;
     } else if (state === FormState.LOADING) {
       element.textContent = this._payMessage;
-      disabledState = true;
+      disabledState = false;
     } else {
       element.textContent = this._payMessage;

[Survived] BlockStatement
src/client/card-frames/CardFrames.class.ts:365:12
     } else if (state === FormState.LOADING) {
       element.textContent = this._payMessage;
       disabledState = true;
-    } else {
-      element.textContent = this._payMessage;
-      element.classList.remove(CardFrames.SUBMIT_BUTTON_DISABLED_CLASS);
-      disabledState = false;
-    }
+    } else {}
     element.disabled = disabledState;
     return element;

[Survived] BooleanLiteral
src/client/card-frames/CardFrames.class.ts:368:23
     } else {
       element.textContent = this._payMessage;
       element.classList.remove(CardFrames.SUBMIT_BUTTON_DISABLED_CLASS);
-      disabledState = false;
+      disabledState = true;
     }
     element.disabled = disabledState;

[Survived] BlockStatement
src/client/card-frames/CardFrames.class.ts:374:39
     return element;
   }
 
-  private _submitFormListener(): void {
-    if (this._submitButton) {
-      this._submitButton.addEventListener(CardFrames.CLICK_EVENT, () => {
-        this._publishSubmitEvent();
-      });
-    }
-    this._messageBus.subscribe(MessageBus.EVENTS_PUBLIC.CALL_SUBMIT_EVENT, () => {
-      this._publishSubmitEvent();
-    });
-  }
+  private _submitFormListener(): void {}
 
   private _subscribeBlockSubmit(): void {

[Survived] ConditionalExpression
src/client/card-frames/CardFrames.class.ts:375:9
   }
 
   private _submitFormListener(): void {
-    if (this._submitButton) {
+    if (false) {
       this._submitButton.addEventListener(CardFrames.CLICK_EVENT, () => {
         this._publishSubmitEvent();

[Survived] BlockStatement
src/client/card-frames/CardFrames.class.ts:375:29
   }
 
   private _submitFormListener(): void {
-    if (this._submitButton) {
-      this._submitButton.addEventListener(CardFrames.CLICK_EVENT, () => {
-        this._publishSubmitEvent();
-      });
-    }
+    if (this._submitButton) {}
     this._messageBus.subscribe(MessageBus.EVENTS_PUBLIC.CALL_SUBMIT_EVENT, () => {
       this._publishSubmitEvent();

[Survived] BlockStatement
src/client/card-frames/CardFrames.class.ts:376:73
 
   private _submitFormListener(): void {
     if (this._submitButton) {
-      this._submitButton.addEventListener(CardFrames.CLICK_EVENT, () => {
-        this._publishSubmitEvent();
-      });
+      this._submitButton.addEventListener(CardFrames.CLICK_EVENT, () => {});
     }
     this._messageBus.subscribe(MessageBus.EVENTS_PUBLIC.CALL_SUBMIT_EVENT, () => {

[Survived] BlockStatement
src/client/card-frames/CardFrames.class.ts:380:82
         this._publishSubmitEvent();
       });
     }
-    this._messageBus.subscribe(MessageBus.EVENTS_PUBLIC.CALL_SUBMIT_EVENT, () => {
-      this._publishSubmitEvent();
-    });
+    this._messageBus.subscribe(MessageBus.EVENTS_PUBLIC.CALL_SUBMIT_EVENT, () => {});
   }
 

[Survived] BlockStatement
src/client/card-frames/CardFrames.class.ts:385:41
     });
   }
 
-  private _subscribeBlockSubmit(): void {
-    this._messageBus
-      .pipe(ofType(MessageBus.EVENTS_PUBLIC.SUBMIT_FORM))
-      .subscribe(() => this._disableSubmitButton(FormState.BLOCKED));
-
-    this._messageBus.subscribe(MessageBus.EVENTS_PUBLIC.BLOCK_FORM, (state: FormState) => {
-      this._disableSubmitButton(state);
-      this._disableFormField(state, MessageBus.EVENTS_PUBLIC.BLOCK_CARD_NUMBER, CARD_NUMBER_IFRAME);
-      this._disableFormField(state, MessageBus.EVENTS_PUBLIC.BLOCK_EXPIRATION_DATE, EXPIRATION_DATE_IFRAME);
-      this._disableFormField(state, MessageBus.EVENTS_PUBLIC.BLOCK_SECURITY_CODE, SECURITY_CODE_IFRAME);
-    });
-  }
+  private _subscribeBlockSubmit(): void {}
 
   private _validateFieldsAfterSubmit(): void {

[Survived] ArrowFunction
src/client/card-frames/CardFrames.class.ts:388:18
   private _subscribeBlockSubmit(): void {
     this._messageBus
       .pipe(ofType(MessageBus.EVENTS_PUBLIC.SUBMIT_FORM))
-      .subscribe(() => this._disableSubmitButton(FormState.BLOCKED));
+      .subscribe(() => undefined);
 
     this._messageBus.subscribe(MessageBus.EVENTS_PUBLIC.BLOCK_FORM, (state: FormState) => {

[Survived] BlockStatement
src/client/card-frames/CardFrames.class.ts:390:91
       .pipe(ofType(MessageBus.EVENTS_PUBLIC.SUBMIT_FORM))
       .subscribe(() => this._disableSubmitButton(FormState.BLOCKED));
 
-    this._messageBus.subscribe(MessageBus.EVENTS_PUBLIC.BLOCK_FORM, (state: FormState) => {
-      this._disableSubmitButton(state);
-      this._disableFormField(state, MessageBus.EVENTS_PUBLIC.BLOCK_CARD_NUMBER, CARD_NUMBER_IFRAME);
-      this._disableFormField(state, MessageBus.EVENTS_PUBLIC.BLOCK_EXPIRATION_DATE, EXPIRATION_DATE_IFRAME);
-      this._disableFormField(state, MessageBus.EVENTS_PUBLIC.BLOCK_SECURITY_CODE, SECURITY_CODE_IFRAME);
-    });
+    this._messageBus.subscribe(MessageBus.EVENTS_PUBLIC.BLOCK_FORM, (state: FormState) => {});
   }
 

[Survived] BlockStatement
src/client/card-frames/CardFrames.class.ts:398:46
     });
   }
 
-  private _validateFieldsAfterSubmit(): void {
-    this._messageBus.subscribe(MessageBus.EVENTS.VALIDATE_FORM, (data: IValidationMessageBus) => {
-      const { cardNumber, expirationDate, securityCode } = data;
-      if (!cardNumber.state) {
-        this._publishValidatedFieldState(cardNumber, MessageBus.EVENTS.VALIDATE_CARD_NUMBER_FIELD);
-      }
-      if (!expirationDate.state) {
-        this._publishValidatedFieldState(expirationDate, MessageBus.EVENTS.VALIDATE_EXPIRATION_DATE_FIELD);
-      }
-      if (!securityCode.state) {
-        this._publishValidatedFieldState(securityCode, MessageBus.EVENTS.VALIDATE_SECURITY_CODE_FIELD);
-      }
-    });
-  }
+  private _validateFieldsAfterSubmit(): void {}
 
   private _preventFormSubmit(): void {

[Survived] BlockStatement
src/client/card-frames/CardFrames.class.ts:399:98
   }
 
   private _validateFieldsAfterSubmit(): void {
-    this._messageBus.subscribe(MessageBus.EVENTS.VALIDATE_FORM, (data: IValidationMessageBus) => {
-      const { cardNumber, expirationDate, securityCode } = data;
-      if (!cardNumber.state) {
-        this._publishValidatedFieldState(cardNumber, MessageBus.EVENTS.VALIDATE_CARD_NUMBER_FIELD);
-      }
-      if (!expirationDate.state) {
-        this._publishValidatedFieldState(expirationDate, MessageBus.EVENTS.VALIDATE_EXPIRATION_DATE_FIELD);
-      }
-      if (!securityCode.state) {
-        this._publishValidatedFieldState(securityCode, MessageBus.EVENTS.VALIDATE_SECURITY_CODE_FIELD);
-      }
-    });
+    this._messageBus.subscribe(MessageBus.EVENTS.VALIDATE_FORM, (data: IValidationMessageBus) => {});
   }
 

[Survived] ConditionalExpression
src/client/card-frames/CardFrames.class.ts:401:11
   private _validateFieldsAfterSubmit(): void {
     this._messageBus.subscribe(MessageBus.EVENTS.VALIDATE_FORM, (data: IValidationMessageBus) => {
       const { cardNumber, expirationDate, securityCode } = data;
-      if (!cardNumber.state) {
+      if (true) {
         this._publishValidatedFieldState(cardNumber, MessageBus.EVENTS.VALIDATE_CARD_NUMBER_FIELD);
       }

[Survived] BooleanLiteral
src/client/card-frames/CardFrames.class.ts:401:11
   private _validateFieldsAfterSubmit(): void {
     this._messageBus.subscribe(MessageBus.EVENTS.VALIDATE_FORM, (data: IValidationMessageBus) => {
       const { cardNumber, expirationDate, securityCode } = data;
-      if (!cardNumber.state) {
+      if (cardNumber.state) {
         this._publishValidatedFieldState(cardNumber, MessageBus.EVENTS.VALIDATE_CARD_NUMBER_FIELD);
       }

[Survived] ConditionalExpression
src/client/card-frames/CardFrames.class.ts:404:11
       if (!cardNumber.state) {
         this._publishValidatedFieldState(cardNumber, MessageBus.EVENTS.VALIDATE_CARD_NUMBER_FIELD);
       }
-      if (!expirationDate.state) {
+      if (false) {
         this._publishValidatedFieldState(expirationDate, MessageBus.EVENTS.VALIDATE_EXPIRATION_DATE_FIELD);
       }

[Survived] BlockStatement
src/client/card-frames/CardFrames.class.ts:404:34
       if (!cardNumber.state) {
         this._publishValidatedFieldState(cardNumber, MessageBus.EVENTS.VALIDATE_CARD_NUMBER_FIELD);
       }
-      if (!expirationDate.state) {
-        this._publishValidatedFieldState(expirationDate, MessageBus.EVENTS.VALIDATE_EXPIRATION_DATE_FIELD);
-      }
+      if (!expirationDate.state) {}
       if (!securityCode.state) {
         this._publishValidatedFieldState(securityCode, MessageBus.EVENTS.VALIDATE_SECURITY_CODE_FIELD);

[Survived] BlockStatement
src/client/card-frames/CardFrames.class.ts:407:32
       if (!expirationDate.state) {
         this._publishValidatedFieldState(expirationDate, MessageBus.EVENTS.VALIDATE_EXPIRATION_DATE_FIELD);
       }
-      if (!securityCode.state) {
-        this._publishValidatedFieldState(securityCode, MessageBus.EVENTS.VALIDATE_SECURITY_CODE_FIELD);
-      }
+      if (!securityCode.state) {}
     });
   }

[Survived] BooleanLiteral
src/client/card-frames/CardFrames.class.ts:407:11
       if (!expirationDate.state) {
         this._publishValidatedFieldState(expirationDate, MessageBus.EVENTS.VALIDATE_EXPIRATION_DATE_FIELD);
       }
-      if (!securityCode.state) {
+      if (securityCode.state) {
         this._publishValidatedFieldState(securityCode, MessageBus.EVENTS.VALIDATE_SECURITY_CODE_FIELD);
       }

[Survived] BlockStatement
src/client/card-frames/CardFrames.class.ts:413:38
     });
   }
 
-  private _preventFormSubmit(): void {
-    const preventFunction = (event: Event) => event.preventDefault();
-    const paymentForm = document.getElementById(this.formId);
-
-    paymentForm.addEventListener(CardFrames.SUBMIT_EVENT, preventFunction);
-
-    this._messageBus.pipe(ofType(PUBLIC_EVENTS.DESTROY), first()).subscribe(() => {
-      paymentForm.removeEventListener(CardFrames.SUBMIT_EVENT, preventFunction);
-    });
-  }
+  private _preventFormSubmit(): void {}
 }
 

[Survived] ArrowFunction
src/client/card-frames/CardFrames.class.ts:414:29
   }
 
   private _preventFormSubmit(): void {
-    const preventFunction = (event: Event) => event.preventDefault();
+    const preventFunction = () => undefined;
     const paymentForm = document.getElementById(this.formId);
 

[Survived] BlockStatement
src/client/card-frames/CardFrames.class.ts:419:83
 
     paymentForm.addEventListener(CardFrames.SUBMIT_EVENT, preventFunction);
 
-    this._messageBus.pipe(ofType(PUBLIC_EVENTS.DESTROY), first()).subscribe(() => {
-      paymentForm.removeEventListener(CardFrames.SUBMIT_EVENT, preventFunction);
-    });
+    this._messageBus.pipe(ofType(PUBLIC_EVENTS.DESTROY), first()).subscribe(() => {});
   }
 }
