[Survived] BlockStatement
src/client/client-bootstrap/ClientBootstrap.ts:18:28
 export class ClientBootstrap {
   constructor(private frameIdentifier: FrameIdentifier, private container: ContainerInstance) {}
 
-  run(config: IConfig): ST {
-    this.frameIdentifier.setFrameName(MERCHANT_PARENT_FRAME);
-
-    this.container.get(MessageBus);
-    this.container.get(Store);
-    this.container.get(BrowserLocalStorage).init();
-    this.container.get(MessageSubscriberRegistry).register(...this.container.getMany(MessageSubscriberToken));
-
-    const st = this.container.get(ST);
-
-    this.container.get(SentryService).init(environment.SENTRY_DSN, environment.SENTRY_WHITELIST_URLS);
-
-    st.init(config);
-
-    return st;
-  }
+  run(config: IConfig): ST {}
 }
 
