[Survived] BlockStatement
src/client/common-frames/CommonFrames.class.ts:20:32
 import { CONTROL_FRAME_COMPONENT_NAME, CONTROL_FRAME_IFRAME } from '../../application/core/models/constants/Selectors';
 
 export class CommonFrames {
-  get requestTypes(): string[] {
-    return this._requestTypes;
-  }
+  get requestTypes(): string[] {}
 
   set requestTypes(requestTypes: string[]) {

[Survived] BlockStatement
src/client/common-frames/CommonFrames.class.ts:24:44
     return this._requestTypes;
   }
 
-  set requestTypes(requestTypes: string[]) {
-    this._requestTypes = requestTypes;
-  }
+  set requestTypes(requestTypes: string[]) {}
 
   private static readonly COMPLETED_REQUEST_TYPES = ['AUTH', 'CACHETOKENISE', 'ACCOUNTCHECK'];

[Survived] StringLiteral
src/client/common-frames/CommonFrames.class.ts:28:79
     this._requestTypes = requestTypes;
   }
 
-  private static readonly COMPLETED_REQUEST_TYPES = ['AUTH', 'CACHETOKENISE', 'ACCOUNTCHECK'];
+  private static readonly COMPLETED_REQUEST_TYPES = ['AUTH', 'CACHETOKENISE', ""];
   public elementsTargets: any;
   public elementsToRegister: HTMLElement[];

[Survived] StringLiteral
src/client/common-frames/CommonFrames.class.ts:28:62
     this._requestTypes = requestTypes;
   }
 
-  private static readonly COMPLETED_REQUEST_TYPES = ['AUTH', 'CACHETOKENISE', 'ACCOUNTCHECK'];
+  private static readonly COMPLETED_REQUEST_TYPES = ['AUTH', "", 'ACCOUNTCHECK'];
   public elementsTargets: any;
   public elementsToRegister: HTMLElement[];

[Survived] BlockStatement
src/client/common-frames/CommonFrames.class.ts:70:5
     formId: string,
     private _iframeFactory: IframeFactory,
     private _frame: Frame
-  ) {
-    this._gatewayUrl = gatewayUrl;
-    this._messageBus = Container.get(MessageBus);
-    this.formId = formId;
-    this._merchantForm = document.getElementById(formId) as HTMLFormElement;
-    this._validation = new Validation();
-    this._formSubmitted = false;
-    this._submitFields = submitFields;
-    this._submitOnError = submitOnError;
-    this._submitOnCancel = submitOnCancel;
-    this._submitOnSuccess = submitOnSuccess;
-    this._requestTypes = requestTypes;
-    this.elementsToRegister = [];
-    this.componentIds = componentIds;
-    this.formId = formId;
-    this.componentIds = componentIds;
-    this.elementsToRegister = [];
-    this.jwt = jwt;
-    this.origin = origin;
-    this.styles = this._getStyles(styles);
-    this._stJwt = new StJwt(jwt);
-    this.params = { locale: this._stJwt.locale, origin: this.origin };
-    this._destroy$ = this._messageBus.pipe(ofType(PUBLIC_EVENTS.DESTROY));
-    this.styles = this._getStyles(styles);
-  }
+  ) {}
 
   public init() {

[Survived] BooleanLiteral
src/client/common-frames/CommonFrames.class.ts:76:27
     this.formId = formId;
     this._merchantForm = document.getElementById(formId) as HTMLFormElement;
     this._validation = new Validation();
-    this._formSubmitted = false;
+    this._formSubmitted = true;
     this._submitFields = submitFields;
     this._submitOnError = submitOnError;

[Survived] BlockStatement
src/client/common-frames/CommonFrames.class.ts:96:17
     this.styles = this._getStyles(styles);
   }
 
-  public init() {
-    this._initFormFields();
-    this._setMerchantInputListeners();
-    this._setTransactionCompleteListener();
-    this.elementsTargets = this.setElementsFields();
-    this.registerElements(this.elementsToRegister, this.elementsTargets);
-  }
+  public init() {}
 
   private _getStyles(styles: any) {

[Survived] BlockStatement
src/client/common-frames/CommonFrames.class.ts:106:42
 
   private _getStyles(styles: any) {
     for (const key in styles) {
-      if (styles[key] instanceof Object) {
-        return styles;
-      }
+      if (styles[key] instanceof Object) {}
     }
     styles = { defaultStyles: styles };

[Survived] ObjectLiteral
src/client/common-frames/CommonFrames.class.ts:110:14
         return styles;
       }
     }
-    styles = { defaultStyles: styles };
+    styles = {};
     return styles;
   }

[Survived] BlockStatement
src/client/common-frames/CommonFrames.class.ts:114:72
     return styles;
   }
 
-  protected registerElements(fields: HTMLElement[], targets: string[]) {
-    targets.map((item, index) => {
-      const itemToChange = document.getElementById(item);
-      if (fields[index]) {
-        itemToChange.appendChild(fields[index]);
-      }
-    });
-  }
+  protected registerElements(fields: HTMLElement[], targets: string[]) {}
 
   protected setElementsFields() {

[Survived] BlockStatement
src/client/common-frames/CommonFrames.class.ts:115:34
   }
 
   protected registerElements(fields: HTMLElement[], targets: string[]) {
-    targets.map((item, index) => {
-      const itemToChange = document.getElementById(item);
-      if (fields[index]) {
-        itemToChange.appendChild(fields[index]);
-      }
-    });
+    targets.map((item, index) => {});
   }
 

[Survived] ConditionalExpression
src/client/common-frames/CommonFrames.class.ts:117:11
   protected registerElements(fields: HTMLElement[], targets: string[]) {
     targets.map((item, index) => {
       const itemToChange = document.getElementById(item);
-      if (fields[index]) {
+      if (false) {
         itemToChange.appendChild(fields[index]);
       }

[Survived] BlockStatement
src/client/common-frames/CommonFrames.class.ts:117:26
   protected registerElements(fields: HTMLElement[], targets: string[]) {
     targets.map((item, index) => {
       const itemToChange = document.getElementById(item);
-      if (fields[index]) {
-        itemToChange.appendChild(fields[index]);
-      }
+      if (fields[index]) {}
     });
   }

[Survived] BlockStatement
src/client/common-frames/CommonFrames.class.ts:123:33
     });
   }
 
-  protected setElementsFields() {
-    const elements = [];
-    elements.push(this.formId);
-    return elements;
-  }
+  protected setElementsFields() {}
 
   private _getSubmitFields(data: any) {

[Survived] BlockStatement
src/client/common-frames/CommonFrames.class.ts:129:39
     return elements;
   }
 
-  private _getSubmitFields(data: any) {
-    const fields = this._submitFields;
-    if (data.hasOwnProperty('jwt') && fields.indexOf('jwt') === -1) {
-      fields.push('jwt');
-    }
-    if (data.hasOwnProperty('threedresponse') && fields.indexOf('threedresponse') === -1) {
-      fields.push('threedresponse');
-    }
-    return fields;
-  }
+  private _getSubmitFields(data: any) {}
 
   private _initFormFields() {

[Survived] LogicalOperator
src/client/common-frames/CommonFrames.class.ts:131:9
 
   private _getSubmitFields(data: any) {
     const fields = this._submitFields;
-    if (data.hasOwnProperty('jwt') && fields.indexOf('jwt') === -1) {
+    if (data.hasOwnProperty('jwt') || fields.indexOf('jwt') === -1) {
       fields.push('jwt');
     }

[Survived] ConditionalExpression
src/client/common-frames/CommonFrames.class.ts:131:9
 
   private _getSubmitFields(data: any) {
     const fields = this._submitFields;
-    if (data.hasOwnProperty('jwt') && fields.indexOf('jwt') === -1) {
+    if (false) {
       fields.push('jwt');
     }

[Survived] ConditionalExpression
src/client/common-frames/CommonFrames.class.ts:134:50
     if (data.hasOwnProperty('jwt') && fields.indexOf('jwt') === -1) {
       fields.push('jwt');
     }
-    if (data.hasOwnProperty('threedresponse') && fields.indexOf('threedresponse') === -1) {
+    if (data.hasOwnProperty('threedresponse') && true) {
       fields.push('threedresponse');
     }

[Survived] ConditionalExpression
src/client/common-frames/CommonFrames.class.ts:134:50
     if (data.hasOwnProperty('jwt') && fields.indexOf('jwt') === -1) {
       fields.push('jwt');
     }
-    if (data.hasOwnProperty('threedresponse') && fields.indexOf('threedresponse') === -1) {
+    if (data.hasOwnProperty('threedresponse') && false) {
       fields.push('threedresponse');
     }

[Survived] BlockStatement
src/client/common-frames/CommonFrames.class.ts:140:29
     return fields;
   }
 
-  private _initFormFields() {
-    const { defaultStyles } = this.styles;
-    let { controlFrame } = this.styles;
-
-    controlFrame = Object.assign({}, defaultStyles, controlFrame);
-
-    this._controlFrame = this._iframeFactory.create(
-      CONTROL_FRAME_COMPONENT_NAME,
-      CONTROL_FRAME_IFRAME,
-      controlFrame,
-      {
-        gatewayUrl: this._gatewayUrl,
-        jwt: this.jwt,
-        origin: this.origin
-      },
-      -1
-    );
-
-    this.elementsToRegister.push(this._controlFrame);
-  }
+  private _initFormFields() {}
 
   private _isThreedComplete(data: any): boolean {

[Survived] UnaryOperator
src/client/common-frames/CommonFrames.class.ts:155:7
         jwt: this.jwt,
         origin: this.origin
       },
-      -1
+      +1
     );
 

[Survived] BlockStatement
src/client/common-frames/CommonFrames.class.ts:161:49
     this.elementsToRegister.push(this._controlFrame);
   }
 
-  private _isThreedComplete(data: any): boolean {
-    if (this.requestTypes[this.requestTypes.length - 1] !== 'THREEDQUERY') {
-      return false;
-    }
-
-    if (data.requesttypedescription !== 'THREEDQUERY') {
-      return false;
-    }
-
-    if (data.validated) {
-      return true;
-    }
-
-    if (data.acsurl !== undefined) {
-      return false;
-    }
-
-    if (data.threedresponse !== undefined) {
-      return true;
-    }
-
-    return data.enrolled !== 'Y';
-  }
+  private _isThreedComplete(data: any): boolean {}
 
   private _isTransactionFinished(data: any): boolean {

[Survived] EqualityOperator
src/client/common-frames/CommonFrames.class.ts:162:9
   }
 
   private _isThreedComplete(data: any): boolean {
-    if (this.requestTypes[this.requestTypes.length - 1] !== 'THREEDQUERY') {
+    if (this.requestTypes[this.requestTypes.length - 1] === 'THREEDQUERY') {
       return false;
     }

[Survived] ConditionalExpression
src/client/common-frames/CommonFrames.class.ts:162:9
   }
 
   private _isThreedComplete(data: any): boolean {
-    if (this.requestTypes[this.requestTypes.length - 1] !== 'THREEDQUERY') {
+    if (true) {
       return false;
     }

[Survived] BooleanLiteral
src/client/common-frames/CommonFrames.class.ts:163:14
 
   private _isThreedComplete(data: any): boolean {
     if (this.requestTypes[this.requestTypes.length - 1] !== 'THREEDQUERY') {
-      return false;
+      return true;
     }
 

[Survived] BlockStatement
src/client/common-frames/CommonFrames.class.ts:166:56
       return false;
     }
 
-    if (data.requesttypedescription !== 'THREEDQUERY') {
-      return false;
-    }
+    if (data.requesttypedescription !== 'THREEDQUERY') {}
 
     if (data.validated) {

[Survived] ConditionalExpression
src/client/common-frames/CommonFrames.class.ts:166:9
       return false;
     }
 
-    if (data.requesttypedescription !== 'THREEDQUERY') {
+    if (true) {
       return false;
     }

[Survived] BooleanLiteral
src/client/common-frames/CommonFrames.class.ts:167:14
     }
 
     if (data.requesttypedescription !== 'THREEDQUERY') {
-      return false;
+      return true;
     }
 

[Survived] BlockStatement
src/client/common-frames/CommonFrames.class.ts:170:25
       return false;
     }
 
-    if (data.validated) {
-      return true;
-    }
+    if (data.validated) {}
 
     if (data.acsurl !== undefined) {

[Survived] ConditionalExpression
src/client/common-frames/CommonFrames.class.ts:170:9
       return false;
     }
 
-    if (data.validated) {
+    if (false) {
       return true;
     }

[Survived] BooleanLiteral
src/client/common-frames/CommonFrames.class.ts:171:14
     }
 
     if (data.validated) {
-      return true;
+      return false;
     }
 

[Survived] ConditionalExpression
src/client/common-frames/CommonFrames.class.ts:174:9
       return true;
     }
 
-    if (data.acsurl !== undefined) {
+    if (false) {
       return false;
     }

[Survived] ConditionalExpression
src/client/common-frames/CommonFrames.class.ts:174:9
       return true;
     }
 
-    if (data.acsurl !== undefined) {
+    if (true) {
       return false;
     }

[Survived] BooleanLiteral
src/client/common-frames/CommonFrames.class.ts:175:14
     }
 
     if (data.acsurl !== undefined) {
-      return false;
+      return true;
     }
 

[Survived] ConditionalExpression
src/client/common-frames/CommonFrames.class.ts:178:9
       return false;
     }
 
-    if (data.threedresponse !== undefined) {
+    if (false) {
       return true;
     }

[Survived] BlockStatement
src/client/common-frames/CommonFrames.class.ts:178:44
       return false;
     }
 
-    if (data.threedresponse !== undefined) {
-      return true;
-    }
+    if (data.threedresponse !== undefined) {}
 
     return data.enrolled !== 'Y';

[Survived] BooleanLiteral
src/client/common-frames/CommonFrames.class.ts:179:14
     }
 
     if (data.threedresponse !== undefined) {
-      return true;
+      return false;
     }
 

[Survived] ConditionalExpression
src/client/common-frames/CommonFrames.class.ts:182:12
       return true;
     }
 
-    return data.enrolled !== 'Y';
+    return true;
   }
 

[Survived] ConditionalExpression
src/client/common-frames/CommonFrames.class.ts:182:12
       return true;
     }
 
-    return data.enrolled !== 'Y';
+    return false;
   }
 

[Survived] BlockStatement
src/client/common-frames/CommonFrames.class.ts:185:54
     return data.enrolled !== 'Y';
   }
 
-  private _isTransactionFinished(data: any): boolean {
-    if (CommonFrames.COMPLETED_REQUEST_TYPES.includes(data.requesttypedescription)) {
-      return true;
-    }
-
-    if (this._isThreedComplete(data)) {
-      return true;
-    }
-
-    const lastRequestType = [...this.requestTypes].pop();
-
-    if (data.requesttypedescription === lastRequestType && lastRequestType !== 'THREEDQUERY') {
-      return true;
-    }
-
-    return false;
-  }
+  private _isTransactionFinished(data: any): boolean {}
 
   private _onInput(event: Event) {

[Survived] BlockStatement
src/client/common-frames/CommonFrames.class.ts:186:85
   }
 
   private _isTransactionFinished(data: any): boolean {
-    if (CommonFrames.COMPLETED_REQUEST_TYPES.includes(data.requesttypedescription)) {
-      return true;
-    }
+    if (CommonFrames.COMPLETED_REQUEST_TYPES.includes(data.requesttypedescription)) {}
 
     if (this._isThreedComplete(data)) {

[Survived] ConditionalExpression
src/client/common-frames/CommonFrames.class.ts:186:9
   }
 
   private _isTransactionFinished(data: any): boolean {
-    if (CommonFrames.COMPLETED_REQUEST_TYPES.includes(data.requesttypedescription)) {
+    if (false) {
       return true;
     }

[Survived] BooleanLiteral
src/client/common-frames/CommonFrames.class.ts:187:14
 
   private _isTransactionFinished(data: any): boolean {
     if (CommonFrames.COMPLETED_REQUEST_TYPES.includes(data.requesttypedescription)) {
-      return true;
+      return false;
     }
 

[Survived] ConditionalExpression
src/client/common-frames/CommonFrames.class.ts:190:9
       return true;
     }
 
-    if (this._isThreedComplete(data)) {
+    if (true) {
       return true;
     }

[Survived] BlockStatement
src/client/common-frames/CommonFrames.class.ts:190:39
       return true;
     }
 
-    if (this._isThreedComplete(data)) {
-      return true;
-    }
+    if (this._isThreedComplete(data)) {}
 
     const lastRequestType = [...this.requestTypes].pop();

[Survived] BooleanLiteral
src/client/common-frames/CommonFrames.class.ts:191:14
     }
 
     if (this._isThreedComplete(data)) {
-      return true;
+      return false;
     }
 

[Survived] ArrayDeclaration
src/client/common-frames/CommonFrames.class.ts:194:29
       return true;
     }
 
-    const lastRequestType = [...this.requestTypes].pop();
+    const lastRequestType = [].pop();
 
     if (data.requesttypedescription === lastRequestType && lastRequestType !== 'THREEDQUERY') {

[Survived] LogicalOperator
src/client/common-frames/CommonFrames.class.ts:196:9
 
     const lastRequestType = [...this.requestTypes].pop();
 
-    if (data.requesttypedescription === lastRequestType && lastRequestType !== 'THREEDQUERY') {
+    if (data.requesttypedescription === lastRequestType || lastRequestType !== 'THREEDQUERY') {
       return true;
     }

[Survived] ConditionalExpression
src/client/common-frames/CommonFrames.class.ts:196:60
 
     const lastRequestType = [...this.requestTypes].pop();
 
-    if (data.requesttypedescription === lastRequestType && lastRequestType !== 'THREEDQUERY') {
+    if (data.requesttypedescription === lastRequestType && true) {
       return true;
     }

[Survived] BooleanLiteral
src/client/common-frames/CommonFrames.class.ts:197:14
     const lastRequestType = [...this.requestTypes].pop();
 
     if (data.requesttypedescription === lastRequestType && lastRequestType !== 'THREEDQUERY') {
-      return true;
+      return false;
     }
 

[Survived] BlockStatement
src/client/common-frames/CommonFrames.class.ts:203:34
     return false;
   }
 
-  private _onInput(event: Event) {
-    const messageBusEvent = {
-      data: DomMethods.parseForm(this.formId),
-      type: MessageBus.EVENTS_PUBLIC.UPDATE_MERCHANT_FIELDS
-    };
-    this._messageBus.publish(messageBusEvent);
-  }
+  private _onInput(event: Event) {}
 
   private _onTransactionComplete(data: any): void {

[Survived] ConditionalExpression
src/client/common-frames/CommonFrames.class.ts:212:46
   }
 
   private _onTransactionComplete(data: any): void {
-    if (this._isTransactionFinished(data) || data.errorcode !== '0') {
+    if (this._isTransactionFinished(data) || false) {
       this._messageBus.publish({ data, type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_SUBMIT_CALLBACK }, true);
     }

[Survived] BlockStatement
src/client/common-frames/CommonFrames.class.ts:212:70
   }
 
   private _onTransactionComplete(data: any): void {
-    if (this._isTransactionFinished(data) || data.errorcode !== '0') {
-      this._messageBus.publish({ data, type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_SUBMIT_CALLBACK }, true);
-    }
+    if (this._isTransactionFinished(data) || data.errorcode !== '0') {}
 
     let result: 'success' | 'error' | 'cancel';

[Survived] BooleanLiteral
src/client/common-frames/CommonFrames.class.ts:213:104
 
   private _onTransactionComplete(data: any): void {
     if (this._isTransactionFinished(data) || data.errorcode !== '0') {
-      this._messageBus.publish({ data, type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_SUBMIT_CALLBACK }, true);
+      this._messageBus.publish({ data, type: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_SUBMIT_CALLBACK }, false);
     }
 

[Survived] BooleanLiteral
src/client/common-frames/CommonFrames.class.ts:218:13
 
     let result: 'success' | 'error' | 'cancel';
 
-    switch (true) {
+    switch (false) {
       case this._isTransactionFinished(data) && data.errorcode === '0':
         result = 'success';

[Survived] ConditionalExpression
src/client/common-frames/CommonFrames.class.ts:219:12
     let result: 'success' | 'error' | 'cancel';
 
     switch (true) {
-      case this._isTransactionFinished(data) && data.errorcode === '0':
+      case true:
         result = 'success';
         data = { ...data, errormessage: PAYMENT_SUCCESS };

[Survived] ConditionalExpression
src/client/common-frames/CommonFrames.class.ts:219:12
     let result: 'success' | 'error' | 'cancel';
 
     switch (true) {
-      case this._isTransactionFinished(data) && data.errorcode === '0':
+      case false:
         result = 'success';
         data = { ...data, errormessage: PAYMENT_SUCCESS };

[Survived] StringLiteral
src/client/common-frames/CommonFrames.class.ts:220:18
 
     switch (true) {
       case this._isTransactionFinished(data) && data.errorcode === '0':
-        result = 'success';
+        result = "";
         data = { ...data, errormessage: PAYMENT_SUCCESS };
         break;

[Survived] ObjectLiteral
src/client/common-frames/CommonFrames.class.ts:221:16
     switch (true) {
       case this._isTransactionFinished(data) && data.errorcode === '0':
         result = 'success';
-        data = { ...data, errormessage: PAYMENT_SUCCESS };
+        data = {};
         break;
       case data.errorcode === 'cancelled':

[Survived] ConditionalExpression
src/client/common-frames/CommonFrames.class.ts:223:7
         result = 'success';
         data = { ...data, errormessage: PAYMENT_SUCCESS };
         break;
-      case data.errorcode === 'cancelled':
-        result = 'cancel';
-        data = { ...data, errormessage: PAYMENT_CANCELLED };
-        break;
+      case data.errorcode === 'cancelled':
       case data.errorcode !== '0':
         result = 'error';

[Survived] ConditionalExpression
src/client/common-frames/CommonFrames.class.ts:223:12
         result = 'success';
         data = { ...data, errormessage: PAYMENT_SUCCESS };
         break;
-      case data.errorcode === 'cancelled':
+      case false:
         result = 'cancel';
         data = { ...data, errormessage: PAYMENT_CANCELLED };

[Survived] ObjectLiteral
src/client/common-frames/CommonFrames.class.ts:225:16
         break;
       case data.errorcode === 'cancelled':
         result = 'cancel';
-        data = { ...data, errormessage: PAYMENT_CANCELLED };
+        data = {};
         break;
       case data.errorcode !== '0':

[Survived] ConditionalExpression
src/client/common-frames/CommonFrames.class.ts:227:12
         result = 'cancel';
         data = { ...data, errormessage: PAYMENT_CANCELLED };
         break;
-      case data.errorcode !== '0':
+      case true:
         result = 'error';
         break;

[Survived] EqualityOperator
src/client/common-frames/CommonFrames.class.ts:227:12
         result = 'cancel';
         data = { ...data, errormessage: PAYMENT_CANCELLED };
         break;
-      case data.errorcode !== '0':
+      case data.errorcode === '0':
         result = 'error';
         break;

[Survived] StringLiteral
src/client/common-frames/CommonFrames.class.ts:228:18
         data = { ...data, errormessage: PAYMENT_CANCELLED };
         break;
       case data.errorcode !== '0':
-        result = 'error';
+        result = "";
         break;
     }

[Survived] ConditionalExpression
src/client/common-frames/CommonFrames.class.ts:235:7
     this.addSubmitData(data);
 
     if (
-      (result === 'success' && this._submitOnSuccess) ||
-      (result === 'cancel' && this._submitOnCancel) ||
-      (result === 'error' && this._submitOnError)
+      true
     ) {
       this._submitForm();

[Survived] ConditionalExpression
src/client/common-frames/CommonFrames.class.ts:235:7
     this.addSubmitData(data);
 
     if (
-      (result === 'success' && this._submitOnSuccess) ||
-      (result === 'cancel' && this._submitOnCancel) ||
+      true ||
       (result === 'error' && this._submitOnError)
     ) {

[Survived] ConditionalExpression
src/client/common-frames/CommonFrames.class.ts:236:8
 
     if (
       (result === 'success' && this._submitOnSuccess) ||
-      (result === 'cancel' && this._submitOnCancel) ||
+      (false) ||
       (result === 'error' && this._submitOnError)
     ) {

[Survived] ConditionalExpression
src/client/common-frames/CommonFrames.class.ts:236:8
 
     if (
       (result === 'success' && this._submitOnSuccess) ||
-      (result === 'cancel' && this._submitOnCancel) ||
+      (false && this._submitOnCancel) ||
       (result === 'error' && this._submitOnError)
     ) {

[Survived] EqualityOperator
src/client/common-frames/CommonFrames.class.ts:237:8
     if (
       (result === 'success' && this._submitOnSuccess) ||
       (result === 'cancel' && this._submitOnCancel) ||
-      (result === 'error' && this._submitOnError)
+      (result !== 'error' && this._submitOnError)
     ) {
       this._submitForm();

[Survived] LogicalOperator
src/client/common-frames/CommonFrames.class.ts:237:8
     if (
       (result === 'success' && this._submitOnSuccess) ||
       (result === 'cancel' && this._submitOnCancel) ||
-      (result === 'error' && this._submitOnError)
+      (result === 'error' || this._submitOnError)
     ) {
       this._submitForm();

[Survived] BlockStatement
src/client/common-frames/CommonFrames.class.ts:238:7
       (result === 'success' && this._submitOnSuccess) ||
       (result === 'cancel' && this._submitOnCancel) ||
       (result === 'error' && this._submitOnError)
-    ) {
-      this._submitForm();
-    }
+    ) {}
   }
 

[Survived] BlockStatement
src/client/common-frames/CommonFrames.class.ts:243:25
     }
   }
 
-  private _submitForm() {
-    if (!this._formSubmitted) {
-      this._formSubmitted = true;
-      this._merchantForm.submit();
-    }
-  }
+  private _submitForm() {}
 
   private addSubmitData(data: any) {

[Survived] BlockStatement
src/client/common-frames/CommonFrames.class.ts:244:31
   }
 
   private _submitForm() {
-    if (!this._formSubmitted) {
-      this._formSubmitted = true;
-      this._merchantForm.submit();
-    }
+    if (!this._formSubmitted) {}
   }
 

[Survived] ConditionalExpression
src/client/common-frames/CommonFrames.class.ts:244:9
   }
 
   private _submitForm() {
-    if (!this._formSubmitted) {
+    if (false) {
       this._formSubmitted = true;
       this._merchantForm.submit();

[Survived] BooleanLiteral
src/client/common-frames/CommonFrames.class.ts:245:29
 
   private _submitForm() {
     if (!this._formSubmitted) {
-      this._formSubmitted = true;
+      this._formSubmitted = false;
       this._merchantForm.submit();
     }

[Survived] BlockStatement
src/client/common-frames/CommonFrames.class.ts:250:36
     }
   }
 
-  private addSubmitData(data: any) {
-    DomMethods.addDataToForm(this._merchantForm, data, this._getSubmitFields(data));
-  }
+  private addSubmitData(data: any) {}
 
   private _setMerchantInputListeners() {

[Survived] BlockStatement
src/client/common-frames/CommonFrames.class.ts:254:40
     DomMethods.addDataToForm(this._merchantForm, data, this._getSubmitFields(data));
   }
 
-  private _setMerchantInputListeners() {
-    const els = DomMethods.getAllFormElements(this._merchantForm);
-    for (const el of els) {
-      el.addEventListener('input', this._onInput.bind(this));
-    }
-  }
+  private _setMerchantInputListeners() {}
 
   private _setTransactionCompleteListener() {

[Survived] BlockStatement
src/client/common-frames/CommonFrames.class.ts:256:27
 
   private _setMerchantInputListeners() {
     const els = DomMethods.getAllFormElements(this._merchantForm);
-    for (const el of els) {
-      el.addEventListener('input', this._onInput.bind(this));
-    }
+    for (const el of els) {}
   }
 

[Survived] BlockStatement
src/client/common-frames/CommonFrames.class.ts:261:45
     }
   }
 
-  private _setTransactionCompleteListener() {
-    this._messageBus
-      .pipe(
-        ofType(MessageBus.EVENTS_PUBLIC.TRANSACTION_COMPLETE),
-        map(event => event.data),
-        takeUntil(this._destroy$)
-      )
-      .subscribe((data: any) => {
-        if (data.walletsource !== 'APPLEPAY') {
-          this._onTransactionComplete(data);
-          return;
-        }
-
-        this._localStorage
-          .select(store => store.completePayment)
-          .pipe(
-            filter((value: string) => value === 'true'),
-            first(),
-            delay(4000)
-          )
-          .subscribe(() => this._onTransactionComplete(data));
-      });
-  }
+  private _setTransactionCompleteListener() {}
 }
 

[Survived] ArrowFunction
src/client/common-frames/CommonFrames.class.ts:265:13
     this._messageBus
       .pipe(
         ofType(MessageBus.EVENTS_PUBLIC.TRANSACTION_COMPLETE),
-        map(event => event.data),
+        map(() => undefined),
         takeUntil(this._destroy$)
       )

[Survived] BlockStatement
src/client/common-frames/CommonFrames.class.ts:268:33
         map(event => event.data),
         takeUntil(this._destroy$)
       )
-      .subscribe((data: any) => {
-        if (data.walletsource !== 'APPLEPAY') {
-          this._onTransactionComplete(data);
-          return;
-        }
-
-        this._localStorage
-          .select(store => store.completePayment)
-          .pipe(
-            filter((value: string) => value === 'true'),
-            first(),
-            delay(4000)
-          )
-          .subscribe(() => this._onTransactionComplete(data));
-      });
+      .subscribe((data: any) => {});
   }
 }

[Survived] ConditionalExpression
src/client/common-frames/CommonFrames.class.ts:269:13
         takeUntil(this._destroy$)
       )
       .subscribe((data: any) => {
-        if (data.walletsource !== 'APPLEPAY') {
+        if (true) {
           this._onTransactionComplete(data);
           return;

[Survived] ConditionalExpression
src/client/common-frames/CommonFrames.class.ts:269:13
         takeUntil(this._destroy$)
       )
       .subscribe((data: any) => {
-        if (data.walletsource !== 'APPLEPAY') {
+        if (false) {
           this._onTransactionComplete(data);
           return;

[Survived] ArrowFunction
src/client/common-frames/CommonFrames.class.ts:275:19
         }
 
         this._localStorage
-          .select(store => store.completePayment)
+          .select(() => undefined)
           .pipe(
             filter((value: string) => value === 'true'),

[Survived] ConditionalExpression
src/client/common-frames/CommonFrames.class.ts:277:39
         this._localStorage
           .select(store => store.completePayment)
           .pipe(
-            filter((value: string) => value === 'true'),
+            filter((value: string) => false),
             first(),
             delay(4000)

[Survived] ConditionalExpression
src/client/common-frames/CommonFrames.class.ts:277:39
         this._localStorage
           .select(store => store.completePayment)
           .pipe(
-            filter((value: string) => value === 'true'),
+            filter((value: string) => true),
             first(),
             delay(4000)
