[Survived] ArrowFunction
src/client/common-frames/CommonFrames.class.ts:281:22
             first(),
             delay(4000)
           )
-          .subscribe(() => this._onTransactionComplete(data));
+          .subscribe(() => undefined);
       });
   }
