[Survived] ArrowFunction
src/client/dependency-injection/ServiceDefinitions.ts:6:46
 import { ConfigService } from '../../shared/services/config-service/ConfigService';
 import { PreventNavigationPopup } from '../message-subscribers/PreventNavigationPopup';
 
-Container.set({ id: ConfigProvider, factory: () => Container.get(ConfigService) });
+Container.set({ id: ConfigProvider, factory: () => undefined });
 
 Container.import([PreventNavigationPopup]);
