[Survived] BlockStatement
src/client/iframe-factory/IframeFactory.ts:24:104
     })
   );
 
-  create(name: string, id: string, styles?: IStyle, params?: {}, tabIndex?: number): HTMLIFrameElement {
-    const componentParams = new URLSearchParams(params).toString();
-    const componentStyles = new URLSearchParams(styles).toString();
-    const componentAddress = IframeFactory.URLS.get(name);
-    const iframe = document.createElement('iframe');
-    const src: string = `${componentAddress}?${componentStyles}${componentParams ? '&' + componentParams : ''}`;
-
-    const attributes: IframeFactoryAttributes = {
-      id,
-      class: id,
-      src,
-      name: id,
-      allowTransparency: true,
-      scrolling: 'no',
-      frameBorder: 0,
-      tabIndex
-    };
-
-    // @ts-ignore
-    Object.keys(attributes).forEach((value: string) => iframe.setAttribute(value, attributes[value]));
-    return iframe;
-  }
+  create(name: string, id: string, styles?: IStyle, params?: {}, tabIndex?: number): HTMLIFrameElement {}
 }
 

[Survived] StringLiteral
src/client/iframe-factory/IframeFactory.ts:28:43
     const componentParams = new URLSearchParams(params).toString();
     const componentStyles = new URLSearchParams(styles).toString();
     const componentAddress = IframeFactory.URLS.get(name);
-    const iframe = document.createElement('iframe');
+    const iframe = document.createElement("");
     const src: string = `${componentAddress}?${componentStyles}${componentParams ? '&' + componentParams : ''}`;
 

[Survived] ArithmeticOperator
src/client/iframe-factory/IframeFactory.ts:29:84
     const componentStyles = new URLSearchParams(styles).toString();
     const componentAddress = IframeFactory.URLS.get(name);
     const iframe = document.createElement('iframe');
-    const src: string = `${componentAddress}?${componentStyles}${componentParams ? '&' + componentParams : ''}`;
+    const src: string = `${componentAddress}?${componentStyles}${componentParams ? '&' - componentParams : ''}`;
 
     const attributes: IframeFactoryAttributes = {

[Survived] StringLiteral
src/client/iframe-factory/IframeFactory.ts:29:84
     const componentStyles = new URLSearchParams(styles).toString();
     const componentAddress = IframeFactory.URLS.get(name);
     const iframe = document.createElement('iframe');
-    const src: string = `${componentAddress}?${componentStyles}${componentParams ? '&' + componentParams : ''}`;
+    const src: string = `${componentAddress}?${componentStyles}${componentParams ? "" + componentParams : ''}`;
 
     const attributes: IframeFactoryAttributes = {

[Survived] BooleanLiteral
src/client/iframe-factory/IframeFactory.ts:36:26
       class: id,
       src,
       name: id,
-      allowTransparency: true,
+      allowTransparency: false,
       scrolling: 'no',
       frameBorder: 0,

[Survived] StringLiteral
src/client/iframe-factory/IframeFactory.ts:37:18
       src,
       name: id,
       allowTransparency: true,
-      scrolling: 'no',
+      scrolling: "",
       frameBorder: 0,
       tabIndex

[Survived] ArrowFunction
src/client/iframe-factory/IframeFactory.ts:43:37
     };
 
     // @ts-ignore
-    Object.keys(attributes).forEach((value: string) => iframe.setAttribute(value, attributes[value]));
+    Object.keys(attributes).forEach(() => undefined);
     return iframe;
   }
