[Survived] StringLiteral
src/client/merchant-fields/MerchantFields.ts:10:50
   private static readonly ADJACENT_HTML_PLACEMENT: InsertPosition = 'afterend';
   private static readonly DATA_ATTRIBUTE_NAME: string = 'data-st-name';
   private static readonly ERROR_LABEL_MARKUP: string = `<div class="st-error-label"></div>`;
-  private static readonly INPUT_MARKUP: string = 'input';
+  private static readonly INPUT_MARKUP: string = "";
   private static readonly KEYPRESS_EVENT: string = 'keypress';
 

[Survived] BlockStatement
src/client/merchant-fields/MerchantFields.ts:18:17
   private _validation: Validation;
   private _frame: Frame;
 
-  constructor() {
-    this._inputs = document.getElementsByTagName(MerchantFields.INPUT_MARKUP);
-    this._messageBus = Container.get(MessageBus);
-    this._frame = Container.get(Frame);
-    this._validation = new Validation();
-  }
+  constructor() {}
 
   public init(): void {

[Survived] BlockStatement
src/client/merchant-fields/MerchantFields.ts:25:23
     this._validation = new Validation();
   }
 
-  public init(): void {
-    this._setMerchantFieldsProperties();
-  }
+  public init(): void {}
 
   private _setMerchantFieldsProperties(): void {

[Survived] BlockStatement
src/client/merchant-fields/MerchantFields.ts:29:48
     this._setMerchantFieldsProperties();
   }
 
-  private _setMerchantFieldsProperties(): void {
-    const { inputs } = this._getMerchantInputs();
-    for (const item of inputs) {
-      const { inputElement, messageElement } = Validation.returnInputAndErrorContainerPair(item);
-      Validation.addErrorContainer(
-        inputElement,
-        MerchantFields.ADJACENT_HTML_PLACEMENT,
-        MerchantFields.ERROR_LABEL_MARKUP
-      );
-      this._onKeyPress(inputElement);
-      this._validation.backendValidation(inputElement, messageElement, MessageBus.EVENTS.VALIDATE_MERCHANT_FIELD);
-    }
-  }
+  private _setMerchantFieldsProperties(): void {}
 
   private _getMerchantInputs(): { inputs: HTMLInputElement[] } {

[Survived] BlockStatement
src/client/merchant-fields/MerchantFields.ts:31:32
 
   private _setMerchantFieldsProperties(): void {
     const { inputs } = this._getMerchantInputs();
-    for (const item of inputs) {
-      const { inputElement, messageElement } = Validation.returnInputAndErrorContainerPair(item);
-      Validation.addErrorContainer(
-        inputElement,
-        MerchantFields.ADJACENT_HTML_PLACEMENT,
-        MerchantFields.ERROR_LABEL_MARKUP
-      );
-      this._onKeyPress(inputElement);
-      this._validation.backendValidation(inputElement, messageElement, MessageBus.EVENTS.VALIDATE_MERCHANT_FIELD);
-    }
+    for (const item of inputs) {}
   }
 

[Survived] BlockStatement
src/client/merchant-fields/MerchantFields.ts:43:64
     }
   }
 
-  private _getMerchantInputs(): { inputs: HTMLInputElement[] } {
-    return {
-      inputs: Array.from(this._inputs).filter(item =>
-        item.hasAttribute(MerchantFields.DATA_ATTRIBUTE_NAME)
-      ) as HTMLInputElement[]
-    };
-  }
+  private _getMerchantInputs(): { inputs: HTMLInputElement[] } {}
 
   private _onKeyPress(input: HTMLInputElement): void {

[Survived] ObjectLiteral
src/client/merchant-fields/MerchantFields.ts:44:12
   }
 
   private _getMerchantInputs(): { inputs: HTMLInputElement[] } {
-    return {
-      inputs: Array.from(this._inputs).filter(item =>
-        item.hasAttribute(MerchantFields.DATA_ATTRIBUTE_NAME)
-      ) as HTMLInputElement[]
-    };
+    return {};
   }
 

[Survived] BlockStatement
src/client/merchant-fields/MerchantFields.ts:51:54
     };
   }
 
-  private _onKeyPress(input: HTMLInputElement): void {
-    input.addEventListener(MerchantFields.KEYPRESS_EVENT, () => {
-      Validation.resetValidationProperties(input);
-    });
-  }
+  private _onKeyPress(input: HTMLInputElement): void {}
 }
 

[Survived] BlockStatement
src/client/merchant-fields/MerchantFields.ts:52:65
   }
 
   private _onKeyPress(input: HTMLInputElement): void {
-    input.addEventListener(MerchantFields.KEYPRESS_EVENT, () => {
-      Validation.resetValidationProperties(input);
-    });
+    input.addEventListener(MerchantFields.KEYPRESS_EVENT, () => {});
   }
 }
