[Survived] BlockStatement
src/client/message-subscribers/PreventNavigationPopup.ts:13:42
 export class PreventNavigationPopup implements IMessageSubscriber {
   constructor(@Inject(WINDOW) private window: Window) {}
 
-  register(messageBus: MessageBus): void {
-    const destroy = messageBus.pipe(ofType(PUBLIC_EVENTS.DESTROY));
-    const beforeUnloadHandler = (event: BeforeUnloadEvent) => {
-      event.preventDefault();
-      event.returnValue = undefined;
-    };
-
-    messageBus
-      .pipe(ofType(PUBLIC_EVENTS.SUBMIT_FORM), takeUntil(destroy))
-      .subscribe(() => this.window.addEventListener('beforeunload', beforeUnloadHandler));
-
-    messageBus
-      .pipe(ofType(PUBLIC_EVENTS.CALL_MERCHANT_SUBMIT_CALLBACK), takeUntil(destroy))
-      .subscribe(() => this.window.removeEventListener('beforeunload', beforeUnloadHandler));
-  }
+  register(messageBus: MessageBus): void {}
 }
 

[Survived] BlockStatement
src/client/message-subscribers/PreventNavigationPopup.ts:15:63
 
   register(messageBus: MessageBus): void {
     const destroy = messageBus.pipe(ofType(PUBLIC_EVENTS.DESTROY));
-    const beforeUnloadHandler = (event: BeforeUnloadEvent) => {
-      event.preventDefault();
-      event.returnValue = undefined;
-    };
+    const beforeUnloadHandler = (event: BeforeUnloadEvent) => {};
 
     messageBus

[Survived] ArrowFunction
src/client/message-subscribers/PreventNavigationPopup.ts:22:18
 
     messageBus
       .pipe(ofType(PUBLIC_EVENTS.SUBMIT_FORM), takeUntil(destroy))
-      .subscribe(() => this.window.addEventListener('beforeunload', beforeUnloadHandler));
+      .subscribe(() => undefined);
 
     messageBus

[Survived] ArrowFunction
src/client/message-subscribers/PreventNavigationPopup.ts:26:18
 
     messageBus
       .pipe(ofType(PUBLIC_EVENTS.CALL_MERCHANT_SUBMIT_CALLBACK), takeUntil(destroy))
-      .subscribe(() => this.window.removeEventListener('beforeunload', beforeUnloadHandler));
+      .subscribe(() => undefined);
   }
 }

[Survived] StringLiteral
src/client/message-subscribers/PreventNavigationPopup.ts:26:56
 
     messageBus
       .pipe(ofType(PUBLIC_EVENTS.CALL_MERCHANT_SUBMIT_CALLBACK), takeUntil(destroy))
-      .subscribe(() => this.window.removeEventListener('beforeunload', beforeUnloadHandler));
+      .subscribe(() => this.window.removeEventListener("", beforeUnloadHandler));
   }
 }
