[Survived] BlockStatement
src/client/notification/NotificationService.ts:11:46
 export class NotificationService {
   constructor(private _messageBus: MessageBus, private _configProvider: ConfigProvider) {}
 
-  private get disableNotification(): boolean {
-    return this._configProvider.getConfig() ? this._configProvider.getConfig().disableNotification : false;
-  }
+  private get disableNotification(): boolean {}
 
   private get submitOnError(): boolean {

[Survived] BooleanLiteral
src/client/notification/NotificationService.ts:12:102
   constructor(private _messageBus: MessageBus, private _configProvider: ConfigProvider) {}
 
   private get disableNotification(): boolean {
-    return this._configProvider.getConfig() ? this._configProvider.getConfig().disableNotification : false;
+    return this._configProvider.getConfig() ? this._configProvider.getConfig().disableNotification : true;
   }
 

[Survived] BlockStatement
src/client/notification/NotificationService.ts:15:40
     return this._configProvider.getConfig() ? this._configProvider.getConfig().disableNotification : false;
   }
 
-  private get submitOnError(): boolean {
-    return this._configProvider.getConfig() ? this._configProvider.getConfig().submitOnError : false;
-  }
+  private get submitOnError(): boolean {}
 
   private get submitOnSuccess(): boolean {

[Survived] BooleanLiteral
src/client/notification/NotificationService.ts:16:96
   }
 
   private get submitOnError(): boolean {
-    return this._configProvider.getConfig() ? this._configProvider.getConfig().submitOnError : false;
+    return this._configProvider.getConfig() ? this._configProvider.getConfig().submitOnError : true;
   }
 

[Survived] BlockStatement
src/client/notification/NotificationService.ts:19:42
     return this._configProvider.getConfig() ? this._configProvider.getConfig().submitOnError : false;
   }
 
-  private get submitOnSuccess(): boolean {
-    return this._configProvider.getConfig() ? this._configProvider.getConfig().submitOnSuccess : false;
-  }
+  private get submitOnSuccess(): boolean {}
 
   private get submitOnCancel(): boolean {

[Survived] BooleanLiteral
src/client/notification/NotificationService.ts:20:98
   }
 
   private get submitOnSuccess(): boolean {
-    return this._configProvider.getConfig() ? this._configProvider.getConfig().submitOnSuccess : false;
+    return this._configProvider.getConfig() ? this._configProvider.getConfig().submitOnSuccess : true;
   }
 

[Survived] BlockStatement
src/client/notification/NotificationService.ts:23:41
     return this._configProvider.getConfig() ? this._configProvider.getConfig().submitOnSuccess : false;
   }
 
-  private get submitOnCancel(): boolean {
-    return this._configProvider.getConfig() ? this._configProvider.getConfig().submitOnCancel : false;
-  }
+  private get submitOnCancel(): boolean {}
 
   public error(message: string): void {

[Survived] BooleanLiteral
src/client/notification/NotificationService.ts:24:97
   }
 
   private get submitOnCancel(): boolean {
-    return this._configProvider.getConfig() ? this._configProvider.getConfig().submitOnCancel : false;
+    return this._configProvider.getConfig() ? this._configProvider.getConfig().submitOnCancel : true;
   }
 

[Survived] BlockStatement
src/client/notification/NotificationService.ts:27:39
     return this._configProvider.getConfig() ? this._configProvider.getConfig().submitOnCancel : false;
   }
 
-  public error(message: string): void {
-    if (!this.disableNotification && !this.submitOnError) {
-      this._setNotification(NotificationType.Error, message);
-    }
-  }
+  public error(message: string): void {}
 
   public info(message: string): void {

[Survived] ConditionalExpression
src/client/notification/NotificationService.ts:28:9
   }
 
   public error(message: string): void {
-    if (!this.disableNotification && !this.submitOnError) {
+    if (true) {
       this._setNotification(NotificationType.Error, message);
     }

[Survived] BooleanLiteral
src/client/notification/NotificationService.ts:28:9
   }
 
   public error(message: string): void {
-    if (!this.disableNotification && !this.submitOnError) {
+    if (this.disableNotification && !this.submitOnError) {
       this._setNotification(NotificationType.Error, message);
     }

[Survived] BlockStatement
src/client/notification/NotificationService.ts:33:38
     }
   }
 
-  public info(message: string): void {
-    this._setNotification(NotificationType.Info, message);
-  }
+  public info(message: string): void {}
 
   public success(message: string): void {

[Survived] BlockStatement
src/client/notification/NotificationService.ts:37:41
     this._setNotification(NotificationType.Info, message);
   }
 
-  public success(message: string): void {
-    if (!this.disableNotification && !this.submitOnSuccess) {
-      this._setNotification(NotificationType.Success, message);
-    }
-  }
+  public success(message: string): void {}
 
   public cancel(message: string): void {

[Survived] BlockStatement
src/client/notification/NotificationService.ts:38:61
   }
 
   public success(message: string): void {
-    if (!this.disableNotification && !this.submitOnSuccess) {
-      this._setNotification(NotificationType.Success, message);
-    }
+    if (!this.disableNotification && !this.submitOnSuccess) {}
   }
 

[Survived] ConditionalExpression
src/client/notification/NotificationService.ts:38:9
   }
 
   public success(message: string): void {
-    if (!this.disableNotification && !this.submitOnSuccess) {
+    if (false) {
       this._setNotification(NotificationType.Success, message);
     }

[Survived] BlockStatement
src/client/notification/NotificationService.ts:43:40
     }
   }
 
-  public cancel(message: string): void {
-    if (!this.disableNotification && !this.submitOnCancel) {
-      this._setNotification(NotificationType.Cancel, message);
-    }
-  }
+  public cancel(message: string): void {}
 
   private _setNotification(type: string, content: string): void {

[Survived] BooleanLiteral
src/client/notification/NotificationService.ts:44:38
   }
 
   public cancel(message: string): void {
-    if (!this.disableNotification && !this.submitOnCancel) {
+    if (!this.disableNotification && this.submitOnCancel) {
       this._setNotification(NotificationType.Cancel, message);
     }

[Survived] ConditionalExpression
src/client/notification/NotificationService.ts:44:9
   }
 
   public cancel(message: string): void {
-    if (!this.disableNotification && !this.submitOnCancel) {
+    if (false) {
       this._setNotification(NotificationType.Cancel, message);
     }

[Survived] BlockStatement
src/client/notification/NotificationService.ts:49:65
     }
   }
 
-  private _setNotification(type: string, content: string): void {
-    const messageBusEvent: IMessageBusEvent = {
-      data: { content, type },
-      type: MessageBus.EVENTS_PUBLIC.NOTIFICATION
-    };
-    this._messageBus.publish(messageBusEvent, true);
-  }
+  private _setNotification(type: string, content: string): void {}
 }
 
