[Survived] StringLiteral
src/client/st/ST.ts:50:43
 export class ST {
   private static DEBOUNCE_JWT_VALUE: number = 900;
   private static JWT_NOT_SPECIFIED_MESSAGE: string = 'Jwt has not been specified';
-  private static LOCALE_STORAGE: string = 'locale';
+  private static LOCALE_STORAGE: string = "";
   private static MERCHANT_TRANSLATIONS_STORAGE: string = 'merchantTranslations';
   private static readonly MODAL_CONTROL_FRAME_CLASS = 'modal';

[Survived] StringLiteral
src/client/st/ST.ts:52:55
   private static JWT_NOT_SPECIFIED_MESSAGE: string = 'Jwt has not been specified';
   private static LOCALE_STORAGE: string = 'locale';
   private static MERCHANT_TRANSLATIONS_STORAGE: string = 'merchantTranslations';
-  private static readonly MODAL_CONTROL_FRAME_CLASS = 'modal';
+  private static readonly MODAL_CONTROL_FRAME_CLASS = "";
   private static readonly BUTTON_SUBMIT_SELECTOR: string = 'button[type="submit"]';
   private static readonly INPUT_SUBMIT_SELECTOR: string = 'input[type="submit"]';

[Survived] StringLiteral
src/client/st/ST.ts:53:60
   private static LOCALE_STORAGE: string = 'locale';
   private static MERCHANT_TRANSLATIONS_STORAGE: string = 'merchantTranslations';
   private static readonly MODAL_CONTROL_FRAME_CLASS = 'modal';
-  private static readonly BUTTON_SUBMIT_SELECTOR: string = 'button[type="submit"]';
+  private static readonly BUTTON_SUBMIT_SELECTOR: string = "";
   private static readonly INPUT_SUBMIT_SELECTOR: string = 'input[type="submit"]';
   private static readonly BUTTON_DISABLED_CLASS: string = 'st-button-submit__disabled';

[Survived] StringLiteral
src/client/st/ST.ts:55:59
   private static readonly MODAL_CONTROL_FRAME_CLASS = 'modal';
   private static readonly BUTTON_SUBMIT_SELECTOR: string = 'button[type="submit"]';
   private static readonly INPUT_SUBMIT_SELECTOR: string = 'input[type="submit"]';
-  private static readonly BUTTON_DISABLED_CLASS: string = 'st-button-submit__disabled';
+  private static readonly BUTTON_DISABLED_CLASS: string = "";
   private _config: IConfig;
   private _cardFrames: CardFrames;

[Survived] BlockStatement
src/client/st/ST.ts:65:63
   private _destroy$: Subject<void> = new Subject();
   private _registeredCallbacks: { [eventName: string]: Subscription } = {};
 
-  set submitCallback(callback: (event: ISubmitEvent) => void) {
-    if (callback) {
-      this.on('submit', callback);
-    } else {
-      this.off('submit');
-    }
-  }
+  set submitCallback(callback: (event: ISubmitEvent) => void) {}
 
   set successCallback(callback: (event: ISuccessEvent) => void) {

[Survived] BlockStatement
src/client/st/ST.ts:66:19
   private _registeredCallbacks: { [eventName: string]: Subscription } = {};
 
   set submitCallback(callback: (event: ISubmitEvent) => void) {
-    if (callback) {
-      this.on('submit', callback);
-    } else {
+    if (callback) {} else {
       this.off('submit');
     }

[Survived] ConditionalExpression
src/client/st/ST.ts:66:9
   private _registeredCallbacks: { [eventName: string]: Subscription } = {};
 
   set submitCallback(callback: (event: ISubmitEvent) => void) {
-    if (callback) {
+    if (false) {
       this.on('submit', callback);
     } else {

[Survived] BlockStatement
src/client/st/ST.ts:68:12
   set submitCallback(callback: (event: ISubmitEvent) => void) {
     if (callback) {
       this.on('submit', callback);
-    } else {
-      this.off('submit');
-    }
+    } else {}
   }
 

[Survived] BlockStatement
src/client/st/ST.ts:73:65
     }
   }
 
-  set successCallback(callback: (event: ISuccessEvent) => void) {
-    if (callback) {
-      this.on('success', callback);
-    } else {
-      this.off('success');
-    }
-  }
+  set successCallback(callback: (event: ISuccessEvent) => void) {}
 
   set errorCallback(callback: (event: IErrorEvent) => void) {

[Survived] BlockStatement
src/client/st/ST.ts:74:19
   }
 
   set successCallback(callback: (event: ISuccessEvent) => void) {
-    if (callback) {
-      this.on('success', callback);
-    } else {
+    if (callback) {} else {
       this.off('success');
     }

[Survived] ConditionalExpression
src/client/st/ST.ts:74:9
   }
 
   set successCallback(callback: (event: ISuccessEvent) => void) {
-    if (callback) {
+    if (true) {
       this.on('success', callback);
     } else {

[Survived] StringLiteral
src/client/st/ST.ts:75:15
 
   set successCallback(callback: (event: ISuccessEvent) => void) {
     if (callback) {
-      this.on('success', callback);
+      this.on("", callback);
     } else {
       this.off('success');

[Survived] BlockStatement
src/client/st/ST.ts:76:12
   set successCallback(callback: (event: ISuccessEvent) => void) {
     if (callback) {
       this.on('success', callback);
-    } else {
-      this.off('success');
-    }
+    } else {}
   }
 

[Survived] BlockStatement
src/client/st/ST.ts:81:61
     }
   }
 
-  set errorCallback(callback: (event: IErrorEvent) => void) {
-    if (callback) {
-      this.on('error', callback);
-    } else {
-      this.off('error');
-    }
-  }
+  set errorCallback(callback: (event: IErrorEvent) => void) {}
 
   set cancelCallback(callback: (event: IErrorEvent) => void) {

[Survived] ConditionalExpression
src/client/st/ST.ts:82:9
   }
 
   set errorCallback(callback: (event: IErrorEvent) => void) {
-    if (callback) {
+    if (true) {
       this.on('error', callback);
     } else {

[Survived] ConditionalExpression
src/client/st/ST.ts:82:9
   }
 
   set errorCallback(callback: (event: IErrorEvent) => void) {
-    if (callback) {
+    if (false) {
       this.on('error', callback);
     } else {

[Survived] StringLiteral
src/client/st/ST.ts:83:15
 
   set errorCallback(callback: (event: IErrorEvent) => void) {
     if (callback) {
-      this.on('error', callback);
+      this.on("", callback);
     } else {
       this.off('error');

[Survived] BlockStatement
src/client/st/ST.ts:84:12
   set errorCallback(callback: (event: IErrorEvent) => void) {
     if (callback) {
       this.on('error', callback);
-    } else {
-      this.off('error');
-    }
+    } else {}
   }
 

[Survived] BlockStatement
src/client/st/ST.ts:89:62
     }
   }
 
-  set cancelCallback(callback: (event: IErrorEvent) => void) {
-    if (callback) {
-      this.on('cancel', callback);
-    } else {
-      this.off('cancel');
-    }
-  }
+  set cancelCallback(callback: (event: IErrorEvent) => void) {}
 
   constructor(

[Survived] BlockStatement
src/client/st/ST.ts:90:19
   }
 
   set cancelCallback(callback: (event: IErrorEvent) => void) {
-    if (callback) {
-      this.on('cancel', callback);
-    } else {
+    if (callback) {} else {
       this.off('cancel');
     }

[Survived] ConditionalExpression
src/client/st/ST.ts:90:9
   }
 
   set cancelCallback(callback: (event: IErrorEvent) => void) {
-    if (callback) {
+    if (false) {
       this.on('cancel', callback);
     } else {

[Survived] BlockStatement
src/client/st/ST.ts:92:12
   set cancelCallback(callback: (event: IErrorEvent) => void) {
     if (callback) {
       this.on('cancel', callback);
-    } else {
-      this.off('cancel');
-    }
+    } else {}
   }
 

[Survived] StringLiteral
src/client/st/ST.ts:93:16
     if (callback) {
       this.on('cancel', callback);
     } else {
-      this.off('cancel');
+      this.off("");
     }
   }

[Survived] BlockStatement
src/client/st/ST.ts:108:5
     private _iframeFactory: IframeFactory,
     private _frameService: Frame,
     private _browserDetector: BrowserDetector
-  ) {
-    this._googleAnalytics = new GoogleAnalytics();
-    this._merchantFields = new MerchantFields();
-  }
+  ) {}
 
   public on(eventName: 'success' | 'error' | 'submit' | 'cancel', callback: (event: any) => void): void {

[Survived] BlockStatement
src/client/st/ST.ts:113:105
     this._merchantFields = new MerchantFields();
   }
 
-  public on(eventName: 'success' | 'error' | 'submit' | 'cancel', callback: (event: any) => void): void {
-    const events = {
-      cancel: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_CANCEL_CALLBACK,
-      success: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_SUCCESS_CALLBACK,
-      error: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_ERROR_CALLBACK,
-      submit: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_SUBMIT_CALLBACK
-    };
-
-    this.off(eventName);
-
-    this._registeredCallbacks[eventName] = this._messageBus
-      .pipe(
-        ofType(events[eventName]),
-        map(event => event.data),
-        delay(0),
-        takeUntil(this._destroy$)
-      )
-      .subscribe(callback);
-  }
+  public on(eventName: 'success' | 'error' | 'submit' | 'cancel', callback: (event: any) => void): void {}
 
   public off(eventName: string): void {

[Survived] ObjectLiteral
src/client/st/ST.ts:114:20
   }
 
   public on(eventName: 'success' | 'error' | 'submit' | 'cancel', callback: (event: any) => void): void {
-    const events = {
-      cancel: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_CANCEL_CALLBACK,
-      success: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_SUCCESS_CALLBACK,
-      error: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_ERROR_CALLBACK,
-      submit: MessageBus.EVENTS_PUBLIC.CALL_MERCHANT_SUBMIT_CALLBACK
-    };
+    const events = {};
 
     this.off(eventName);

[Survived] ArrowFunction
src/client/st/ST.ts:126:13
     this._registeredCallbacks[eventName] = this._messageBus
       .pipe(
         ofType(events[eventName]),
-        map(event => event.data),
+        map(() => undefined),
         delay(0),
         takeUntil(this._destroy$)

[Survived] BlockStatement
src/client/st/ST.ts:133:39
       .subscribe(callback);
   }
 
-  public off(eventName: string): void {
-    if (this._registeredCallbacks[eventName]) {
-      this._registeredCallbacks[eventName].unsubscribe();
-      this._registeredCallbacks[eventName] = undefined;
-    }
-  }
+  public off(eventName: string): void {}
 
   public Components(config: IComponentsConfig | undefined): void {

[Survived] BlockStatement
src/client/st/ST.ts:134:47
   }
 
   public off(eventName: string): void {
-    if (this._registeredCallbacks[eventName]) {
-      this._registeredCallbacks[eventName].unsubscribe();
-      this._registeredCallbacks[eventName] = undefined;
-    }
+    if (this._registeredCallbacks[eventName]) {}
   }
 

[Survived] ConditionalExpression
src/client/st/ST.ts:134:9
   }
 
   public off(eventName: string): void {
-    if (this._registeredCallbacks[eventName]) {
+    if (false) {
       this._registeredCallbacks[eventName].unsubscribe();
       this._registeredCallbacks[eventName] = undefined;

[Survived] ConditionalExpression
src/client/st/ST.ts:141:9
   }
 
   public Components(config: IComponentsConfig | undefined): void {
-    if (config) {
+    if (false) {
       this._config = this._configService.updateFragment('components', config);
     }

[Survived] ConditionalExpression
src/client/st/ST.ts:141:9
   }
 
   public Components(config: IComponentsConfig | undefined): void {
-    if (config) {
+    if (true) {
       this._config = this._configService.updateFragment('components', config);
     }

[Survived] BlockStatement
src/client/st/ST.ts:151:35
     this._framesHub
       .waitForFrame(CONTROL_FRAME_IFRAME)
       .pipe(
-        switchMap(controlFrame => {
-          const queryEvent: IMessageBusEvent<string> = {
-            type: PUBLIC_EVENTS.INIT_CONTROL_FRAME,
-            data: JSON.stringify(this._config)
-          };
-
-          return from(this._communicator.query(queryEvent, controlFrame));
-        })
+        switchMap(controlFrame => {})
       )
       .subscribe(() => {

[Survived] BlockStatement
src/client/st/ST.ts:160:24
           return from(this._communicator.query(queryEvent, controlFrame));
         })
       )
-      .subscribe(() => {
-        this.CardFrames();
-        this._cardFrames.init();
-        this._merchantFields.init();
-      });
+      .subscribe(() => {});
   }
 

[Survived] BlockStatement
src/client/st/ST.ts:167:60
       });
   }
 
-  public ApplePay(config: IApplePay | undefined): ApplePay {
-    const { applepay } = this.Environment();
-
-    if (config) {
-      this._config = this._configService.updateFragment('applePay', config);
-    }
-
-    return new applepay(this._configProvider, this._communicator);
-  }
+  public ApplePay(config: IApplePay | undefined): ApplePay {}
 
   public VisaCheckout(config: IVisaConfig | undefined): VisaCheckout {

[Survived] ConditionalExpression
src/client/st/ST.ts:170:9
   public ApplePay(config: IApplePay | undefined): ApplePay {
     const { applepay } = this.Environment();
 
-    if (config) {
+    if (true) {
       this._config = this._configService.updateFragment('applePay', config);
     }

[Survived] BlockStatement
src/client/st/ST.ts:170:17
   public ApplePay(config: IApplePay | undefined): ApplePay {
     const { applepay } = this.Environment();
 
-    if (config) {
-      this._config = this._configService.updateFragment('applePay', config);
-    }
+    if (config) {}
 
     return new applepay(this._configProvider, this._communicator);

[Survived] BlockStatement
src/client/st/ST.ts:177:70
     return new applepay(this._configProvider, this._communicator);
   }
 
-  public VisaCheckout(config: IVisaConfig | undefined): VisaCheckout {
-    const { visa } = this.Environment();
-
-    if (config) {
-      this._config = this._configService.updateFragment('visaCheckout', config);
-    }
-
-    return new visa(this._configProvider, this._communicator);
-  }
+  public VisaCheckout(config: IVisaConfig | undefined): VisaCheckout {}
 
   public Cybertonica(): Promise<string> {

[Survived] ConditionalExpression
src/client/st/ST.ts:180:9
   public VisaCheckout(config: IVisaConfig | undefined): VisaCheckout {
     const { visa } = this.Environment();
 
-    if (config) {
+    if (false) {
       this._config = this._configService.updateFragment('visaCheckout', config);
     }

[Survived] StringLiteral
src/client/st/ST.ts:181:57
     const { visa } = this.Environment();
 
     if (config) {
-      this._config = this._configService.updateFragment('visaCheckout', config);
+      this._config = this._configService.updateFragment("", config);
     }
 

[Survived] BlockStatement
src/client/st/ST.ts:187:41
     return new visa(this._configProvider, this._communicator);
   }
 
-  public Cybertonica(): Promise<string> {
-    return new Promise(resolve =>
-      this._framesHub
-        .waitForFrame(CONTROL_FRAME_IFRAME)
-        .pipe(
-          switchMap((controlFrame: string) =>
-            from(this._communicator.query({ type: MessageBus.EVENTS_PUBLIC.GET_CYBERTONICA_TID }, controlFrame))
-          )
-        )
-        .subscribe((tid: string) => {
-          resolve(tid);
-        })
-    );
-  }
+  public Cybertonica(): Promise<string> {}
 
   public updateJWT(jwt: string): void {

[Survived] ArrowFunction
src/client/st/ST.ts:188:24
   }
 
   public Cybertonica(): Promise<string> {
-    return new Promise(resolve =>
-      this._framesHub
-        .waitForFrame(CONTROL_FRAME_IFRAME)
-        .pipe(
-          switchMap((controlFrame: string) =>
-            from(this._communicator.query({ type: MessageBus.EVENTS_PUBLIC.GET_CYBERTONICA_TID }, controlFrame))
-          )
-        )
-        .subscribe((tid: string) => {
-          resolve(tid);
-        })
+    return new Promise(() => undefined
     );
   }

[Survived] ArrowFunction
src/client/st/ST.ts:192:21
       this._framesHub
         .waitForFrame(CONTROL_FRAME_IFRAME)
         .pipe(
-          switchMap((controlFrame: string) =>
-            from(this._communicator.query({ type: MessageBus.EVENTS_PUBLIC.GET_CYBERTONICA_TID }, controlFrame))
+          switchMap(() => undefined
           )
         )

[Survived] ObjectLiteral
src/client/st/ST.ts:193:43
         .waitForFrame(CONTROL_FRAME_IFRAME)
         .pipe(
           switchMap((controlFrame: string) =>
-            from(this._communicator.query({ type: MessageBus.EVENTS_PUBLIC.GET_CYBERTONICA_TID }, controlFrame))
+            from(this._communicator.query({}, controlFrame))
           )
         )

[Survived] BlockStatement
src/client/st/ST.ts:196:37
             from(this._communicator.query({ type: MessageBus.EVENTS_PUBLIC.GET_CYBERTONICA_TID }, controlFrame))
           )
         )
-        .subscribe((tid: string) => {
-          resolve(tid);
-        })
+        .subscribe((tid: string) => {})
     );
   }

[Survived] BlockStatement
src/client/st/ST.ts:202:39
     );
   }
 
-  public updateJWT(jwt: string): void {
-    if (jwt) {
-      this._config = this._configService.updateJwt(jwt);
-      (() => {
-        const a = StCodec.updateJWTValue(jwt);
-        debounce(() => a, ST.DEBOUNCE_JWT_VALUE);
-      })();
-    } else {
-      throw Error(this._translation.translate(ST.JWT_NOT_SPECIFIED_MESSAGE));
-    }
-  }
+  public updateJWT(jwt: string): void {}
 
   public destroy(): void {

[Survived] ConditionalExpression
src/client/st/ST.ts:203:9
   }
 
   public updateJWT(jwt: string): void {
-    if (jwt) {
+    if (false) {
       this._config = this._configService.updateJwt(jwt);
       (() => {

[Survived] BlockStatement
src/client/st/ST.ts:203:14
   }
 
   public updateJWT(jwt: string): void {
-    if (jwt) {
-      this._config = this._configService.updateJwt(jwt);
-      (() => {
-        const a = StCodec.updateJWTValue(jwt);
-        debounce(() => a, ST.DEBOUNCE_JWT_VALUE);
-      })();
-    } else {
+    if (jwt) {} else {
       throw Error(this._translation.translate(ST.JWT_NOT_SPECIFIED_MESSAGE));
     }

[Survived] BlockStatement
src/client/st/ST.ts:205:14
   public updateJWT(jwt: string): void {
     if (jwt) {
       this._config = this._configService.updateJwt(jwt);
-      (() => {
-        const a = StCodec.updateJWTValue(jwt);
-        debounce(() => a, ST.DEBOUNCE_JWT_VALUE);
-      })();
+      (() => {})();
     } else {
       throw Error(this._translation.translate(ST.JWT_NOT_SPECIFIED_MESSAGE));

[Survived] ArrowFunction
src/client/st/ST.ts:207:18
       this._config = this._configService.updateJwt(jwt);
       (() => {
         const a = StCodec.updateJWTValue(jwt);
-        debounce(() => a, ST.DEBOUNCE_JWT_VALUE);
+        debounce(() => undefined, ST.DEBOUNCE_JWT_VALUE);
       })();
     } else {

[Survived] BlockStatement
src/client/st/ST.ts:209:12
         const a = StCodec.updateJWTValue(jwt);
         debounce(() => a, ST.DEBOUNCE_JWT_VALUE);
       })();
-    } else {
-      throw Error(this._translation.translate(ST.JWT_NOT_SPECIFIED_MESSAGE));
-    }
+    } else {}
   }
 

[Survived] BlockStatement
src/client/st/ST.ts:214:26
     }
   }
 
-  public destroy(): void {
-    this._messageBus.publish(
-      {
-        type: MessageBus.EVENTS_PUBLIC.DESTROY
-      },
-      true
-    );
-
-    this._destroy$.next();
-    this._destroy$.complete();
-    this._communicator.close();
-  }
+  public destroy(): void {}
 
   public init(config: IConfig): void {

[Survived] BlockStatement
src/client/st/ST.ts:227:38
     this._communicator.close();
   }
 
-  public init(config: IConfig): void {
-    this._framesHub.reset();
-    this._storage.init();
-    this._config = this._configService.setup(config);
-    StCodec.updateJWTValue(config.jwt);
-    this.initCallbacks(config);
-    this.Storage();
-    this._translation = new Translator(this._storage.getItem(ST.LOCALE_STORAGE));
-    this._googleAnalytics.init();
-    this.CommonFrames();
-    this._commonFrames.init();
-    this.displayLiveStatus(Boolean(this._config.livestatus));
-    this.watchForFrameUnload();
-    this.initControlFrameModal();
-  }
+  public init(config: IConfig): void {}
 
   public getBrowserInfo(): IBrowserInfo {

[Survived] BlockStatement
src/client/st/ST.ts:243:41
     this.initControlFrameModal();
   }
 
-  public getBrowserInfo(): IBrowserInfo {
-    return this._browserDetector.getBrowserInfo();
-  }
+  public getBrowserInfo(): IBrowserInfo {}
 
   private CardFrames(): void {

[Survived] BlockStatement
src/client/st/ST.ts:247:30
     return this._browserDetector.getBrowserInfo();
   }
 
-  private CardFrames(): void {
-    this._cardFrames = new CardFrames(
-      this._config.jwt,
-      this._config.origin,
-      this._config.componentIds,
-      this._config.styles,
-      this._config.components.paymentTypes,
-      this._config.components.defaultPaymentType,
-      this._config.animatedCard,
-      this._config.buttonId,
-      this._config.fieldsToSubmit,
-      this._config.formId,
-      this._configProvider,
-      this._iframeFactory,
-      this._frameService,
-      this._messageBus
-    );
-  }
+  private CardFrames(): void {}
 
   private CommonFrames(): void {

[Survived] BlockStatement
src/client/st/ST.ts:266:32
     );
   }
 
-  private CommonFrames(): void {
-    this._commonFrames = new CommonFrames(
-      this._config.jwt,
-      this._config.origin,
-      this._config.componentIds,
-      this._config.styles,
-      this._config.submitOnSuccess,
-      this._config.submitOnError,
-      this._config.submitOnCancel,
-      this._config.submitFields,
-      this._config.datacenterurl,
-      this._config.animatedCard,
-      this._config.components.requestTypes,
-      this._config.formId,
-      this._iframeFactory,
-      this._frameService
-    );
-  }
+  private CommonFrames(): void {}
 
   private Environment(): { applepay: any; visa: any } {

[Survived] BlockStatement
src/client/st/ST.ts:285:55
     );
   }
 
-  private Environment(): { applepay: any; visa: any } {
-    return {
-      applepay: environment.testEnvironment ? ApplePayMock : ApplePay,
-      visa: environment.testEnvironment ? VisaCheckoutMock : VisaCheckout
-    };
-  }
+  private Environment(): { applepay: any; visa: any } {}
 
   private Storage(): void {

[Survived] BlockStatement
src/client/st/ST.ts:292:27
     };
   }
 
-  private Storage(): void {
-    this._storage.setItem(ST.MERCHANT_TRANSLATIONS_STORAGE, JSON.stringify(this._config.translations));
-    this._storage.setItem(ST.LOCALE_STORAGE, JwtDecode<IStJwtObj>(this._config.jwt).payload.locale);
-  }
+  private Storage(): void {}
 
   private displayLiveStatus(liveStatus: boolean): void {

[Survived] BlockStatement
src/client/st/ST.ts:297:56
     this._storage.setItem(ST.LOCALE_STORAGE, JwtDecode<IStJwtObj>(this._config.jwt).payload.locale);
   }
 
-  private displayLiveStatus(liveStatus: boolean): void {
-    if (!liveStatus) {
-      /* tslint:disable:no-console */
-      console.log(
-        '%cThe %csecure%c//%ctrading %cLibrary is currently working in test mode. Please check your configuration.',
-        'margin: 100px 0; font-size: 2em; color: #e71b5a',
-        'font-size: 2em; font-weight: bold',
-        'font-size: 2em; font-weight: 1000; color: #e71b5a',
-        'font-size: 2em; font-weight: bold',
-        'font-size: 2em; font-weight: regular; color: #e71b5a'
-      );
-    }
-  }
+  private displayLiveStatus(liveStatus: boolean): void {}
 
   private watchForFrameUnload(): void {

[Survived] BlockStatement
src/client/st/ST.ts:298:22
   }
 
   private displayLiveStatus(liveStatus: boolean): void {
-    if (!liveStatus) {
-      /* tslint:disable:no-console */
-      console.log(
-        '%cThe %csecure%c//%ctrading %cLibrary is currently working in test mode. Please check your configuration.',
-        'margin: 100px 0; font-size: 2em; color: #e71b5a',
-        'font-size: 2em; font-weight: bold',
-        'font-size: 2em; font-weight: 1000; color: #e71b5a',
-        'font-size: 2em; font-weight: bold',
-        'font-size: 2em; font-weight: regular; color: #e71b5a'
-      );
-    }
+    if (!liveStatus) {}
   }
 

[Survived] ConditionalExpression
src/client/st/ST.ts:298:9
   }
 
   private displayLiveStatus(liveStatus: boolean): void {
-    if (!liveStatus) {
+    if (true) {
       /* tslint:disable:no-console */
       console.log(

[Survived] BlockStatement
src/client/st/ST.ts:311:39
     }
   }
 
-  private watchForFrameUnload(): void {
-    const controlFrameStatus = [false, false];
-
-    const observer = new MutationObserver(() => {
-      const controlFrame = document.getElementById(CONTROL_FRAME_IFRAME);
-
-      controlFrameStatus.push(Boolean(controlFrame));
-      controlFrameStatus.shift();
-
-      const [previousStatus, currentStatus] = controlFrameStatus;
-
-      if (previousStatus && !currentStatus) {
-        this.destroy();
-        observer.disconnect();
-      }
-    });
-
-    observer.observe(document, {
-      subtree: true,
-      childList: true
-    });
-  }
+  private watchForFrameUnload(): void {}
 
   private initCallbacks(config: IConfig): void {

[Survived] BooleanLiteral
src/client/st/ST.ts:312:40
   }
 
   private watchForFrameUnload(): void {
-    const controlFrameStatus = [false, false];
+    const controlFrameStatus = [false, true];
 
     const observer = new MutationObserver(() => {

[Survived] BooleanLiteral
src/client/st/ST.ts:312:33
   }
 
   private watchForFrameUnload(): void {
-    const controlFrameStatus = [false, false];
+    const controlFrameStatus = [true, false];
 
     const observer = new MutationObserver(() => {

[Survived] BlockStatement
src/client/st/ST.ts:314:49
   private watchForFrameUnload(): void {
     const controlFrameStatus = [false, false];
 
-    const observer = new MutationObserver(() => {
-      const controlFrame = document.getElementById(CONTROL_FRAME_IFRAME);
-
-      controlFrameStatus.push(Boolean(controlFrame));
-      controlFrameStatus.shift();
-
-      const [previousStatus, currentStatus] = controlFrameStatus;
-
-      if (previousStatus && !currentStatus) {
-        this.destroy();
-        observer.disconnect();
-      }
-    });
+    const observer = new MutationObserver(() => {});
 
     observer.observe(document, {

[Survived] BooleanLiteral
src/client/st/ST.ts:322:29
 
       const [previousStatus, currentStatus] = controlFrameStatus;
 
-      if (previousStatus && !currentStatus) {
+      if (previousStatus && currentStatus) {
         this.destroy();
         observer.disconnect();

[Survived] BlockStatement
src/client/st/ST.ts:322:45
 
       const [previousStatus, currentStatus] = controlFrameStatus;
 
-      if (previousStatus && !currentStatus) {
-        this.destroy();
-        observer.disconnect();
-      }
+      if (previousStatus && !currentStatus) {}
     });
 

[Survived] BooleanLiteral
src/client/st/ST.ts:329:16
     });
 
     observer.observe(document, {
-      subtree: true,
+      subtree: false,
       childList: true
     });

[Survived] BooleanLiteral
src/client/st/ST.ts:330:18
 
     observer.observe(document, {
       subtree: true,
-      childList: true
+      childList: false
     });
   }

[Survived] BlockStatement
src/client/st/ST.ts:334:48
     });
   }
 
-  private initCallbacks(config: IConfig): void {
-    if (config.submitCallback) {
-      this.submitCallback = config.submitCallback;
-    }
-
-    if (config.successCallback) {
-      this.successCallback = config.successCallback;
-    }
-
-    if (config.errorCallback) {
-      this.errorCallback = config.errorCallback;
-    }
-
-    if (config.cancelCallback) {
-      this.cancelCallback = config.cancelCallback;
-    }
-  }
+  private initCallbacks(config: IConfig): void {}
 
   private initControlFrameModal(): void {

[Survived] ConditionalExpression
src/client/st/ST.ts:335:9
   }
 
   private initCallbacks(config: IConfig): void {
-    if (config.submitCallback) {
+    if (true) {
       this.submitCallback = config.submitCallback;
     }

[Survived] ConditionalExpression
src/client/st/ST.ts:335:9
   }
 
   private initCallbacks(config: IConfig): void {
-    if (config.submitCallback) {
+    if (false) {
       this.submitCallback = config.submitCallback;
     }

[Survived] ConditionalExpression
src/client/st/ST.ts:339:9
       this.submitCallback = config.submitCallback;
     }
 
-    if (config.successCallback) {
+    if (true) {
       this.successCallback = config.successCallback;
     }

[Survived] ConditionalExpression
src/client/st/ST.ts:339:9
       this.submitCallback = config.submitCallback;
     }
 
-    if (config.successCallback) {
+    if (false) {
       this.successCallback = config.successCallback;
     }

[Survived] ConditionalExpression
src/client/st/ST.ts:343:9
       this.successCallback = config.successCallback;
     }
 
-    if (config.errorCallback) {
+    if (true) {
       this.errorCallback = config.errorCallback;
     }

[Survived] ConditionalExpression
src/client/st/ST.ts:343:9
       this.successCallback = config.successCallback;
     }
 
-    if (config.errorCallback) {
+    if (false) {
       this.errorCallback = config.errorCallback;
     }

[Survived] ConditionalExpression
src/client/st/ST.ts:347:9
       this.errorCallback = config.errorCallback;
     }
 
-    if (config.cancelCallback) {
+    if (false) {
       this.cancelCallback = config.cancelCallback;
     }

[Survived] BlockStatement
src/client/st/ST.ts:347:32
       this.errorCallback = config.errorCallback;
     }
 
-    if (config.cancelCallback) {
-      this.cancelCallback = config.cancelCallback;
-    }
+    if (config.cancelCallback) {}
   }
 

[Survived] BlockStatement
src/client/st/ST.ts:352:41
     }
   }
 
-  private initControlFrameModal(): void {
-    const className = ST.MODAL_CONTROL_FRAME_CLASS;
-
-    this._messageBus
-      .pipe(ofType(MessageBus.EVENTS_PUBLIC.CONTROL_FRAME_SHOW), takeUntil(this._destroy$))
-      .subscribe(() => document.getElementById(CONTROL_FRAME_IFRAME).classList.add(className));
-
-    this._messageBus
-      .pipe(ofType(MessageBus.EVENTS_PUBLIC.CONTROL_FRAME_HIDE), takeUntil(this._destroy$))
-      .subscribe(() => document.getElementById(CONTROL_FRAME_IFRAME).classList.remove(className));
-  }
+  private initControlFrameModal(): void {}
 
   private blockSubmitButton(): void {
