[Survived] ArrowFunction
src/client/st/ST.ts:357:18
 
     this._messageBus
       .pipe(ofType(MessageBus.EVENTS_PUBLIC.CONTROL_FRAME_SHOW), takeUntil(this._destroy$))
-      .subscribe(() => document.getElementById(CONTROL_FRAME_IFRAME).classList.add(className));
+      .subscribe(() => undefined);
 
     this._messageBus

[Survived] ArrowFunction
src/client/st/ST.ts:361:18
 
     this._messageBus
       .pipe(ofType(MessageBus.EVENTS_PUBLIC.CONTROL_FRAME_HIDE), takeUntil(this._destroy$))
-      .subscribe(() => document.getElementById(CONTROL_FRAME_IFRAME).classList.remove(className));
+      .subscribe(() => undefined);
   }
 

[Survived] BlockStatement
src/client/st/ST.ts:364:37
       .subscribe(() => document.getElementById(CONTROL_FRAME_IFRAME).classList.remove(className));
   }
 
-  private blockSubmitButton(): void {
-    const form: HTMLFormElement = document.getElementById(this._config.formId) as HTMLFormElement;
-
-    if (!form) {
-      return;
-    }
-
-    const submitButton: HTMLInputElement | HTMLButtonElement =
-      (document.getElementById(this._config.buttonId) as HTMLInputElement | HTMLButtonElement) ||
-      form.querySelector(ST.BUTTON_SUBMIT_SELECTOR) ||
-      form.querySelector(ST.INPUT_SUBMIT_SELECTOR);
-
-    if (submitButton) {
-      submitButton.classList.add(ST.BUTTON_DISABLED_CLASS);
-      submitButton.disabled = true;
-    }
-  }
+  private blockSubmitButton(): void {}
 }
 

[Survived] BlockStatement
src/client/st/ST.ts:367:16
   private blockSubmitButton(): void {
     const form: HTMLFormElement = document.getElementById(this._config.formId) as HTMLFormElement;
 
-    if (!form) {
-      return;
-    }
+    if (!form) {}
 
     const submitButton: HTMLInputElement | HTMLButtonElement =

[Survived] ConditionalExpression
src/client/st/ST.ts:367:9
   private blockSubmitButton(): void {
     const form: HTMLFormElement = document.getElementById(this._config.formId) as HTMLFormElement;
 
-    if (!form) {
+    if (false) {
       return;
     }

[Survived] ConditionalExpression
src/client/st/ST.ts:372:7
     }
 
     const submitButton: HTMLInputElement | HTMLButtonElement =
-      (document.getElementById(this._config.buttonId) as HTMLInputElement | HTMLButtonElement) ||
-      form.querySelector(ST.BUTTON_SUBMIT_SELECTOR) ||
-      form.querySelector(ST.INPUT_SUBMIT_SELECTOR);
+      true;
 
     if (submitButton) {

[Survived] ConditionalExpression
src/client/st/ST.ts:372:7
     }
 
     const submitButton: HTMLInputElement | HTMLButtonElement =
-      (document.getElementById(this._config.buttonId) as HTMLInputElement | HTMLButtonElement) ||
-      form.querySelector(ST.BUTTON_SUBMIT_SELECTOR) ||
+      true ||
       form.querySelector(ST.INPUT_SUBMIT_SELECTOR);
 

[Survived] BlockStatement
src/client/st/ST.ts:376:23
       form.querySelector(ST.BUTTON_SUBMIT_SELECTOR) ||
       form.querySelector(ST.INPUT_SUBMIT_SELECTOR);
 
-    if (submitButton) {
-      submitButton.classList.add(ST.BUTTON_DISABLED_CLASS);
-      submitButton.disabled = true;
-    }
+    if (submitButton) {}
   }
 }

[Survived] ConditionalExpression
src/client/st/ST.ts:376:9
       form.querySelector(ST.BUTTON_SUBMIT_SELECTOR) ||
       form.querySelector(ST.INPUT_SUBMIT_SELECTOR);
 
-    if (submitButton) {
+    if (true) {
       submitButton.classList.add(ST.BUTTON_DISABLED_CLASS);
       submitButton.disabled = true;

[Survived] BooleanLiteral
src/client/st/ST.ts:378:31
 
     if (submitButton) {
       submitButton.classList.add(ST.BUTTON_DISABLED_CLASS);
-      submitButton.disabled = true;
+      submitButton.disabled = false;
     }
   }

[Survived] BlockStatement
src/client/st/ST.ts:383:37
   }
 }
 
-export default (config: IConfig) => {
-  return Container.get(ClientBootstrap).run(config);
-};
+export default (config: IConfig) => {};
 
