[Survived] ObjectLiteral
js-payments/src/environments/environment.prod.ts:5:22
 const MOCK_GATEWAY_URL: string = 'https://merchant.example.com:8443';
 
 export const environment = {
-  CARDINAL_COMMERCE: {
-    CONFIG: {
-      logging: { level: 'off' }
-    },
-    MOCK: {
-      AUTHENTICATE_CARD_URL: `${MOCK_GATEWAY_URL}/cardinalAuthenticateCard`
-    },
-    SONGBIRD_LIVE_URL: 'https://songbird.cardinalcommerce.com/edge/v1/songbird.js',
-    SONGBIRD_TEST_URL: 'https://songbirdstag.cardinalcommerce.com/edge/v1/songbird.js'
-  },
+  CARDINAL_COMMERCE: {},
   FRAME_URL: 'https://webservices.securetrading.net/js/v2',
   GATEWAY_URL,

[Survived] ObjectLiteral
js-payments/src/environments/environment.prod.ts:6:13
 
 export const environment = {
   CARDINAL_COMMERCE: {
-    CONFIG: {
-      logging: { level: 'off' }
-    },
+    CONFIG: {},
     MOCK: {
       AUTHENTICATE_CARD_URL: `${MOCK_GATEWAY_URL}/cardinalAuthenticateCard`

[Survived] ObjectLiteral
js-payments/src/environments/environment.prod.ts:9:11
     CONFIG: {
       logging: { level: 'off' }
     },
-    MOCK: {
-      AUTHENTICATE_CARD_URL: `${MOCK_GATEWAY_URL}/cardinalAuthenticateCard`
-    },
+    MOCK: {},
     SONGBIRD_LIVE_URL: 'https://songbird.cardinalcommerce.com/edge/v1/songbird.js',
     SONGBIRD_TEST_URL: 'https://songbirdstag.cardinalcommerce.com/edge/v1/songbird.js'

[Survived] StringLiteral
js-payments/src/environments/environment.prod.ts:12:24
     MOCK: {
       AUTHENTICATE_CARD_URL: `${MOCK_GATEWAY_URL}/cardinalAuthenticateCard`
     },
-    SONGBIRD_LIVE_URL: 'https://songbird.cardinalcommerce.com/edge/v1/songbird.js',
+    SONGBIRD_LIVE_URL: "",
     SONGBIRD_TEST_URL: 'https://songbirdstag.cardinalcommerce.com/edge/v1/songbird.js'
   },

[Survived] StringLiteral
js-payments/src/environments/environment.prod.ts:17:22
   },
   FRAME_URL: 'https://webservices.securetrading.net/js/v2',
   GATEWAY_URL,
-  GA_MEASUREMENT_ID: '42057093-6',
+  GA_MEASUREMENT_ID: "",
   GA_SCRIPT_SRC: 'https://www.google-analytics.com/analytics.js',
   NOTIFICATION_TTL: 7000,

[Survived] StringLiteral
js-payments/src/environments/environment.prod.ts:23:22
   VISA_CHECKOUT_URLS: {
     LIVE_BUTTON_URL: 'https://secure.checkout.visa.com/wallet-services-web/xo/button.png',
     LIVE_SDK: 'https://secure.checkout.visa.com/checkout-widget/resources/js/integration/v1/sdk.js',
-    TEST_BUTTON_URL: 'https://sandbox.secure.checkout.visa.com/wallet-services-web/xo/button.png',
+    TEST_BUTTON_URL: "",
     TEST_SDK: 'https://sandbox-assets.secure.checkout.visa.com/checkout-widget/resources/js/integration/v1/sdk.js'
   },

[Survived] StringLiteral
js-payments/src/environments/environment.prod.ts:27:27
     TEST_SDK: 'https://sandbox-assets.secure.checkout.visa.com/checkout-widget/resources/js/integration/v1/sdk.js'
   },
   CYBERTONICA: {
-    CYBERTONICA_LIVE_URL: 'https://cyber.securetrading.net/js/v2/afeasdwqwdasd.js'
+    CYBERTONICA_LIVE_URL: ""
   },
   production: true,

[Survived] BooleanLiteral
js-payments/src/environments/environment.prod.ts:29:15
   CYBERTONICA: {
     CYBERTONICA_LIVE_URL: 'https://cyber.securetrading.net/js/v2/afeasdwqwdasd.js'
   },
-  production: true,
+  production: false,
   testEnvironment: false,
   overrideDomain: '',

[Survived] BooleanLiteral
js-payments/src/environments/environment.prod.ts:30:20
     CYBERTONICA_LIVE_URL: 'https://cyber.securetrading.net/js/v2/afeasdwqwdasd.js'
   },
   production: true,
-  testEnvironment: false,
+  testEnvironment: true,
   overrideDomain: '',
   SENTRY_DSN: 'https://6319b9ff1fb14ba48cd2c9025d67bd2d@o402164.ingest.sentry.io/5262818',

[Survived] StringLiteral
js-payments/src/environments/environment.prod.ts:31:19
   },
   production: true,
   testEnvironment: false,
-  overrideDomain: '',
+  overrideDomain: "Stryker was here!",
   SENTRY_DSN: 'https://6319b9ff1fb14ba48cd2c9025d67bd2d@o402164.ingest.sentry.io/5262818',
   SENTRY_WHITELIST_URLS: ['https://webservices.securetrading.net']

[Survived] StringLiteral
js-payments/src/environments/environment.prod.ts:32:15
   production: true,
   testEnvironment: false,
   overrideDomain: '',
-  SENTRY_DSN: 'https://6319b9ff1fb14ba48cd2c9025d67bd2d@o402164.ingest.sentry.io/5262818',
+  SENTRY_DSN: "",
   SENTRY_WHITELIST_URLS: ['https://webservices.securetrading.net']
 };

[Survived] StringLiteral
js-payments/src/environments/environment.prod.ts:33:27
   testEnvironment: false,
   overrideDomain: '',
   SENTRY_DSN: 'https://6319b9ff1fb14ba48cd2c9025d67bd2d@o402164.ingest.sentry.io/5262818',
-  SENTRY_WHITELIST_URLS: ['https://webservices.securetrading.net']
+  SENTRY_WHITELIST_URLS: [""]
 };
 
