[Survived] StringLiteral
js-payments/src/environments/environment.rc.ts:2:29
 declare const WEBSERVICES_URL: string;
-const GATEWAY_URL: string = 'https://webservices.securetrading.net/jwt/';
+const GATEWAY_URL: string = "";
 const MOCK_GATEWAY_URL: string = 'https://merchant.example.com:8443';
 

[Survived] StringLiteral
js-payments/src/environments/environment.rc.ts:14:24
       AUTHENTICATE_CARD_URL: `${MOCK_GATEWAY_URL}/cardinalAuthenticateCard`
     },
     SONGBIRD_LIVE_URL: 'https://songbird.cardinalcommerce.com/edge/v1/songbird.js',
-    SONGBIRD_TEST_URL: 'https://songbirdstag.cardinalcommerce.com/edge/v1/songbird.js'
+    SONGBIRD_TEST_URL: ""
   },
   FRAME_URL: WEBSERVICES_URL,

[Survived] StringLiteral
js-payments/src/environments/environment.rc.ts:22:22
   GA_SCRIPT_SRC: 'https://www.google-analytics.com/analytics.js',
   NOTIFICATION_TTL: 7000,
   VISA_CHECKOUT_URLS: {
-    LIVE_BUTTON_URL: 'https://secure.checkout.visa.com/wallet-services-web/xo/button.png',
+    LIVE_BUTTON_URL: "",
     LIVE_SDK: 'https://secure.checkout.visa.com/checkout-widget/resources/js/integration/v1/sdk.js',
     TEST_BUTTON_URL: 'https://sandbox.secure.checkout.visa.com/wallet-services-web/xo/button.png',
