[Survived] StringLiteral
js-payments/src/environments/environment.ts:3:29
 declare const WEBSERVICES_URL: string;
 
-const GATEWAY_URL: string = 'https://webservices.securetrading.net/jwt/';
+const GATEWAY_URL: string = "";
 const MOCK_GATEWAY_URL: string = 'https://merchant.example.com:8443';
 

[Survived] StringLiteral
js-payments/src/environments/environment.ts:8:16
 
 export const environment = {
   APM_NAMES: {
-    APPLE_PAY: 'APPLEPAY',
+    APPLE_PAY: "",
     VISA_CHECKOUT: 'VISACHECKOUT'
   },

[Survived] StringLiteral
js-payments/src/environments/environment.ts:9:20
 export const environment = {
   APM_NAMES: {
     APPLE_PAY: 'APPLEPAY',
-    VISA_CHECKOUT: 'VISACHECKOUT'
+    VISA_CHECKOUT: ""
   },
   APPLE_PAY_URLS: {

[Survived] ObjectLiteral
js-payments/src/environments/environment.ts:11:19
     APPLE_PAY: 'APPLEPAY',
     VISA_CHECKOUT: 'VISACHECKOUT'
   },
-  APPLE_PAY_URLS: {
-    MOCK_DATA_URL: 'https://merchant.example.com:8443/applePaymentStatus'
-  },
+  APPLE_PAY_URLS: {},
   CARDINAL_COMMERCE: {
     CONFIG: {

[Survived] ObjectLiteral
js-payments/src/environments/environment.ts:15:13
     MOCK_DATA_URL: 'https://merchant.example.com:8443/applePaymentStatus'
   },
   CARDINAL_COMMERCE: {
-    CONFIG: {
-      logging: { level: 'on' }
-    },
+    CONFIG: {},
     MOCK: {
       AUTHENTICATE_CARD_URL: `${MOCK_GATEWAY_URL}/cardinalAuthenticateCard`

[Survived] StringLiteral
js-payments/src/environments/environment.ts:19:30
       logging: { level: 'on' }
     },
     MOCK: {
-      AUTHENTICATE_CARD_URL: `${MOCK_GATEWAY_URL}/cardinalAuthenticateCard`
+      AUTHENTICATE_CARD_URL: ``
     },
     SONGBIRD_LIVE_URL: 'https://songbird.cardinalcommerce.com/edge/v1/songbird.js',

[Survived] ObjectLiteral
js-payments/src/environments/environment.ts:24:29
     SONGBIRD_LIVE_URL: 'https://songbird.cardinalcommerce.com/edge/v1/songbird.js',
     SONGBIRD_TEST_URL: 'https://songbirdstag.cardinalcommerce.com/edge/v1/songbird.js'
   },
-  CARDINAL_COMMERCE_CONFIG: {
-    logging: { level: 'on' }
-  },
+  CARDINAL_COMMERCE_CONFIG: {},
   // @ts-ignore
   FRAME_URL: WEBSERVICES_URL,

[Survived] StringLiteral
js-payments/src/environments/environment.ts:30:22
   // @ts-ignore
   FRAME_URL: WEBSERVICES_URL,
   GATEWAY_URL,
-  GA_MEASUREMENT_ID: '42057093-5',
+  GA_MEASUREMENT_ID: "",
   GA_SCRIPT_SRC: 'https://www.google-analytics.com/analytics_debug.js',
   NOTIFICATION_TTL: 7000,

[Survived] StringLiteral
js-payments/src/environments/environment.ts:36:20
   VISA_CHECKOUT_URLS: {
     LIVE_BUTTON_URL: 'https://secure.checkout.visa.com/wallet-services-web/xo/button.png',
     LIVE_SDK: 'https://secure.checkout.visa.com/checkout-widget/resources/js/integration/v1/sdk.js',
-    MOCK_DATA_URL: `${MOCK_GATEWAY_URL}/visaPaymentStatus`,
+    MOCK_DATA_URL: ``,
     TEST_BUTTON_URL: 'https://sandbox.secure.checkout.visa.com/wallet-services-web/xo/button.png',
     TEST_SDK: 'https://sandbox-assets.secure.checkout.visa.com/checkout-widget/resources/js/integration/v1/sdk.js'

[Survived] StringLiteral
js-payments/src/environments/environment.ts:38:15
     LIVE_SDK: 'https://secure.checkout.visa.com/checkout-widget/resources/js/integration/v1/sdk.js',
     MOCK_DATA_URL: `${MOCK_GATEWAY_URL}/visaPaymentStatus`,
     TEST_BUTTON_URL: 'https://sandbox.secure.checkout.visa.com/wallet-services-web/xo/button.png',
-    TEST_SDK: 'https://sandbox-assets.secure.checkout.visa.com/checkout-widget/resources/js/integration/v1/sdk.js'
+    TEST_SDK: ""
   },
   CYBERTONICA: {

[Survived] BooleanLiteral
js-payments/src/environments/environment.ts:43:15
   CYBERTONICA: {
     CYBERTONICA_LIVE_URL: 'https://cyber.securetrading.net/js/v2/afeasdwqwdasd.js'
   },
-  production: false,
+  production: true,
   testEnvironment: false,
   overrideDomain: '',

[Survived] BooleanLiteral
js-payments/src/environments/environment.ts:44:20
     CYBERTONICA_LIVE_URL: 'https://cyber.securetrading.net/js/v2/afeasdwqwdasd.js'
   },
   production: false,
-  testEnvironment: false,
+  testEnvironment: true,
   overrideDomain: '',
   SENTRY_DSN: null as string,
