[Survived] BlockStatement
js-payments/src/shared/Debug.ts:4:40
 import { environment } from '../environments/environment';
 
 export class Debug {
-  public static error(data: any): void {
-    if (!environment.production) {
-      console.error(data);
-    }
-  }
+  public static error(data: any): void {}
 
   public static warn(data: any): void {

[Survived] ConditionalExpression
js-payments/src/shared/Debug.ts:5:9
 
 export class Debug {
   public static error(data: any): void {
-    if (!environment.production) {
+    if (true) {
       console.error(data);
     }

[Survived] BlockStatement
js-payments/src/shared/Debug.ts:5:34
 
 export class Debug {
   public static error(data: any): void {
-    if (!environment.production) {
-      console.error(data);
-    }
+    if (!environment.production) {}
   }
 

[Survived] BlockStatement
js-payments/src/shared/Debug.ts:10:39
     }
   }
 
-  public static warn(data: any): void {
-    if (!environment.production) {
-      console.warn(data);
-    }
-  }
+  public static warn(data: any): void {}
 
   public static log(data: any): void {

[Survived] ConditionalExpression
js-payments/src/shared/Debug.ts:11:9
   }
 
   public static warn(data: any): void {
-    if (!environment.production) {
+    if (true) {
       console.warn(data);
     }

[Survived] BooleanLiteral
js-payments/src/shared/Debug.ts:11:9
   }
 
   public static warn(data: any): void {
-    if (!environment.production) {
+    if (environment.production) {
       console.warn(data);
     }

[Survived] BlockStatement
js-payments/src/shared/Debug.ts:16:38
     }
   }
 
-  public static log(data: any): void {
-    if (!environment.production) {
-      console.log(data);
-    }
-  }
+  public static log(data: any): void {}
 }
 

[Survived] BlockStatement
js-payments/src/shared/Debug.ts:17:34
   }
 
   public static log(data: any): void {
-    if (!environment.production) {
-      console.log(data);
-    }
+    if (!environment.production) {}
   }
 }

[Survived] ConditionalExpression
js-payments/src/shared/Debug.ts:17:9
   }
 
   public static log(data: any): void {
-    if (!environment.production) {
+    if (true) {
       console.log(data);
     }
