[Survived] BlockStatement
shared/services/browser-detector/BrowserDetector.ts:16:34
     private deviceSupport: DeviceSupport
   ) {}
 
-  getBrowserInfo(): IBrowserInfo {
-    const browserDetails = Bowser.parse(this.window.navigator.userAgent);
-    const isBrowserSupported = this.browserSupport.isBrowserSupported(
-      browserDetails.browser.version,
-      browserDetails.browser.name
-    );
-    const isDeviceSupported = this.deviceSupport.isDeviceSupported(browserDetails.os.version, browserDetails.os.name);
-
-    return {
-      browser: {
-        ...browserDetails.browser,
-        isSupported: isBrowserSupported
-      },
-      engine: browserDetails.engine,
-      os: {
-        ...browserDetails.os,
-        isSupported: isDeviceSupported
-      },
-      platform: browserDetails.platform,
-      isSupported: isBrowserSupported && isDeviceSupported
-    };
-  }
+  getBrowserInfo(): IBrowserInfo {}
 }
 

[Survived] ObjectLiteral
shared/services/browser-detector/BrowserDetector.ts:24:12
     );
     const isDeviceSupported = this.deviceSupport.isDeviceSupported(browserDetails.os.version, browserDetails.os.name);
 
-    return {
-      browser: {
-        ...browserDetails.browser,
-        isSupported: isBrowserSupported
-      },
-      engine: browserDetails.engine,
-      os: {
-        ...browserDetails.os,
-        isSupported: isDeviceSupported
-      },
-      platform: browserDetails.platform,
-      isSupported: isBrowserSupported && isDeviceSupported
-    };
+    return {};
   }
 }

[Survived] LogicalOperator
shared/services/browser-detector/BrowserDetector.ts:35:20
         isSupported: isDeviceSupported
       },
       platform: browserDetails.platform,
-      isSupported: isBrowserSupported && isDeviceSupported
+      isSupported: isBrowserSupported || isDeviceSupported
     };
   }

[Survived] ConditionalExpression
shared/services/browser-detector/BrowserDetector.ts:35:20
         isSupported: isDeviceSupported
       },
       platform: browserDetails.platform,
-      isSupported: isBrowserSupported && isDeviceSupported
+      isSupported: true
     };
   }
