[Survived] BlockStatement
shared/services/browser-detector/BrowsersList.ts:6:41
 
 @Service()
 export class BrowsersList {
-  getBrowsers(list: string[]): string[] {
-    return browserslist(list);
-  }
+  getBrowsers(list: string[]): string[] {}
 
   getSupportedBrowsers() {

[Survived] BlockStatement
shared/services/browser-detector/BrowsersList.ts:10:26
     return browserslist(list);
   }
 
-  getSupportedBrowsers() {
-    // @ts-ignore
-    return Object.keys(browserslist.versionAliases).reduce((a, b) => ((a[b] = []), a), {});
-  }
+  getSupportedBrowsers() {}
 }
 

[Survived] ArrowFunction
shared/services/browser-detector/BrowsersList.ts:12:60
 
   getSupportedBrowsers() {
     // @ts-ignore
-    return Object.keys(browserslist.versionAliases).reduce((a, b) => ((a[b] = []), a), {});
+    return Object.keys(browserslist.versionAliases).reduce(() => undefined, {});
   }
 }
