[Survived] ArrayDeclaration
shared/services/browser-detector/SupportedOSs.ts:2:37
 export const SupportedAndroidVersions = [7, 8, 9, 10];
-export const SupportedIOSVersions = [10, 11, 12, 13, 14];
+export const SupportedIOSVersions = [];
 
