[Survived] BlockStatement
services/browser-detector/browser-support/BrowserSupport.ts:9:62
 export class BrowserSupport {
   constructor(private _browserList: BrowsersList) {}
 
-  isBrowserSupported(version: string, name: string): boolean {
-    const supportedVersions: string[] = this.getSupportedBrowserVersions(this.mapBrowserName(name));
-    const currentVersion = Number(version.substring(0, 2));
-
-    if (!supportedVersions) {
-      return false;
-    }
-
-    if (Array.isArray(supportedVersions)) {
-      return supportedVersions.some(v => Number(v) <= currentVersion);
-    }
-
-    return Number(supportedVersions) <= currentVersion;
-  }
+  isBrowserSupported(version: string, name: string): boolean {}
 
   private mapBrowserName(name: string): string {

[Survived] ConditionalExpression
services/browser-detector/browser-support/BrowserSupport.ts:13:9
     const supportedVersions: string[] = this.getSupportedBrowserVersions(this.mapBrowserName(name));
     const currentVersion = Number(version.substring(0, 2));
 
-    if (!supportedVersions) {
+    if (false) {
       return false;
     }

[Survived] BooleanLiteral
services/browser-detector/browser-support/BrowserSupport.ts:13:9
     const supportedVersions: string[] = this.getSupportedBrowserVersions(this.mapBrowserName(name));
     const currentVersion = Number(version.substring(0, 2));
 
-    if (!supportedVersions) {
+    if (supportedVersions) {
       return false;
     }

[Survived] BooleanLiteral
services/browser-detector/browser-support/BrowserSupport.ts:14:14
     const currentVersion = Number(version.substring(0, 2));
 
     if (!supportedVersions) {
-      return false;
+      return true;
     }
 

[Survived] ConditionalExpression
services/browser-detector/browser-support/BrowserSupport.ts:17:9
       return false;
     }
 
-    if (Array.isArray(supportedVersions)) {
+    if (true) {
       return supportedVersions.some(v => Number(v) <= currentVersion);
     }

[Survived] BlockStatement
services/browser-detector/browser-support/BrowserSupport.ts:17:43
       return false;
     }
 
-    if (Array.isArray(supportedVersions)) {
-      return supportedVersions.some(v => Number(v) <= currentVersion);
-    }
+    if (Array.isArray(supportedVersions)) {}
 
     return Number(supportedVersions) <= currentVersion;

[Survived] EqualityOperator
services/browser-detector/browser-support/BrowserSupport.ts:18:42
     }
 
     if (Array.isArray(supportedVersions)) {
-      return supportedVersions.some(v => Number(v) <= currentVersion);
+      return supportedVersions.some(v => Number(v) < currentVersion);
     }
 

[Survived] ConditionalExpression
services/browser-detector/browser-support/BrowserSupport.ts:18:42
     }
 
     if (Array.isArray(supportedVersions)) {
-      return supportedVersions.some(v => Number(v) <= currentVersion);
+      return supportedVersions.some(v => false);
     }
 

[Survived] EqualityOperator
services/browser-detector/browser-support/BrowserSupport.ts:21:12
       return supportedVersions.some(v => Number(v) <= currentVersion);
     }
 
-    return Number(supportedVersions) <= currentVersion;
+    return Number(supportedVersions) > currentVersion;
   }
 

[Survived] ConditionalExpression
services/browser-detector/browser-support/BrowserSupport.ts:21:12
       return supportedVersions.some(v => Number(v) <= currentVersion);
     }
 
-    return Number(supportedVersions) <= currentVersion;
+    return false;
   }
 

[Survived] BlockStatement
services/browser-detector/browser-support/BrowserSupport.ts:24:48
     return Number(supportedVersions) <= currentVersion;
   }
 
-  private mapBrowserName(name: string): string {
-    return Object.keys(BrowserMap).find(key => BrowserMap[key] === name);
-  }
+  private mapBrowserName(name: string): string {}
 
   private getSupportedBrowserVersions(name: string): string[] {

[Survived] EqualityOperator
services/browser-detector/browser-support/BrowserSupport.ts:25:48
   }
 
   private mapBrowserName(name: string): string {
-    return Object.keys(BrowserMap).find(key => BrowserMap[key] === name);
+    return Object.keys(BrowserMap).find(key => BrowserMap[key] !== name);
   }
 

[Survived] ConditionalExpression
services/browser-detector/browser-support/BrowserSupport.ts:25:48
   }
 
   private mapBrowserName(name: string): string {
-    return Object.keys(BrowserMap).find(key => BrowserMap[key] === name);
+    return Object.keys(BrowserMap).find(key => true);
   }
 

[Survived] BlockStatement
services/browser-detector/browser-support/BrowserSupport.ts:28:63
     return Object.keys(BrowserMap).find(key => BrowserMap[key] === name);
   }
 
-  private getSupportedBrowserVersions(name: string): string[] {
-    // tslint:disable-next-line:no-var-requires
-    const { browserslist: browserlist } = require('./../../../../../package.json');
-    const browsersFromPackageJson = this._browserList.getBrowsers(browserlist);
-    const supportedBrowsers = this._browserList.getSupportedBrowsers();
-
-    browsersFromPackageJson.map((browser: string) => {
-      const browserNameVersionPair = browser.split(' ');
-      // @ts-ignore
-      return supportedBrowsers[browserNameVersionPair[0]].push(browserNameVersionPair[1]);
-    });
-
-    // @ts-ignore
-    return supportedBrowsers[name.toLowerCase()];
-  }
+  private getSupportedBrowserVersions(name: string): string[] {}
 }
 

[Survived] BlockStatement
services/browser-detector/browser-support/BrowserSupport.ts:34:54
     const browsersFromPackageJson = this._browserList.getBrowsers(browserlist);
     const supportedBrowsers = this._browserList.getSupportedBrowsers();
 
-    browsersFromPackageJson.map((browser: string) => {
-      const browserNameVersionPair = browser.split(' ');
-      // @ts-ignore
-      return supportedBrowsers[browserNameVersionPair[0]].push(browserNameVersionPair[1]);
-    });
+    browsersFromPackageJson.map((browser: string) => {});
 
     // @ts-ignore

[Survived] StringLiteral
services/browser-detector/browser-support/BrowserSupport.ts:35:52
     const supportedBrowsers = this._browserList.getSupportedBrowsers();
 
     browsersFromPackageJson.map((browser: string) => {
-      const browserNameVersionPair = browser.split(' ');
+      const browserNameVersionPair = browser.split("");
       // @ts-ignore
       return supportedBrowsers[browserNameVersionPair[0]].push(browserNameVersionPair[1]);
