[Survived] BlockStatement
services/browser-detector/device-support/DeviceSupport.ts:6:61
 
 @Service()
 export class DeviceSupport {
-  isDeviceSupported(version: string, name: string): boolean {
-    if (version === undefined) {
-      return false;
-    }
-
-    const dotIndex: number = version.indexOf('.');
-
-    if (name === 'Android' && dotIndex === -1) {
-      return this.hasMainVersion(SupportedAndroidVersions, version);
-    }
-    if (name === 'Android' && dotIndex !== -1) {
-      return this.hasSpecificVersion(SupportedAndroidVersions, version, dotIndex);
-    }
-    if (name === 'iOS' && dotIndex === -1) {
-      return this.hasMainVersion(SupportedIOSVersions, version);
-    }
-    if (name === 'iOS' && dotIndex !== -1) {
-      return this.hasSpecificVersion(SupportedIOSVersions, version, dotIndex);
-    }
-
-    return true;
-  }
+  isDeviceSupported(version: string, name: string): boolean {}
 
   private hasMainVersion(array: number[], version: string): boolean {

[Survived] ConditionalExpression
services/browser-detector/device-support/DeviceSupport.ts:7:9
 @Service()
 export class DeviceSupport {
   isDeviceSupported(version: string, name: string): boolean {
-    if (version === undefined) {
+    if (true) {
       return false;
     }

[Survived] ConditionalExpression
services/browser-detector/device-support/DeviceSupport.ts:7:9
 @Service()
 export class DeviceSupport {
   isDeviceSupported(version: string, name: string): boolean {
-    if (version === undefined) {
+    if (false) {
       return false;
     }

[Survived] BooleanLiteral
services/browser-detector/device-support/DeviceSupport.ts:8:14
 export class DeviceSupport {
   isDeviceSupported(version: string, name: string): boolean {
     if (version === undefined) {
-      return false;
+      return true;
     }
 

[Survived] ConditionalExpression
services/browser-detector/device-support/DeviceSupport.ts:13:9
 
     const dotIndex: number = version.indexOf('.');
 
-    if (name === 'Android' && dotIndex === -1) {
+    if (false) {
       return this.hasMainVersion(SupportedAndroidVersions, version);
     }

[Survived] ConditionalExpression
services/browser-detector/device-support/DeviceSupport.ts:13:9
 
     const dotIndex: number = version.indexOf('.');
 
-    if (name === 'Android' && dotIndex === -1) {
+    if (false && dotIndex === -1) {
       return this.hasMainVersion(SupportedAndroidVersions, version);
     }

[Survived] BlockStatement
services/browser-detector/device-support/DeviceSupport.ts:16:48
     if (name === 'Android' && dotIndex === -1) {
       return this.hasMainVersion(SupportedAndroidVersions, version);
     }
-    if (name === 'Android' && dotIndex !== -1) {
-      return this.hasSpecificVersion(SupportedAndroidVersions, version, dotIndex);
-    }
+    if (name === 'Android' && dotIndex !== -1) {}
     if (name === 'iOS' && dotIndex === -1) {
       return this.hasMainVersion(SupportedIOSVersions, version);

[Survived] ConditionalExpression
services/browser-detector/device-support/DeviceSupport.ts:16:9
     if (name === 'Android' && dotIndex === -1) {
       return this.hasMainVersion(SupportedAndroidVersions, version);
     }
-    if (name === 'Android' && dotIndex !== -1) {
+    if (false) {
       return this.hasSpecificVersion(SupportedAndroidVersions, version, dotIndex);
     }

[Survived] EqualityOperator
services/browser-detector/device-support/DeviceSupport.ts:19:27
     if (name === 'Android' && dotIndex !== -1) {
       return this.hasSpecificVersion(SupportedAndroidVersions, version, dotIndex);
     }
-    if (name === 'iOS' && dotIndex === -1) {
+    if (name === 'iOS' && dotIndex !== -1) {
       return this.hasMainVersion(SupportedIOSVersions, version);
     }

[Survived] ConditionalExpression
services/browser-detector/device-support/DeviceSupport.ts:19:9
     if (name === 'Android' && dotIndex !== -1) {
       return this.hasSpecificVersion(SupportedAndroidVersions, version, dotIndex);
     }
-    if (name === 'iOS' && dotIndex === -1) {
+    if (true) {
       return this.hasMainVersion(SupportedIOSVersions, version);
     }

[Survived] UnaryOperator
services/browser-detector/device-support/DeviceSupport.ts:22:40
     if (name === 'iOS' && dotIndex === -1) {
       return this.hasMainVersion(SupportedIOSVersions, version);
     }
-    if (name === 'iOS' && dotIndex !== -1) {
+    if (name === 'iOS' && dotIndex !== +1) {
       return this.hasSpecificVersion(SupportedIOSVersions, version, dotIndex);
     }

[Survived] ConditionalExpression
services/browser-detector/device-support/DeviceSupport.ts:22:27
     if (name === 'iOS' && dotIndex === -1) {
       return this.hasMainVersion(SupportedIOSVersions, version);
     }
-    if (name === 'iOS' && dotIndex !== -1) {
+    if (name === 'iOS' && false) {
       return this.hasSpecificVersion(SupportedIOSVersions, version, dotIndex);
     }

[Survived] BlockStatement
services/browser-detector/device-support/DeviceSupport.ts:29:69
     return true;
   }
 
-  private hasMainVersion(array: number[], version: string): boolean {
-    return array.includes(Number(Number(version).toFixed(0)));
-  }
+  private hasMainVersion(array: number[], version: string): boolean {}
 
   private hasSpecificVersion(array: number[], version: string, dotIndex: number): boolean {

[Survived] BlockStatement
services/browser-detector/device-support/DeviceSupport.ts:33:91
     return array.includes(Number(Number(version).toFixed(0)));
   }
 
-  private hasSpecificVersion(array: number[], version: string, dotIndex: number): boolean {
-    return array.includes(Number(Number(version.substr(0, dotIndex)).toFixed(0)));
-  }
+  private hasSpecificVersion(array: number[], version: string, dotIndex: number): boolean {}
 }
 
