[Survived] BlockStatement
shared/services/config-service/ConfigService.ts:25:38
     private jwtDecoder: JwtDecoder
   ) {}
 
-  setup(configObj: IConfig): IConfig {
-    const { config, configFromJwt } = this.getConfigurationFromConfigOrJwt(configObj);
-
-    this.configFromJwt = configFromJwt;
-
-    return this.updateConfig(config);
-  }
+  setup(configObj: IConfig): IConfig {}
 
   update(configObj: IConfig): IConfig {

[Survived] BlockStatement
shared/services/config-service/ConfigService.ts:33:39
     return this.updateConfig(config);
   }
 
-  update(configObj: IConfig): IConfig {
-    if (this.configFromJwt) {
-      this.cannotOverride();
-    }
-
-    return this.updateConfig(configObj);
-  }
+  update(configObj: IConfig): IConfig {}
 
   updateJwt(jwt: string): IConfig {

[Survived] BlockStatement
shared/services/config-service/ConfigService.ts:34:29
   }
 
   update(configObj: IConfig): IConfig {
-    if (this.configFromJwt) {
-      this.cannotOverride();
-    }
+    if (this.configFromJwt) {}
 
     return this.updateConfig(configObj);

[Survived] ConditionalExpression
shared/services/config-service/ConfigService.ts:34:9
   }
 
   update(configObj: IConfig): IConfig {
-    if (this.configFromJwt) {
+    if (false) {
       this.cannotOverride();
     }

[Survived] BlockStatement
shared/services/config-service/ConfigService.ts:41:35
     return this.updateConfig(configObj);
   }
 
-  updateJwt(jwt: string): IConfig {
-    return this.updateConfig({ ...this.getConfig(), jwt });
-  }
+  updateJwt(jwt: string): IConfig {}
 
   updateFragment<K extends 'components' | 'visaCheckout' | 'applePay', C extends IConfig[K]>(

[Survived] BlockStatement
shared/services/config-service/ConfigService.ts:48:14
   updateFragment<K extends 'components' | 'visaCheckout' | 'applePay', C extends IConfig[K]>(
     key: K,
     config: C
-  ): IConfig {
-    if (this.configFromJwt) {
-      this.cannotOverride();
-    }
-
-    const currentConfig = this.getConfig();
-    const currentFragment = currentConfig[key];
-    const updatedFragment = { ...currentFragment, ...(config || {}) };
-    const updatedConfig = { ...currentConfig, [key]: updatedFragment };
-
-    return this.updateConfig(updatedConfig);
-  }
+  ): IConfig {}
 
   getConfig(): IConfig {

[Survived] BlockStatement
shared/services/config-service/ConfigService.ts:49:29
     key: K,
     config: C
   ): IConfig {
-    if (this.configFromJwt) {
-      this.cannotOverride();
-    }
+    if (this.configFromJwt) {}
 
     const currentConfig = this.getConfig();

[Survived] ConditionalExpression
shared/services/config-service/ConfigService.ts:49:9
     key: K,
     config: C
   ): IConfig {
-    if (this.configFromJwt) {
+    if (true) {
       this.cannotOverride();
     }

[Survived] ConditionalExpression
shared/services/config-service/ConfigService.ts:55:55
 
     const currentConfig = this.getConfig();
     const currentFragment = currentConfig[key];
-    const updatedFragment = { ...currentFragment, ...(config || {}) };
+    const updatedFragment = { ...currentFragment, ...(false) };
     const updatedConfig = { ...currentConfig, [key]: updatedFragment };
 

[Survived] LogicalOperator
shared/services/config-service/ConfigService.ts:55:55
 
     const currentConfig = this.getConfig();
     const currentFragment = currentConfig[key];
-    const updatedFragment = { ...currentFragment, ...(config || {}) };
+    const updatedFragment = { ...currentFragment, ...(config && {}) };
     const updatedConfig = { ...currentConfig, [key]: updatedFragment };
 

[Survived] ObjectLiteral
shared/services/config-service/ConfigService.ts:56:27
     const currentConfig = this.getConfig();
     const currentFragment = currentConfig[key];
     const updatedFragment = { ...currentFragment, ...(config || {}) };
-    const updatedConfig = { ...currentConfig, [key]: updatedFragment };
+    const updatedConfig = {};
 
     return this.updateConfig(updatedConfig);

[Survived] BlockStatement
shared/services/config-service/ConfigService.ts:61:24
     return this.updateConfig(updatedConfig);
   }
 
-  getConfig(): IConfig {
-    return this.config$.getValue();
-  }
+  getConfig(): IConfig {}
 
   getConfig$(watchForChanges?: boolean): Observable<IConfig> {

[Survived] BlockStatement
shared/services/config-service/ConfigService.ts:65:62
     return this.config$.getValue();
   }
 
-  getConfig$(watchForChanges?: boolean): Observable<IConfig> {
-    if (watchForChanges) {
-      return this.config$.pipe(filter<IConfig>(Boolean));
-    }
-
-    return this.config$.pipe(filter<IConfig>(Boolean), first());
-  }
+  getConfig$(watchForChanges?: boolean): Observable<IConfig> {}
 
   private updateConfig(config: IConfig): IConfig {

[Survived] BlockStatement
shared/services/config-service/ConfigService.ts:66:26
   }
 
   getConfig$(watchForChanges?: boolean): Observable<IConfig> {
-    if (watchForChanges) {
-      return this.config$.pipe(filter<IConfig>(Boolean));
-    }
+    if (watchForChanges) {}
 
     return this.config$.pipe(filter<IConfig>(Boolean), first());

[Survived] ConditionalExpression
shared/services/config-service/ConfigService.ts:66:9
   }
 
   getConfig$(watchForChanges?: boolean): Observable<IConfig> {
-    if (watchForChanges) {
+    if (true) {
       return this.config$.pipe(filter<IConfig>(Boolean));
     }

[Survived] BlockStatement
shared/services/config-service/ConfigService.ts:73:50
     return this.config$.pipe(filter<IConfig>(Boolean), first());
   }
 
-  private updateConfig(config: IConfig): IConfig {
-    const fullConfig = this.resolver.resolve(config);
-    const validationError = this.validator.validate(fullConfig);
-
-    if (validationError) {
-      throw validationError;
-    }
-
-    this.config$.next(fullConfig);
-
-    this.messageBus.publish({
-      type: PUBLIC_EVENTS.CONFIG_CHANGED,
-      data: JSON.parse(JSON.stringify(fullConfig))
-    });
-
-    Container.set(CONFIG, fullConfig);
-
-    return fullConfig;
-  }
+  private updateConfig(config: IConfig): IConfig {}
 
   private getConfigurationFromConfigOrJwt(config: IConfig): { config: IConfig; configFromJwt: boolean } {

[Survived] ConditionalExpression
shared/services/config-service/ConfigService.ts:77:9
     const fullConfig = this.resolver.resolve(config);
     const validationError = this.validator.validate(fullConfig);
 
-    if (validationError) {
+    if (true) {
       throw validationError;
     }

[Survived] ConditionalExpression
shared/services/config-service/ConfigService.ts:77:9
     const fullConfig = this.resolver.resolve(config);
     const validationError = this.validator.validate(fullConfig);
 
-    if (validationError) {
+    if (false) {
       throw validationError;
     }

[Survived] BlockStatement
shared/services/config-service/ConfigService.ts:96:26
   private getConfigurationFromConfigOrJwt(config: IConfig): { config: IConfig; configFromJwt: boolean } {
     const { payload } = this.jwtDecoder.decode(config.jwt);
 
-    if (!payload.config) {
-      return {
-        configFromJwt: false,
-        config
-      };
-    }
+    if (!payload.config) {}
 
     const allowedKeys = ['jwt', 'submitCallback', 'successCallback', 'errorCallback', 'cancelCallback'];

[Survived] ConditionalExpression
shared/services/config-service/ConfigService.ts:96:9
   private getConfigurationFromConfigOrJwt(config: IConfig): { config: IConfig; configFromJwt: boolean } {
     const { payload } = this.jwtDecoder.decode(config.jwt);
 
-    if (!payload.config) {
+    if (true) {
       return {
         configFromJwt: false,

[Survived] ObjectLiteral
shared/services/config-service/ConfigService.ts:97:14
     const { payload } = this.jwtDecoder.decode(config.jwt);
 
     if (!payload.config) {
-      return {
-        configFromJwt: false,
-        config
-      };
+      return {};
     }
 

[Survived] BooleanLiteral
shared/services/config-service/ConfigService.ts:98:24
 
     if (!payload.config) {
       return {
-        configFromJwt: false,
+        configFromJwt: true,
         config
       };

[Survived] StringLiteral
shared/services/config-service/ConfigService.ts:103:51
       };
     }
 
-    const allowedKeys = ['jwt', 'submitCallback', 'successCallback', 'errorCallback', 'cancelCallback'];
+    const allowedKeys = ['jwt', 'submitCallback', "", 'errorCallback', 'cancelCallback'];
 
     Object.keys(config).forEach(key => allowedKeys.includes(key) || this.cannotOverride());

[Survived] ArrayDeclaration
shared/services/config-service/ConfigService.ts:103:25
       };
     }
 
-    const allowedKeys = ['jwt', 'submitCallback', 'successCallback', 'errorCallback', 'cancelCallback'];
+    const allowedKeys = [];
 
     Object.keys(config).forEach(key => allowedKeys.includes(key) || this.cannotOverride());

[Survived] LogicalOperator
shared/services/config-service/ConfigService.ts:105:40
 
     const allowedKeys = ['jwt', 'submitCallback', 'successCallback', 'errorCallback', 'cancelCallback'];
 
-    Object.keys(config).forEach(key => allowedKeys.includes(key) || this.cannotOverride());
+    Object.keys(config).forEach(key => allowedKeys.includes(key) && this.cannotOverride());
 
     return {

[Survived] ConditionalExpression
shared/services/config-service/ConfigService.ts:105:40
 
     const allowedKeys = ['jwt', 'submitCallback', 'successCallback', 'errorCallback', 'cancelCallback'];
 
-    Object.keys(config).forEach(key => allowedKeys.includes(key) || this.cannotOverride());
+    Object.keys(config).forEach(key => true);
 
     return {

[Survived] ObjectLiteral
shared/services/config-service/ConfigService.ts:107:12
 
     Object.keys(config).forEach(key => allowedKeys.includes(key) || this.cannotOverride());
 
-    return {
-      configFromJwt: true,
-      config: {
-        ...payload.config,
-        jwt: config.jwt,
-        submitCallback: config.submitCallback,
-        successCallback: config.successCallback,
-        errorCallback: config.errorCallback,
-        cancelCallback: config.cancelCallback
-      }
-    };
+    return {};
   }
 

[Survived] BooleanLiteral
shared/services/config-service/ConfigService.ts:108:22
     Object.keys(config).forEach(key => allowedKeys.includes(key) || this.cannotOverride());
 
     return {
-      configFromJwt: true,
+      configFromJwt: false,
       config: {
         ...payload.config,

[Survived] BlockStatement
shared/services/config-service/ConfigService.ts:120:34
     };
   }
 
-  private cannotOverride(): void {
-    throw new Error(
-      'Cannot override the configuration specified in the JWT. ' +
-        'The config object should contain only the JWT and callbacks (optionally).'
-    );
-  }
+  private cannotOverride(): void {}
 }
 

[Survived] ArithmeticOperator
shared/services/config-service/ConfigService.ts:122:7
 
   private cannotOverride(): void {
     throw new Error(
-      'Cannot override the configuration specified in the JWT. ' +
-        'The config object should contain only the JWT and callbacks (optionally).'
+      'Cannot override the configuration specified in the JWT. ' - 'The config object should contain only the JWT and callbacks (optionally).'
     );
   }

[Survived] StringLiteral
shared/services/config-service/ConfigService.ts:123:9
   private cannotOverride(): void {
     throw new Error(
       'Cannot override the configuration specified in the JWT. ' +
-        'The config object should contain only the JWT and callbacks (optionally).'
+        ""
     );
   }
