[Survived] BlockStatement
shared/services/config-validator/ConfigValidator.ts:8:53
 
 @Service()
 export class ConfigValidator {
-  validate(config: IConfig): ValidationError | null {
-    return ConfigSchema.validate(config).error || null;
-  }
+  validate(config: IConfig): ValidationError | null {}
 }
 

[Survived] LogicalOperator
shared/services/config-validator/ConfigValidator.ts:9:12
 @Service()
 export class ConfigValidator {
   validate(config: IConfig): ValidationError | null {
-    return ConfigSchema.validate(config).error || null;
+    return ConfigSchema.validate(config).error && null;
   }
 }

[Survived] ConditionalExpression
shared/services/config-validator/ConfigValidator.ts:9:12
 @Service()
 export class ConfigValidator {
   validate(config: IConfig): ValidationError | null {
-    return ConfigSchema.validate(config).error || null;
+    return false;
   }
 }
