[Survived] BlockStatement
shared/services/message-bus/FrameAccessor.ts:12:28
 export class FrameAccessor {
   constructor(private identifier: FrameIdentifier, @Inject(WINDOW) private window: Window) {}
 
-  getParentFrame(): Window {
-    if (this.identifier.isParentFrame()) {
-      return this.window;
-    }
-
-    return this.window.parent;
-  }
+  getParentFrame(): Window {}
 
   getControlFrame(): IControlFrameWindow | undefined {

[Survived] BlockStatement
shared/services/message-bus/FrameAccessor.ts:13:42
   constructor(private identifier: FrameIdentifier, @Inject(WINDOW) private window: Window) {}
 
   getParentFrame(): Window {
-    if (this.identifier.isParentFrame()) {
-      return this.window;
-    }
+    if (this.identifier.isParentFrame()) {}
 
     return this.window.parent;

[Survived] ConditionalExpression
shared/services/message-bus/FrameAccessor.ts:13:9
   constructor(private identifier: FrameIdentifier, @Inject(WINDOW) private window: Window) {}
 
   getParentFrame(): Window {
-    if (this.identifier.isParentFrame()) {
+    if (false) {
       return this.window;
     }

[Survived] BlockStatement
shared/services/message-bus/FrameAccessor.ts:20:54
     return this.window.parent;
   }
 
-  getControlFrame(): IControlFrameWindow | undefined {
-    if (this.identifier.isControlFrame()) {
-      return this.window;
-    }
-
-    return this.getFrameCollection()[CONTROL_FRAME_IFRAME];
-  }
+  getControlFrame(): IControlFrameWindow | undefined {}
 
   getFrameCollection(): FrameCollection {

[Survived] BlockStatement
shared/services/message-bus/FrameAccessor.ts:21:43
   }
 
   getControlFrame(): IControlFrameWindow | undefined {
-    if (this.identifier.isControlFrame()) {
-      return this.window;
-    }
+    if (this.identifier.isControlFrame()) {}
 
     return this.getFrameCollection()[CONTROL_FRAME_IFRAME];

[Survived] ConditionalExpression
shared/services/message-bus/FrameAccessor.ts:21:9
   }
 
   getControlFrame(): IControlFrameWindow | undefined {
-    if (this.identifier.isControlFrame()) {
+    if (false) {
       return this.window;
     }

[Survived] BlockStatement
shared/services/message-bus/FrameAccessor.ts:28:41
     return this.getFrameCollection()[CONTROL_FRAME_IFRAME];
   }
 
-  getFrameCollection(): FrameCollection {
-    return this.getParentFrame().frames as FrameCollection;
-  }
+  getFrameCollection(): FrameCollection {}
 }
 
