[Survived] BooleanLiteral
shared/services/message-bus/FrameIdentifier.ts:7:34
 @Service()
 export class FrameIdentifier {
   private frameName: string;
-  private parentFrame: boolean = false;
+  private parentFrame: boolean = true;
 
   getFrameName(): string {

[Survived] BlockStatement
shared/services/message-bus/FrameIdentifier.ts:9:26
   private frameName: string;
   private parentFrame: boolean = false;
 
-  getFrameName(): string {
-    return this.frameName;
-  }
+  getFrameName(): string {}
 
   setFrameName(frameName: string): void {

[Survived] BlockStatement
shared/services/message-bus/FrameIdentifier.ts:13:41
     return this.frameName;
   }
 
-  setFrameName(frameName: string): void {
-    this.frameName = frameName;
-    this.parentFrame = frameName === MERCHANT_PARENT_FRAME;
-  }
+  setFrameName(frameName: string): void {}
 
   isParentFrame(): boolean {

[Survived] ConditionalExpression
shared/services/message-bus/FrameIdentifier.ts:15:24
 
   setFrameName(frameName: string): void {
     this.frameName = frameName;
-    this.parentFrame = frameName === MERCHANT_PARENT_FRAME;
+    this.parentFrame = false;
   }
 

[Survived] EqualityOperator
shared/services/message-bus/FrameIdentifier.ts:15:24
 
   setFrameName(frameName: string): void {
     this.frameName = frameName;
-    this.parentFrame = frameName === MERCHANT_PARENT_FRAME;
+    this.parentFrame = frameName !== MERCHANT_PARENT_FRAME;
   }
 

[Survived] BlockStatement
shared/services/message-bus/FrameIdentifier.ts:18:28
     this.parentFrame = frameName === MERCHANT_PARENT_FRAME;
   }
 
-  isParentFrame(): boolean {
-    return this.parentFrame;
-  }
+  isParentFrame(): boolean {}
 
   isControlFrame(): boolean {

[Survived] BlockStatement
shared/services/message-bus/FrameIdentifier.ts:22:29
     return this.parentFrame;
   }
 
-  isControlFrame(): boolean {
-    return this.getFrameName() === CONTROL_FRAME_IFRAME;
-  }
+  isControlFrame(): boolean {}
 }
 

[Survived] ConditionalExpression
shared/services/message-bus/FrameIdentifier.ts:23:12
   }
 
   isControlFrame(): boolean {
-    return this.getFrameName() === CONTROL_FRAME_IFRAME;
+    return true;
   }
 }

[Survived] EqualityOperator
shared/services/message-bus/FrameIdentifier.ts:23:12
   }
 
   isControlFrame(): boolean {
-    return this.getFrameName() === CONTROL_FRAME_IFRAME;
+    return this.getFrameName() !== CONTROL_FRAME_IFRAME;
   }
 }
