[Survived] ArrowFunction
shared/services/message-bus/FramesHub.ts:19:75
   private activeFrame$: Subject<string[]> = new BehaviorSubject([]);
 
   constructor(private communicator: InterFrameCommunicator, private identifier: FrameIdentifier) {
-    this.communicator.whenReceive(FramesHub.GET_FRAMES_EVENT).thenRespond(() => this.activeFrame$);
+    this.communicator.whenReceive(FramesHub.GET_FRAMES_EVENT).thenRespond(() => undefined);
 
     this.getInitialFrames().subscribe(value => this.activeFrame$.next(value));

[Survived] ArrowFunction
shared/services/message-bus/FramesHub.ts:21:39
   constructor(private communicator: InterFrameCommunicator, private identifier: FrameIdentifier) {
     this.communicator.whenReceive(FramesHub.GET_FRAMES_EVENT).thenRespond(() => this.activeFrame$);
 
-    this.getInitialFrames().subscribe(value => this.activeFrame$.next(value));
+    this.getInitialFrames().subscribe(() => undefined);
 
     const fromEventFrame$ = this.communicator.incomingEvent$.pipe(

[Survived] ArrowFunction
shared/services/message-bus/FramesHub.ts:25:14
 
     const fromEventFrame$ = this.communicator.incomingEvent$.pipe(
       ofType(FramesHub.FRAME_READY_EVENT),
-      filter((event: IMessageBusEvent) => Boolean(event.data)),
+      filter(() => undefined),
       map((event: IMessageBusEvent) => event.data)
     );

[Survived] ArrowFunction
shared/services/message-bus/FramesHub.ts:26:11
     const fromEventFrame$ = this.communicator.incomingEvent$.pipe(
       ofType(FramesHub.FRAME_READY_EVENT),
       filter((event: IMessageBusEvent) => Boolean(event.data)),
-      map((event: IMessageBusEvent) => event.data)
+      map(() => undefined)
     );
 

[Survived] ArrowFunction
shared/services/message-bus/FramesHub.ts:32:13
     fromEventFrame$
       .pipe(
         withLatestFrom(this.activeFrame$),
-        map(([newFrame, activeFrames]) => ArrayUtils.unique([...activeFrames, newFrame]))
+        map(() => undefined)
       )
       .subscribe(this.activeFrame$);

[Survived] ArrowFunction
shared/services/message-bus/FramesHub.ts:38:18
 
     fromEventFrame$
       .pipe(withLatestFrom(this.activeFrame$))
-      .subscribe(([newFrame, activeFrames]) => this.onFrameReady(newFrame, activeFrames));
+      .subscribe(() => undefined);
 
     this.communicator.incomingEvent$

[Survived] ArrowFunction
shared/services/message-bus/FramesHub.ts:42:18
 
     this.communicator.incomingEvent$
       .pipe(ofType(PUBLIC_EVENTS.DESTROY), mapTo([]))
-      .subscribe(value => this.activeFrame$.next(value));
+      .subscribe(() => undefined);
   }
 

[Survived] BlockStatement
shared/services/message-bus/FramesHub.ts:45:59
       .subscribe(value => this.activeFrame$.next(value));
   }
 
-  public isFrameActive(name: string): Observable<boolean> {
-    return this.activeFrame$.pipe(
-      map(frames => frames.indexOf(name) !== -1),
-      distinctUntilChanged()
-    );
-  }
+  public isFrameActive(name: string): Observable<boolean> {}
 
   public waitForFrame(name: string): Observable<string> {

[Survived] ConditionalExpression
shared/services/message-bus/FramesHub.ts:47:21
 
   public isFrameActive(name: string): Observable<boolean> {
     return this.activeFrame$.pipe(
-      map(frames => frames.indexOf(name) !== -1),
+      map(frames => true),
       distinctUntilChanged()
     );

[Survived] UnaryOperator
shared/services/message-bus/FramesHub.ts:47:46
 
   public isFrameActive(name: string): Observable<boolean> {
     return this.activeFrame$.pipe(
-      map(frames => frames.indexOf(name) !== -1),
+      map(frames => frames.indexOf(name) !== +1),
       distinctUntilChanged()
     );

[Survived] BlockStatement
shared/services/message-bus/FramesHub.ts:52:57
     );
   }
 
-  public waitForFrame(name: string): Observable<string> {
-    return this.isFrameActive(name).pipe(filter(Boolean), first(), mapTo(name));
-  }
+  public waitForFrame(name: string): Observable<string> {}
 
   public notifyReadyState(): void {

[Survived] BlockStatement
shared/services/message-bus/FramesHub.ts:56:35
     return this.isFrameActive(name).pipe(filter(Boolean), first(), mapTo(name));
   }
 
-  public notifyReadyState(): void {
-    const frameName = this.identifier.getFrameName();
-
-    if (frameName === MERCHANT_PARENT_FRAME) {
-      return;
-    }
-
-    this.communicator.send({ type: FramesHub.FRAME_READY_EVENT, data: frameName }, MERCHANT_PARENT_FRAME);
-  }
+  public notifyReadyState(): void {}
 
   public getParentFrame(): Window {

[Survived] ConditionalExpression
shared/services/message-bus/FramesHub.ts:59:9
   public notifyReadyState(): void {
     const frameName = this.identifier.getFrameName();
 
-    if (frameName === MERCHANT_PARENT_FRAME) {
+    if (true) {
       return;
     }

[Survived] ConditionalExpression
shared/services/message-bus/FramesHub.ts:59:9
   public notifyReadyState(): void {
     const frameName = this.identifier.getFrameName();
 
-    if (frameName === MERCHANT_PARENT_FRAME) {
+    if (false) {
       return;
     }

[Survived] BlockStatement
shared/services/message-bus/FramesHub.ts:66:35
     this.communicator.send({ type: FramesHub.FRAME_READY_EVENT, data: frameName }, MERCHANT_PARENT_FRAME);
   }
 
-  public getParentFrame(): Window {
-    if (this.identifier.isParentFrame()) {
-      return window;
-    }
-
-    return window.parent;
-  }
+  public getParentFrame(): Window {}
 
   public reset() {

[Survived] ConditionalExpression
shared/services/message-bus/FramesHub.ts:67:9
   }
 
   public getParentFrame(): Window {
-    if (this.identifier.isParentFrame()) {
+    if (false) {
       return window;
     }

[Survived] ConditionalExpression
shared/services/message-bus/FramesHub.ts:67:9
   }
 
   public getParentFrame(): Window {
-    if (this.identifier.isParentFrame()) {
+    if (true) {
       return window;
     }

[Survived] BlockStatement
shared/services/message-bus/FramesHub.ts:74:18
     return window.parent;
   }
 
-  public reset() {
-    this.activeFrame$.next([]);
-  }
+  public reset() {}
 
   private getInitialFrames(): Observable<string[]> {

[Survived] BlockStatement
shared/services/message-bus/FramesHub.ts:78:52
     this.activeFrame$.next([]);
   }
 
-  private getInitialFrames(): Observable<string[]> {
-    if (this.identifier.isParentFrame()) {
-      return of([]);
-    }
-
-    return from(this.communicator.query<string[]>({ type: FramesHub.GET_FRAMES_EVENT }, MERCHANT_PARENT_FRAME));
-  }
+  private getInitialFrames(): Observable<string[]> {}
 
   private onFrameReady(newFrame: string, activeFrames: string[]): void {

[Survived] BlockStatement
shared/services/message-bus/FramesHub.ts:79:42
   }
 
   private getInitialFrames(): Observable<string[]> {
-    if (this.identifier.isParentFrame()) {
-      return of([]);
-    }
+    if (this.identifier.isParentFrame()) {}
 
     return from(this.communicator.query<string[]>({ type: FramesHub.GET_FRAMES_EVENT }, MERCHANT_PARENT_FRAME));

[Survived] ConditionalExpression
shared/services/message-bus/FramesHub.ts:79:9
   }
 
   private getInitialFrames(): Observable<string[]> {
-    if (this.identifier.isParentFrame()) {
+    if (false) {
       return of([]);
     }

[Survived] BlockStatement
shared/services/message-bus/FramesHub.ts:86:72
     return from(this.communicator.query<string[]>({ type: FramesHub.GET_FRAMES_EVENT }, MERCHANT_PARENT_FRAME));
   }
 
-  private onFrameReady(newFrame: string, activeFrames: string[]): void {
-    if (!this.identifier.isParentFrame()) {
-      return;
-    }
-
-    const event: IMessageBusEvent = {
-      type: FramesHub.FRAME_READY_EVENT,
-      data: newFrame
-    };
-
-    activeFrames.forEach(frame => this.communicator.send(event, frame));
-  }
+  private onFrameReady(newFrame: string, activeFrames: string[]): void {}
 }
 

[Survived] ConditionalExpression
shared/services/message-bus/FramesHub.ts:87:9
   }
 
   private onFrameReady(newFrame: string, activeFrames: string[]): void {
-    if (!this.identifier.isParentFrame()) {
+    if (false) {
       return;
     }

[Survived] BlockStatement
shared/services/message-bus/FramesHub.ts:87:43
   }
 
   private onFrameReady(newFrame: string, activeFrames: string[]): void {
-    if (!this.identifier.isParentFrame()) {
-      return;
-    }
+    if (!this.identifier.isParentFrame()) {}
 
     const event: IMessageBusEvent = {

[Survived] ArrowFunction
shared/services/message-bus/FramesHub.ts:96:26
       data: newFrame
     };
 
-    activeFrames.forEach(frame => this.communicator.send(event, frame));
+    activeFrames.forEach(() => undefined);
   }
 }
