[Survived] BlockStatement
shared/services/message-bus/InterFrameCommunicator.ts:27:90
   private readonly frameOrigin: string;
   private parentOrigin: string;
 
-  constructor(private identifier: FrameIdentifier, private frameAccessor: FrameAccessor) {
-    this.incomingEvent$ = fromEventPattern<MessageEvent>(
-      handler => window.addEventListener(InterFrameCommunicator.MESSAGE_EVENT, handler, true),
-      handler => window.removeEventListener(InterFrameCommunicator.MESSAGE_EVENT, handler)
-    ).pipe(
-      filter(event => event.data.type),
-      map(event => event.data),
-      share()
-    );
-
-    this.communicationClosed$ = this.close$.asObservable();
-    this.frameOrigin = new URL(environment.FRAME_URL).origin;
-  }
+  constructor(private identifier: FrameIdentifier, private frameAccessor: FrameAccessor) {}
 
   public send(message: IMessageBusEvent, target: Window | string): void {

[Survived] ArrowFunction
shared/services/message-bus/InterFrameCommunicator.ts:29:7
 
   constructor(private identifier: FrameIdentifier, private frameAccessor: FrameAccessor) {
     this.incomingEvent$ = fromEventPattern<MessageEvent>(
-      handler => window.addEventListener(InterFrameCommunicator.MESSAGE_EVENT, handler, true),
+      () => undefined,
       handler => window.removeEventListener(InterFrameCommunicator.MESSAGE_EVENT, handler)
     ).pipe(

[Survived] BooleanLiteral
shared/services/message-bus/InterFrameCommunicator.ts:29:89
 
   constructor(private identifier: FrameIdentifier, private frameAccessor: FrameAccessor) {
     this.incomingEvent$ = fromEventPattern<MessageEvent>(
-      handler => window.addEventListener(InterFrameCommunicator.MESSAGE_EVENT, handler, true),
+      handler => window.addEventListener(InterFrameCommunicator.MESSAGE_EVENT, handler, false),
       handler => window.removeEventListener(InterFrameCommunicator.MESSAGE_EVENT, handler)
     ).pipe(

[Survived] ArrowFunction
shared/services/message-bus/InterFrameCommunicator.ts:30:7
   constructor(private identifier: FrameIdentifier, private frameAccessor: FrameAccessor) {
     this.incomingEvent$ = fromEventPattern<MessageEvent>(
       handler => window.addEventListener(InterFrameCommunicator.MESSAGE_EVENT, handler, true),
-      handler => window.removeEventListener(InterFrameCommunicator.MESSAGE_EVENT, handler)
+      () => undefined
     ).pipe(
       filter(event => event.data.type),

[Survived] ArrowFunction
shared/services/message-bus/InterFrameCommunicator.ts:32:14
       handler => window.addEventListener(InterFrameCommunicator.MESSAGE_EVENT, handler, true),
       handler => window.removeEventListener(InterFrameCommunicator.MESSAGE_EVENT, handler)
     ).pipe(
-      filter(event => event.data.type),
+      filter(() => undefined),
       map(event => event.data),
       share()

[Survived] ArrowFunction
shared/services/message-bus/InterFrameCommunicator.ts:33:11
       handler => window.removeEventListener(InterFrameCommunicator.MESSAGE_EVENT, handler)
     ).pipe(
       filter(event => event.data.type),
-      map(event => event.data),
+      map(() => undefined),
       share()
     );

[Survived] BlockStatement
shared/services/message-bus/InterFrameCommunicator.ts:41:73
     this.frameOrigin = new URL(environment.FRAME_URL).origin;
   }
 
-  public send(message: IMessageBusEvent, target: Window | string): void {
-    try {
-      const parentFrame = this.frameAccessor.getParentFrame();
-      const targetFrame = this.resolveTargetFrame(target);
-      const frameOrigin = targetFrame === parentFrame ? this.getParentOrigin() : this.frameOrigin;
-
-      targetFrame.postMessage(message, frameOrigin);
-    } catch (e) {
-      if (e instanceof FrameNotFound) {
-        return Debug.warn(e.message);
-      }
-
-      throw e;
-    }
-  }
+  public send(message: IMessageBusEvent, target: Window | string): void {}
 
   public query<T>(message: IMessageBusEvent, target: Window | string): Promise<T> {

[Survived] BlockStatement
shared/services/message-bus/InterFrameCommunicator.ts:42:9
   }
 
   public send(message: IMessageBusEvent, target: Window | string): void {
-    try {
-      const parentFrame = this.frameAccessor.getParentFrame();
-      const targetFrame = this.resolveTargetFrame(target);
-      const frameOrigin = targetFrame === parentFrame ? this.getParentOrigin() : this.frameOrigin;
-
-      targetFrame.postMessage(message, frameOrigin);
-    } catch (e) {
+    try {} catch (e) {
       if (e instanceof FrameNotFound) {
         return Debug.warn(e.message);

[Survived] ConditionalExpression
shared/services/message-bus/InterFrameCommunicator.ts:45:27
     try {
       const parentFrame = this.frameAccessor.getParentFrame();
       const targetFrame = this.resolveTargetFrame(target);
-      const frameOrigin = targetFrame === parentFrame ? this.getParentOrigin() : this.frameOrigin;
+      const frameOrigin = true ? this.getParentOrigin() : this.frameOrigin;
 
       targetFrame.postMessage(message, frameOrigin);

[Survived] ConditionalExpression
shared/services/message-bus/InterFrameCommunicator.ts:45:27
     try {
       const parentFrame = this.frameAccessor.getParentFrame();
       const targetFrame = this.resolveTargetFrame(target);
-      const frameOrigin = targetFrame === parentFrame ? this.getParentOrigin() : this.frameOrigin;
+      const frameOrigin = false ? this.getParentOrigin() : this.frameOrigin;
 
       targetFrame.postMessage(message, frameOrigin);

[Survived] BlockStatement
shared/services/message-bus/InterFrameCommunicator.ts:48:17
       const frameOrigin = targetFrame === parentFrame ? this.getParentOrigin() : this.frameOrigin;
 
       targetFrame.postMessage(message, frameOrigin);
-    } catch (e) {
-      if (e instanceof FrameNotFound) {
-        return Debug.warn(e.message);
-      }
-
-      throw e;
-    }
+    } catch (e) {}
   }
 

[Survived] BlockStatement
shared/services/message-bus/InterFrameCommunicator.ts:49:39
 
       targetFrame.postMessage(message, frameOrigin);
     } catch (e) {
-      if (e instanceof FrameNotFound) {
-        return Debug.warn(e.message);
-      }
+      if (e instanceof FrameNotFound) {}
 
       throw e;

[Survived] ConditionalExpression
shared/services/message-bus/InterFrameCommunicator.ts:49:11
 
       targetFrame.postMessage(message, frameOrigin);
     } catch (e) {
-      if (e instanceof FrameNotFound) {
+      if (true) {
         return Debug.warn(e.message);
       }

[Survived] BlockStatement
shared/services/message-bus/InterFrameCommunicator.ts:57:83
     }
   }
 
-  public query<T>(message: IMessageBusEvent, target: Window | string): Promise<T> {
-    return new Promise((resolve, reject) => {
-      const sourceFrame = this.identifier.getFrameName() || MERCHANT_PARENT_FRAME;
-      const query = new QueryMessage(message, sourceFrame);
-
-      this.incomingEvent$
-        .pipe(
-          ofType(ResponseMessage.MESSAGE_TYPE),
-          filter((event: ResponseMessage<T>) => event.queryId === query.queryId),
-          map((event: ResponseMessage<T>) => event.data),
-          take(1)
-        )
-        .subscribe({
-          next(result) {
-            resolve(result);
-          },
-          error(error) {
-            reject(error);
-          }
-        });
-
-      this.send(query, target);
-    });
-  }
+  public query<T>(message: IMessageBusEvent, target: Window | string): Promise<T> {}
 
   public whenReceive(eventType: string) {

[Survived] BlockStatement
shared/services/message-bus/InterFrameCommunicator.ts:58:45
   }
 
   public query<T>(message: IMessageBusEvent, target: Window | string): Promise<T> {
-    return new Promise((resolve, reject) => {
-      const sourceFrame = this.identifier.getFrameName() || MERCHANT_PARENT_FRAME;
-      const query = new QueryMessage(message, sourceFrame);
-
-      this.incomingEvent$
-        .pipe(
-          ofType(ResponseMessage.MESSAGE_TYPE),
-          filter((event: ResponseMessage<T>) => event.queryId === query.queryId),
-          map((event: ResponseMessage<T>) => event.data),
-          take(1)
-        )
-        .subscribe({
-          next(result) {
-            resolve(result);
-          },
-          error(error) {
-            reject(error);
-          }
-        });
-
-      this.send(query, target);
-    });
+    return new Promise((resolve, reject) => {});
   }
 

[Survived] ConditionalExpression
shared/services/message-bus/InterFrameCommunicator.ts:59:27
 
   public query<T>(message: IMessageBusEvent, target: Window | string): Promise<T> {
     return new Promise((resolve, reject) => {
-      const sourceFrame = this.identifier.getFrameName() || MERCHANT_PARENT_FRAME;
+      const sourceFrame = true;
       const query = new QueryMessage(message, sourceFrame);
 

[Survived] LogicalOperator
shared/services/message-bus/InterFrameCommunicator.ts:59:27
 
   public query<T>(message: IMessageBusEvent, target: Window | string): Promise<T> {
     return new Promise((resolve, reject) => {
-      const sourceFrame = this.identifier.getFrameName() || MERCHANT_PARENT_FRAME;
+      const sourceFrame = this.identifier.getFrameName() && MERCHANT_PARENT_FRAME;
       const query = new QueryMessage(message, sourceFrame);
 

[Survived] ArrowFunction
shared/services/message-bus/InterFrameCommunicator.ts:65:18
       this.incomingEvent$
         .pipe(
           ofType(ResponseMessage.MESSAGE_TYPE),
-          filter((event: ResponseMessage<T>) => event.queryId === query.queryId),
+          filter(() => undefined),
           map((event: ResponseMessage<T>) => event.data),
           take(1)

[Survived] ConditionalExpression
shared/services/message-bus/InterFrameCommunicator.ts:65:49
       this.incomingEvent$
         .pipe(
           ofType(ResponseMessage.MESSAGE_TYPE),
-          filter((event: ResponseMessage<T>) => event.queryId === query.queryId),
+          filter((event: ResponseMessage<T>) => false),
           map((event: ResponseMessage<T>) => event.data),
           take(1)

[Survived] ArrowFunction
shared/services/message-bus/InterFrameCommunicator.ts:66:15
         .pipe(
           ofType(ResponseMessage.MESSAGE_TYPE),
           filter((event: ResponseMessage<T>) => event.queryId === query.queryId),
-          map((event: ResponseMessage<T>) => event.data),
+          map(() => undefined),
           take(1)
         )

[Survived] BlockStatement
shared/services/message-bus/InterFrameCommunicator.ts:70:24
           take(1)
         )
         .subscribe({
-          next(result) {
-            resolve(result);
-          },
+          next(result) {},
           error(error) {
             reject(error);

[Survived] BlockStatement
shared/services/message-bus/InterFrameCommunicator.ts:73:24
           next(result) {
             resolve(result);
           },
-          error(error) {
-            reject(error);
-          }
+          error(error) {}
         });
 

[Survived] BlockStatement
shared/services/message-bus/InterFrameCommunicator.ts:82:41
     });
   }
 
-  public whenReceive(eventType: string) {
-    return {
-      thenRespond: <T>(responder: (queryEvent: IMessageBusEvent) => Observable<T>) => {
-        this.incomingEvent$
-          .pipe(
-            ofType(QueryMessage.MESSAGE_TYPE),
-            filter((queryEvent: QueryMessage) => queryEvent.data.type === eventType),
-            switchMap((queryEvent: QueryMessage) =>
-              responder(queryEvent.data).pipe(
-                take(1),
-                map((response: T) => new ResponseMessage(response, queryEvent.queryId, queryEvent.sourceFrame))
-              )
-            )
-          )
-          .subscribe((response: ResponseMessage<T>) => {
-            this.send(response, response.queryFrame);
-          });
-      }
-    };
-  }
+  public whenReceive(eventType: string) {}
 
   public close(): void {

[Survived] BlockStatement
shared/services/message-bus/InterFrameCommunicator.ts:84:87
 
   public whenReceive(eventType: string) {
     return {
-      thenRespond: <T>(responder: (queryEvent: IMessageBusEvent) => Observable<T>) => {
-        this.incomingEvent$
-          .pipe(
-            ofType(QueryMessage.MESSAGE_TYPE),
-            filter((queryEvent: QueryMessage) => queryEvent.data.type === eventType),
-            switchMap((queryEvent: QueryMessage) =>
-              responder(queryEvent.data).pipe(
-                take(1),
-                map((response: T) => new ResponseMessage(response, queryEvent.queryId, queryEvent.sourceFrame))
-              )
-            )
-          )
-          .subscribe((response: ResponseMessage<T>) => {
-            this.send(response, response.queryFrame);
-          });
-      }
+      thenRespond: <T>(responder: (queryEvent: IMessageBusEvent) => Observable<T>) => {}
     };
   }

[Survived] EqualityOperator
shared/services/message-bus/InterFrameCommunicator.ts:88:50
         this.incomingEvent$
           .pipe(
             ofType(QueryMessage.MESSAGE_TYPE),
-            filter((queryEvent: QueryMessage) => queryEvent.data.type === eventType),
+            filter((queryEvent: QueryMessage) => queryEvent.data.type !== eventType),
             switchMap((queryEvent: QueryMessage) =>
               responder(queryEvent.data).pipe(

[Survived] ConditionalExpression
shared/services/message-bus/InterFrameCommunicator.ts:88:50
         this.incomingEvent$
           .pipe(
             ofType(QueryMessage.MESSAGE_TYPE),
-            filter((queryEvent: QueryMessage) => queryEvent.data.type === eventType),
+            filter((queryEvent: QueryMessage) => false),
             switchMap((queryEvent: QueryMessage) =>
               responder(queryEvent.data).pipe(

[Survived] ArrowFunction
shared/services/message-bus/InterFrameCommunicator.ts:89:23
           .pipe(
             ofType(QueryMessage.MESSAGE_TYPE),
             filter((queryEvent: QueryMessage) => queryEvent.data.type === eventType),
-            switchMap((queryEvent: QueryMessage) =>
-              responder(queryEvent.data).pipe(
-                take(1),
-                map((response: T) => new ResponseMessage(response, queryEvent.queryId, queryEvent.sourceFrame))
-              )
+            switchMap(() => undefined
             )
           )

[Survived] ArrowFunction
shared/services/message-bus/InterFrameCommunicator.ts:92:21
             switchMap((queryEvent: QueryMessage) =>
               responder(queryEvent.data).pipe(
                 take(1),
-                map((response: T) => new ResponseMessage(response, queryEvent.queryId, queryEvent.sourceFrame))
+                map(() => undefined)
               )
             )

[Survived] BlockStatement
shared/services/message-bus/InterFrameCommunicator.ts:96:56
               )
             )
           )
-          .subscribe((response: ResponseMessage<T>) => {
-            this.send(response, response.queryFrame);
-          });
+          .subscribe((response: ResponseMessage<T>) => {});
       }
     };

[Survived] BlockStatement
shared/services/message-bus/InterFrameCommunicator.ts:103:24
     };
   }
 
-  public close(): void {
-    this.close$.next();
-    this.close$.complete();
-  }
+  public close(): void {}
 
   private resolveTargetFrame(target: Window | string): Window {

[Survived] BlockStatement
shared/services/message-bus/InterFrameCommunicator.ts:108:63
     this.close$.complete();
   }
 
-  private resolveTargetFrame(target: Window | string): Window {
-    if (target instanceof Window) {
-      return target;
-    }
-
-    if (target === MERCHANT_PARENT_FRAME) {
-      return this.frameAccessor.getParentFrame();
-    }
-
-    const frames: FrameCollection = this.frameAccessor.getFrameCollection();
-
-    if (target === '' || !frames[target]) {
-      throw new FrameNotFound(`Target frame "${target}" not found.`);
-    }
-
-    return frames[target];
-  }
+  private resolveTargetFrame(target: Window | string): Window {}
 
   private getParentOrigin(): string {

[Survived] ConditionalExpression
shared/services/message-bus/InterFrameCommunicator.ts:109:9
   }
 
   private resolveTargetFrame(target: Window | string): Window {
-    if (target instanceof Window) {
+    if (true) {
       return target;
     }

[Survived] BlockStatement
shared/services/message-bus/InterFrameCommunicator.ts:109:35
   }
 
   private resolveTargetFrame(target: Window | string): Window {
-    if (target instanceof Window) {
-      return target;
-    }
+    if (target instanceof Window) {}
 
     if (target === MERCHANT_PARENT_FRAME) {

[Survived] BlockStatement
shared/services/message-bus/InterFrameCommunicator.ts:113:43
       return target;
     }
 
-    if (target === MERCHANT_PARENT_FRAME) {
-      return this.frameAccessor.getParentFrame();
-    }
+    if (target === MERCHANT_PARENT_FRAME) {}
 
     const frames: FrameCollection = this.frameAccessor.getFrameCollection();

[Survived] ConditionalExpression
shared/services/message-bus/InterFrameCommunicator.ts:113:9
       return target;
     }
 
-    if (target === MERCHANT_PARENT_FRAME) {
+    if (false) {
       return this.frameAccessor.getParentFrame();
     }

[Survived] LogicalOperator
shared/services/message-bus/InterFrameCommunicator.ts:119:9
 
     const frames: FrameCollection = this.frameAccessor.getFrameCollection();
 
-    if (target === '' || !frames[target]) {
+    if (target === '' && !frames[target]) {
       throw new FrameNotFound(`Target frame "${target}" not found.`);
     }

[Survived] BooleanLiteral
shared/services/message-bus/InterFrameCommunicator.ts:119:26
 
     const frames: FrameCollection = this.frameAccessor.getFrameCollection();
 
-    if (target === '' || !frames[target]) {
+    if (target === '' || frames[target]) {
       throw new FrameNotFound(`Target frame "${target}" not found.`);
     }

[Survived] BlockStatement
shared/services/message-bus/InterFrameCommunicator.ts:126:37
     return frames[target];
   }
 
-  private getParentOrigin(): string {
-    if (this.parentOrigin) {
-      return this.parentOrigin;
-    }
-
-    if (Container.has(CONFIG)) {
-      this.parentOrigin = Container.get(CONFIG).origin || InterFrameCommunicator.DEFAULT_ORIGIN;
-
-      return this.parentOrigin;
-    }
-
-    return InterFrameCommunicator.DEFAULT_ORIGIN;
-  }
+  private getParentOrigin(): string {}
 }
 

[Survived] ConditionalExpression
shared/services/message-bus/InterFrameCommunicator.ts:127:9
   }
 
   private getParentOrigin(): string {
-    if (this.parentOrigin) {
+    if (true) {
       return this.parentOrigin;
     }

[Survived] BlockStatement
shared/services/message-bus/InterFrameCommunicator.ts:127:28
   }
 
   private getParentOrigin(): string {
-    if (this.parentOrigin) {
-      return this.parentOrigin;
-    }
+    if (this.parentOrigin) {}
 
     if (Container.has(CONFIG)) {

[Survived] ConditionalExpression
shared/services/message-bus/InterFrameCommunicator.ts:131:9
       return this.parentOrigin;
     }
 
-    if (Container.has(CONFIG)) {
+    if (true) {
       this.parentOrigin = Container.get(CONFIG).origin || InterFrameCommunicator.DEFAULT_ORIGIN;
 

[Survived] ConditionalExpression
shared/services/message-bus/InterFrameCommunicator.ts:131:9
       return this.parentOrigin;
     }
 
-    if (Container.has(CONFIG)) {
+    if (false) {
       this.parentOrigin = Container.get(CONFIG).origin || InterFrameCommunicator.DEFAULT_ORIGIN;
 

[Survived] LogicalOperator
shared/services/message-bus/InterFrameCommunicator.ts:132:27
     }
 
     if (Container.has(CONFIG)) {
-      this.parentOrigin = Container.get(CONFIG).origin || InterFrameCommunicator.DEFAULT_ORIGIN;
+      this.parentOrigin = Container.get(CONFIG).origin && InterFrameCommunicator.DEFAULT_ORIGIN;
 
       return this.parentOrigin;

[Survived] ConditionalExpression
shared/services/message-bus/InterFrameCommunicator.ts:132:27
     }
 
     if (Container.has(CONFIG)) {
-      this.parentOrigin = Container.get(CONFIG).origin || InterFrameCommunicator.DEFAULT_ORIGIN;
+      this.parentOrigin = false;
 
       return this.parentOrigin;
