[Survived] BlockStatement
shared/services/message-bus/MessageSubscriberRegistry.ts:9:63
 export class MessageSubscriberRegistry {
   constructor(private messageBus: MessageBus) {}
 
-  register(...messageSubscribers: IMessageSubscriber[]): void {
-    messageSubscribers.forEach(subscriber => subscriber.register(this.messageBus));
-  }
+  register(...messageSubscribers: IMessageSubscriber[]): void {}
 }
 

[Survived] ArrowFunction
shared/services/message-bus/MessageSubscriberRegistry.ts:10:32
   constructor(private messageBus: MessageBus) {}
 
   register(...messageSubscribers: IMessageSubscriber[]): void {
-    messageSubscribers.forEach(subscriber => subscriber.register(this.messageBus));
+    messageSubscribers.forEach(() => undefined);
   }
 }
