[Survived] BlockStatement
services/message-bus/messages/QueryMessage.ts:9:78
   readonly type = QueryMessage.MESSAGE_TYPE;
   readonly queryId: string;
 
-  constructor(readonly data: IMessageBusEvent, readonly sourceFrame: string) {
-    this.queryId = Uuid.uuidv4();
-  }
+  constructor(readonly data: IMessageBusEvent, readonly sourceFrame: string) {}
 }
 
