[Survived] BlockStatement
services/message-bus/operators/ofType.ts:5:66
 import { IMessageBusEvent } from '../../../../application/core/models/IMessageBusEvent';
 import { filter } from 'rxjs/operators';
 
-export function ofType<T extends IMessageBusEvent>(type: string) {
-  return (source: Observable<T>): Observable<T> => source.pipe(filter(event => event.type === type));
-}
+export function ofType<T extends IMessageBusEvent>(type: string) {}
 

[Survived] ArrowFunction
services/message-bus/operators/ofType.ts:6:71
 import { filter } from 'rxjs/operators';
 
 export function ofType<T extends IMessageBusEvent>(type: string) {
-  return (source: Observable<T>): Observable<T> => source.pipe(filter(event => event.type === type));
+  return (source: Observable<T>): Observable<T> => source.pipe(filter(() => undefined));
 }
 

[Survived] ConditionalExpression
services/message-bus/operators/ofType.ts:6:80
 import { filter } from 'rxjs/operators';
 
 export function ofType<T extends IMessageBusEvent>(type: string) {
-  return (source: Observable<T>): Observable<T> => source.pipe(filter(event => event.type === type));
+  return (source: Observable<T>): Observable<T> => source.pipe(filter(event => false));
 }
 
