[Survived] BlockStatement
shared/services/sentry/EventScrubber.ts:6:30
 
 @Service()
 export class EventScrubber {
-  scrub(event: Event): Event {
-    if (event.extra && event.extra.config) {
-      event.extra.config = { ...event.extra.config, jwt: '*****' };
-    }
-
-    if (event.request && event.request.url) {
-      event.request.url = this.maskJwt(event.request.url);
-    }
-
-    if (event.request && event.request.query_string) {
-      event.request.query_string = this.maskJwt(event.request.query_string);
-    }
-
-    return event;
-  }
+  scrub(event: Event): Event {}
 
   private maskJwt(queryString: string): string {

[Survived] BlockStatement
shared/services/sentry/EventScrubber.ts:7:44
 @Service()
 export class EventScrubber {
   scrub(event: Event): Event {
-    if (event.extra && event.extra.config) {
-      event.extra.config = { ...event.extra.config, jwt: '*****' };
-    }
+    if (event.extra && event.extra.config) {}
 
     if (event.request && event.request.url) {

[Survived] LogicalOperator
shared/services/sentry/EventScrubber.ts:7:9
 @Service()
 export class EventScrubber {
   scrub(event: Event): Event {
-    if (event.extra && event.extra.config) {
+    if (event.extra || event.extra.config) {
       event.extra.config = { ...event.extra.config, jwt: '*****' };
     }

[Survived] StringLiteral
shared/services/sentry/EventScrubber.ts:8:58
 export class EventScrubber {
   scrub(event: Event): Event {
     if (event.extra && event.extra.config) {
-      event.extra.config = { ...event.extra.config, jwt: '*****' };
+      event.extra.config = { ...event.extra.config, jwt: "" };
     }
 

[Survived] ConditionalExpression
shared/services/sentry/EventScrubber.ts:11:9
       event.extra.config = { ...event.extra.config, jwt: '*****' };
     }
 
-    if (event.request && event.request.url) {
+    if (false) {
       event.request.url = this.maskJwt(event.request.url);
     }

[Survived] BlockStatement
shared/services/sentry/EventScrubber.ts:11:45
       event.extra.config = { ...event.extra.config, jwt: '*****' };
     }
 
-    if (event.request && event.request.url) {
-      event.request.url = this.maskJwt(event.request.url);
-    }
+    if (event.request && event.request.url) {}
 
     if (event.request && event.request.query_string) {

[Survived] ConditionalExpression
shared/services/sentry/EventScrubber.ts:15:9
       event.request.url = this.maskJwt(event.request.url);
     }
 
-    if (event.request && event.request.query_string) {
+    if (true) {
       event.request.query_string = this.maskJwt(event.request.query_string);
     }

[Survived] ConditionalExpression
shared/services/sentry/EventScrubber.ts:15:9
       event.request.url = this.maskJwt(event.request.url);
     }
 
-    if (event.request && event.request.query_string) {
+    if (false) {
       event.request.query_string = this.maskJwt(event.request.query_string);
     }

[Survived] BlockStatement
shared/services/sentry/EventScrubber.ts:22:48
     return event;
   }
 
-  private maskJwt(queryString: string): string {
-    return queryString.replace(/(^|\?|&)jwt=.*?(&|$)/, '$1jwt=*****$2');
-  }
+  private maskJwt(queryString: string): string {}
 }
 

[Survived] StringLiteral
shared/services/sentry/EventScrubber.ts:23:56
   }
 
   private maskJwt(queryString: string): string {
-    return queryString.replace(/(^|\?|&)jwt=.*?(&|$)/, '$1jwt=*****$2');
+    return queryString.replace(/(^|\?|&)jwt=.*?(&|$)/, "");
   }
 }
