[Survived] BlockStatement
shared/services/sentry/Sentry.ts:6:40
 
 @Service()
 export class Sentry {
-  init(options?: BrowserOptions): void {
-    init(options);
-  }
+  init(options?: BrowserOptions): void {}
 
   setTag(key: string, value: string): void {

[Survived] BlockStatement
shared/services/sentry/Sentry.ts:10:44
     init(options);
   }
 
-  setTag(key: string, value: string): void {
-    setTag(key, value);
-  }
+  setTag(key: string, value: string): void {}
 
   setExtra(key: string, extra: any) {

[Survived] BlockStatement
shared/services/sentry/Sentry.ts:14:37
     setTag(key, value);
   }
 
-  setExtra(key: string, extra: any) {
-    setExtra(key, extra);
-  }
+  setExtra(key: string, extra: any) {}
 }
 
