[Survived] BlockStatement
shared/services/sentry/SentryContext.ts:11:26
 export class SentryContext {
   constructor(private frameIdentifier: FrameIdentifier) {}
 
-  getFrameName(): string {
-    return this.frameIdentifier.getFrameName();
-  }
+  getFrameName(): string {}
 
   getHostName(): string {

[Survived] BlockStatement
shared/services/sentry/SentryContext.ts:15:25
     return this.frameIdentifier.getFrameName();
   }
 
-  getHostName(): string {
-    return window.location.hostname;
-  }
+  getHostName(): string {}
 
   getEnvironmentName(): EnvironmentName {

[Survived] BlockStatement
shared/services/sentry/SentryContext.ts:19:41
     return window.location.hostname;
   }
 
-  getEnvironmentName(): EnvironmentName {
-    return environment.production ? 'prod' : 'dev';
-  }
+  getEnvironmentName(): EnvironmentName {}
 
   getReleaseVersion(): string {

[Survived] StringLiteral
shared/services/sentry/SentryContext.ts:20:37
   }
 
   getEnvironmentName(): EnvironmentName {
-    return environment.production ? 'prod' : 'dev';
+    return environment.production ? "" : 'dev';
   }
 

[Survived] BlockStatement
shared/services/sentry/SentryContext.ts:23:31
     return environment.production ? 'prod' : 'dev';
   }
 
-  getReleaseVersion(): string {
-    return require('../../../../package.json').version;
-  }
+  getReleaseVersion(): string {}
 }
 
