[Survived] BlockStatement
shared/services/sentry/SentryService.ts:20:5
     private sentry: Sentry,
     private sentryContext: SentryContext,
     private eventScrubber: EventScrubber
-  ) {
-    this.config$ = configProvider.getConfig$(true);
-  }
+  ) {}
 
   init(dsn: string, whitelistUrls: string[] = []): void {

[Survived] BooleanLiteral
shared/services/sentry/SentryService.ts:21:46
     private sentryContext: SentryContext,
     private eventScrubber: EventScrubber
   ) {
-    this.config$ = configProvider.getConfig$(true);
+    this.config$ = configProvider.getConfig$(false);
   }
 

[Survived] BlockStatement
shared/services/sentry/SentryService.ts:24:57
     this.config$ = configProvider.getConfig$(true);
   }
 
-  init(dsn: string, whitelistUrls: string[] = []): void {
-    if (!dsn) {
-      return;
-    }
-
-    this.config$
-      .pipe(
-        first(),
-        filter(config => config.errorReporting),
-        tap(() => this.initSentry(dsn, whitelistUrls)),
-        switchMap(() => this.config$)
-      )
-      .subscribe(config => this.sentry.setExtra('config', config));
-  }
+  init(dsn: string, whitelistUrls: string[] = []): void {}
 
   private initSentry(dsn: string, whitelistUrls: string[]): void {

[Survived] ConditionalExpression
shared/services/sentry/SentryService.ts:25:9
   }
 
   init(dsn: string, whitelistUrls: string[] = []): void {
-    if (!dsn) {
+    if (true) {
       return;
     }

[Survived] ConditionalExpression
shared/services/sentry/SentryService.ts:25:9
   }
 
   init(dsn: string, whitelistUrls: string[] = []): void {
-    if (!dsn) {
+    if (false) {
       return;
     }

[Survived] ArrowFunction
shared/services/sentry/SentryService.ts:32:16
     this.config$
       .pipe(
         first(),
-        filter(config => config.errorReporting),
+        filter(() => undefined),
         tap(() => this.initSentry(dsn, whitelistUrls)),
         switchMap(() => this.config$)

[Survived] ArrowFunction
shared/services/sentry/SentryService.ts:33:13
       .pipe(
         first(),
         filter(config => config.errorReporting),
-        tap(() => this.initSentry(dsn, whitelistUrls)),
+        tap(() => undefined),
         switchMap(() => this.config$)
       )

[Survived] ArrowFunction
shared/services/sentry/SentryService.ts:34:19
         first(),
         filter(config => config.errorReporting),
         tap(() => this.initSentry(dsn, whitelistUrls)),
-        switchMap(() => this.config$)
+        switchMap(() => undefined)
       )
       .subscribe(config => this.sentry.setExtra('config', config));

[Survived] ArrowFunction
shared/services/sentry/SentryService.ts:36:18
         tap(() => this.initSentry(dsn, whitelistUrls)),
         switchMap(() => this.config$)
       )
-      .subscribe(config => this.sentry.setExtra('config', config));
+      .subscribe(() => undefined);
   }
 

[Survived] BlockStatement
shared/services/sentry/SentryService.ts:39:66
       .subscribe(config => this.sentry.setExtra('config', config));
   }
 
-  private initSentry(dsn: string, whitelistUrls: string[]): void {
-    this.sentry.setTag('hostName', this.sentryContext.getHostName());
-    this.sentry.setTag('frameName', this.sentryContext.getFrameName());
-
-    this.sentry.init({
-      dsn,
-      whitelistUrls,
-      environment: this.sentryContext.getEnvironmentName(),
-      release: this.sentryContext.getReleaseVersion(),
-      beforeSend: (event: Event) => this.eventScrubber.scrub(event)
-    });
-  }
+  private initSentry(dsn: string, whitelistUrls: string[]): void {}
 }
 

[Survived] ObjectLiteral
shared/services/sentry/SentryService.ts:43:22
     this.sentry.setTag('hostName', this.sentryContext.getHostName());
     this.sentry.setTag('frameName', this.sentryContext.getFrameName());
 
-    this.sentry.init({
-      dsn,
-      whitelistUrls,
-      environment: this.sentryContext.getEnvironmentName(),
-      release: this.sentryContext.getReleaseVersion(),
-      beforeSend: (event: Event) => this.eventScrubber.scrub(event)
-    });
+    this.sentry.init({});
   }
 }

[Survived] ArrowFunction
shared/services/sentry/SentryService.ts:48:19
       whitelistUrls,
       environment: this.sentryContext.getEnvironmentName(),
       release: this.sentryContext.getReleaseVersion(),
-      beforeSend: (event: Event) => this.eventScrubber.scrub(event)
+      beforeSend: () => undefined
     });
   }
