[Survived] BlockStatement
shared/services/storage/AbstractStorage.ts:22:5
     private communicator: InterFrameCommunicator,
     private framesHub: FramesHub,
     private identifier: FrameIdentifier
-  ) {
-    this.observable$ = fromEventPattern(
-      handler => window.addEventListener(AbstractStorage.STORAGE_EVENT, handler, true),
-      handler => window.removeEventListener(AbstractStorage.STORAGE_EVENT, handler)
-    ).pipe(
-      startWith({ ...this.nativeStorage }),
-      map(() => ({ ...this.nativeStorage })),
-      shareReplay(1)
-    );
-    this.pipe = this.observable$.pipe.bind(this.observable$);
-    this.subscribe = this.observable$.subscribe.bind(this.observable$);
-
-    this.communicator.incomingEvent$.pipe(ofType(this.getSychronizationEventName())).subscribe(event => {
-      const { key, value } = event.data;
-      this.nativeStorage.setItem(key, value);
-      this.emitStorageEvent();
-    });
-  }
+  ) {}
 
   public getItem(name: string): string {

[Survived] BooleanLiteral
shared/services/storage/AbstractStorage.ts:24:82
     private identifier: FrameIdentifier
   ) {
     this.observable$ = fromEventPattern(
-      handler => window.addEventListener(AbstractStorage.STORAGE_EVENT, handler, true),
+      handler => window.addEventListener(AbstractStorage.STORAGE_EVENT, handler, false),
       handler => window.removeEventListener(AbstractStorage.STORAGE_EVENT, handler)
     ).pipe(

[Survived] ArrowFunction
shared/services/storage/AbstractStorage.ts:24:7
     private identifier: FrameIdentifier
   ) {
     this.observable$ = fromEventPattern(
-      handler => window.addEventListener(AbstractStorage.STORAGE_EVENT, handler, true),
+      () => undefined,
       handler => window.removeEventListener(AbstractStorage.STORAGE_EVENT, handler)
     ).pipe(

[Survived] ArrowFunction
shared/services/storage/AbstractStorage.ts:25:7
   ) {
     this.observable$ = fromEventPattern(
       handler => window.addEventListener(AbstractStorage.STORAGE_EVENT, handler, true),
-      handler => window.removeEventListener(AbstractStorage.STORAGE_EVENT, handler)
+      () => undefined
     ).pipe(
       startWith({ ...this.nativeStorage }),

[Survived] ObjectLiteral
shared/services/storage/AbstractStorage.ts:27:17
       handler => window.addEventListener(AbstractStorage.STORAGE_EVENT, handler, true),
       handler => window.removeEventListener(AbstractStorage.STORAGE_EVENT, handler)
     ).pipe(
-      startWith({ ...this.nativeStorage }),
+      startWith({}),
       map(() => ({ ...this.nativeStorage })),
       shareReplay(1)

[Survived] ArrowFunction
shared/services/storage/AbstractStorage.ts:28:11
       handler => window.removeEventListener(AbstractStorage.STORAGE_EVENT, handler)
     ).pipe(
       startWith({ ...this.nativeStorage }),
-      map(() => ({ ...this.nativeStorage })),
+      map(() => undefined),
       shareReplay(1)
     );

[Survived] ObjectLiteral
shared/services/storage/AbstractStorage.ts:28:18
       handler => window.removeEventListener(AbstractStorage.STORAGE_EVENT, handler)
     ).pipe(
       startWith({ ...this.nativeStorage }),
-      map(() => ({ ...this.nativeStorage })),
+      map(() => ({})),
       shareReplay(1)
     );

[Survived] BlockStatement
shared/services/storage/AbstractStorage.ts:34:105
     this.pipe = this.observable$.pipe.bind(this.observable$);
     this.subscribe = this.observable$.subscribe.bind(this.observable$);
 
-    this.communicator.incomingEvent$.pipe(ofType(this.getSychronizationEventName())).subscribe(event => {
-      const { key, value } = event.data;
-      this.nativeStorage.setItem(key, value);
-      this.emitStorageEvent();
-    });
+    this.communicator.incomingEvent$.pipe(ofType(this.getSychronizationEventName())).subscribe(event => {});
   }
 

[Survived] BlockStatement
shared/services/storage/AbstractStorage.ts:41:40
     });
   }
 
-  public getItem(name: string): string {
-    return this.nativeStorage.getItem(name);
-  }
+  public getItem(name: string): string {}
 
   public setItem(name: string, value: string, synchronize: boolean = true): void {

[Survived] BooleanLiteral
shared/services/storage/AbstractStorage.ts:45:70
     return this.nativeStorage.getItem(name);
   }
 
-  public setItem(name: string, value: string, synchronize: boolean = true): void {
+  public setItem(name: string, value: string, synchronize: boolean = false): void {
     this.nativeStorage.setItem(name, value);
     this.emitStorageEvent();

[Survived] BlockStatement
shared/services/storage/AbstractStorage.ts:45:82
     return this.nativeStorage.getItem(name);
   }
 
-  public setItem(name: string, value: string, synchronize: boolean = true): void {
-    this.nativeStorage.setItem(name, value);
-    this.emitStorageEvent();
-
-    if (synchronize) {
-      this.synchronizeStorage(name, value);
-    }
-  }
+  public setItem(name: string, value: string, synchronize: boolean = true): void {}
 
   public select<T>(selector: (storage: { [key: string]: any }) => T): Observable<T> {

[Survived] ConditionalExpression
shared/services/storage/AbstractStorage.ts:49:9
     this.nativeStorage.setItem(name, value);
     this.emitStorageEvent();
 
-    if (synchronize) {
+    if (false) {
       this.synchronizeStorage(name, value);
     }

[Survived] ConditionalExpression
shared/services/storage/AbstractStorage.ts:49:9
     this.nativeStorage.setItem(name, value);
     this.emitStorageEvent();
 
-    if (synchronize) {
+    if (true) {
       this.synchronizeStorage(name, value);
     }

[Survived] BlockStatement
shared/services/storage/AbstractStorage.ts:54:85
     }
   }
 
-  public select<T>(selector: (storage: { [key: string]: any }) => T): Observable<T> {
-    return this.observable$.pipe(
-      map(storage => selector(storage)),
-      shareReplay(1)
-    );
-  }
+  public select<T>(selector: (storage: { [key: string]: any }) => T): Observable<T> {}
 
   protected abstract getSychronizationEventName(): string;

[Survived] ArrowFunction
shared/services/storage/AbstractStorage.ts:56:11
 
   public select<T>(selector: (storage: { [key: string]: any }) => T): Observable<T> {
     return this.observable$.pipe(
-      map(storage => selector(storage)),
+      map(() => undefined),
       shareReplay(1)
     );

[Survived] BlockStatement
shared/services/storage/AbstractStorage.ts:63:36
 
   protected abstract getSychronizationEventName(): string;
 
-  private emitStorageEvent(): void {
-    let event: Event;
-
-    try {
-      event = document.createEvent('StorageEvent');
-    } catch (e) {
-      event = document.createEvent('customevent');
-    }
-
-    event.initEvent(AbstractStorage.STORAGE_EVENT, true, true);
-    window.dispatchEvent(event);
-  }
+  private emitStorageEvent(): void {}
 
   private synchronizeStorage(key: string, value: string): void {

[Survived] BlockStatement
shared/services/storage/AbstractStorage.ts:66:9
   private emitStorageEvent(): void {
     let event: Event;
 
-    try {
-      event = document.createEvent('StorageEvent');
-    } catch (e) {
+    try {} catch (e) {
       event = document.createEvent('customevent');
     }

[Survived] StringLiteral
shared/services/storage/AbstractStorage.ts:67:36
     let event: Event;
 
     try {
-      event = document.createEvent('StorageEvent');
+      event = document.createEvent("");
     } catch (e) {
       event = document.createEvent('customevent');

[Survived] BlockStatement
shared/services/storage/AbstractStorage.ts:68:17
 
     try {
       event = document.createEvent('StorageEvent');
-    } catch (e) {
-      event = document.createEvent('customevent');
-    }
+    } catch (e) {}
 
     event.initEvent(AbstractStorage.STORAGE_EVENT, true, true);

[Survived] StringLiteral
shared/services/storage/AbstractStorage.ts:69:36
     try {
       event = document.createEvent('StorageEvent');
     } catch (e) {
-      event = document.createEvent('customevent');
+      event = document.createEvent("");
     }
 

[Survived] BooleanLiteral
shared/services/storage/AbstractStorage.ts:72:58
       event = document.createEvent('customevent');
     }
 
-    event.initEvent(AbstractStorage.STORAGE_EVENT, true, true);
+    event.initEvent(AbstractStorage.STORAGE_EVENT, true, false);
     window.dispatchEvent(event);
   }

[Survived] BooleanLiteral
shared/services/storage/AbstractStorage.ts:72:52
       event = document.createEvent('customevent');
     }
 
-    event.initEvent(AbstractStorage.STORAGE_EVENT, true, true);
+    event.initEvent(AbstractStorage.STORAGE_EVENT, false, true);
     window.dispatchEvent(event);
   }

[Survived] BlockStatement
shared/services/storage/AbstractStorage.ts:76:64
     window.dispatchEvent(event);
   }
 
-  private synchronizeStorage(key: string, value: string): void {
-    const event: IMessageBusEvent = {
-      type: this.getSychronizationEventName(),
-      data: { key, value }
-    };
-
-    if (!this.identifier.isParentFrame()) {
-      return this.communicator.send(event, MERCHANT_PARENT_FRAME);
-    }
-
-    this.framesHub
-      .waitForFrame(CONTROL_FRAME_IFRAME)
-      .subscribe(controlFrame => this.communicator.send(event, controlFrame));
-  }
+  private synchronizeStorage(key: string, value: string): void {}
 }
 

[Survived] ObjectLiteral
shared/services/storage/AbstractStorage.ts:79:13
   private synchronizeStorage(key: string, value: string): void {
     const event: IMessageBusEvent = {
       type: this.getSychronizationEventName(),
-      data: { key, value }
+      data: {}
     };
 

[Survived] BooleanLiteral
shared/services/storage/AbstractStorage.ts:82:9
       data: { key, value }
     };
 
-    if (!this.identifier.isParentFrame()) {
+    if (this.identifier.isParentFrame()) {
       return this.communicator.send(event, MERCHANT_PARENT_FRAME);
     }

[Survived] ConditionalExpression
shared/services/storage/AbstractStorage.ts:82:9
       data: { key, value }
     };
 
-    if (!this.identifier.isParentFrame()) {
+    if (false) {
       return this.communicator.send(event, MERCHANT_PARENT_FRAME);
     }

[Survived] ArrowFunction
shared/services/storage/AbstractStorage.ts:88:18
 
     this.framesHub
       .waitForFrame(CONTROL_FRAME_IFRAME)
-      .subscribe(controlFrame => this.communicator.send(event, controlFrame));
+      .subscribe(() => undefined);
   }
 }
