[Survived] BlockStatement
shared/services/storage/BrowserLocalStorage.ts:13:52
 export class BrowserLocalStorage implements IStorage {
   private readonly storage: IStorage;
 
-  constructor(private identifier: FrameIdentifier) {
-    this.storage = identifier.isParentFrame() ? Container.get(ParentFrameStorage) : Container.get(StoreBasedStorage);
-  }
+  constructor(private identifier: FrameIdentifier) {}
 
   init(): void {

[Survived] BlockStatement
shared/services/storage/BrowserLocalStorage.ts:17:16
     this.storage = identifier.isParentFrame() ? Container.get(ParentFrameStorage) : Container.get(StoreBasedStorage);
   }
 
-  init(): void {
-    if (isSynchronized(this.storage)) {
-      this.storage.initSynchronization();
-    }
-  }
+  init(): void {}
 
   getItem(name: string): any {

[Survived] BlockStatement
shared/services/storage/BrowserLocalStorage.ts:18:39
   }
 
   init(): void {
-    if (isSynchronized(this.storage)) {
-      this.storage.initSynchronization();
-    }
+    if (isSynchronized(this.storage)) {}
   }
 

[Survived] ConditionalExpression
shared/services/storage/BrowserLocalStorage.ts:18:9
   }
 
   init(): void {
-    if (isSynchronized(this.storage)) {
+    if (false) {
       this.storage.initSynchronization();
     }

[Survived] BlockStatement
shared/services/storage/BrowserLocalStorage.ts:23:30
     }
   }
 
-  getItem(name: string): any {
-    return this.storage.getItem(name);
-  }
+  getItem(name: string): any {}
 
   setItem(name: string, value: any): void {

[Survived] BlockStatement
shared/services/storage/BrowserLocalStorage.ts:27:43
     return this.storage.getItem(name);
   }
 
-  setItem(name: string, value: any): void {
-    this.storage.setItem(name, value);
-  }
+  setItem(name: string, value: any): void {}
 
   select<T>(selector: (storage: { [p: string]: any }) => T): Observable<T> {

[Survived] BlockStatement
shared/services/storage/BrowserLocalStorage.ts:31:76
     this.storage.setItem(name, value);
   }
 
-  select<T>(selector: (storage: { [p: string]: any }) => T): Observable<T> {
-    return this.storage.select(selector);
-  }
+  select<T>(selector: (storage: { [p: string]: any }) => T): Observable<T> {}
 }
 
