[Survived] BlockStatement
shared/services/storage/BrowserSessionStorage.ts:9:104
 
 @Service()
 export class BrowserSessionStorage extends AbstractStorage {
-  constructor(communicator: InterFrameCommunicator, framesHub: FramesHub, identifier: FrameIdentifier) {
-    super(window.sessionStorage, communicator, framesHub, identifier);
-  }
+  constructor(communicator: InterFrameCommunicator, framesHub: FramesHub, identifier: FrameIdentifier) {}
 
   protected getSychronizationEventName(): string {

[Survived] BlockStatement
shared/services/storage/BrowserSessionStorage.ts:13:50
     super(window.sessionStorage, communicator, framesHub, identifier);
   }
 
-  protected getSychronizationEventName(): string {
-    return 'ST_SET_SESSION_STORAGE_ITEM';
-  }
+  protected getSychronizationEventName(): string {}
 }
 
