[Survived] StringLiteral
shared/services/storage/ComponentsConfigSchema.ts:5:69
 
 export const ComponentsConfigSchema = Joi.object().keys({
   defaultPaymentType: Joi.string(),
-  requestTypes: Joi.array().items(Joi.string().valid('THREEDQUERY', 'AUTH')),
+  requestTypes: Joi.array().items(Joi.string().valid('THREEDQUERY', "")),
   paymentTypes: Joi.array().items(Joi.string()),
   startOnLoad: Joi.boolean()
