[Survived] BlockStatement
shared/services/storage/ISynchronizedStorage.ts:7:84
   initSynchronization(): void;
 }
 
-export function isSynchronized(storage: IStorage): storage is ISynchronizedStorage {
-  return typeof (storage as any).initSynchronization === 'function';
-}
+export function isSynchronized(storage: IStorage): storage is ISynchronizedStorage {}
 

[Survived] EqualityOperator
shared/services/storage/ISynchronizedStorage.ts:8:10
 }
 
 export function isSynchronized(storage: IStorage): storage is ISynchronizedStorage {
-  return typeof (storage as any).initSynchronization === 'function';
+  return typeof (storage as any).initSynchronization !== 'function';
 }
 

[Survived] ConditionalExpression
shared/services/storage/ISynchronizedStorage.ts:8:10
 }
 
 export function isSynchronized(storage: IStorage): storage is ISynchronizedStorage {
-  return typeof (storage as any).initSynchronization === 'function';
+  return true;
 }
 
