[Survived] BlockStatement
shared/services/storage/ParentFrameStorage.ts:22:30
 
   constructor(private interFrameCommunicator: InterFrameCommunicator, private framesHub: FramesHub) {}
 
-  getItem(name: string): any {
-    return this.storage$.getValue()[name];
-  }
+  getItem(name: string): any {}
 
   setItem(name: string, value: any): void {

[Survived] BlockStatement
shared/services/storage/ParentFrameStorage.ts:26:43
     return this.storage$.getValue()[name];
   }
 
-  setItem(name: string, value: any): void {
-    this.setItemWithoutSync(name, value);
-    this.framesHub.waitForFrame(CONTROL_FRAME_IFRAME).subscribe(controlFrame => {
-      this.interFrameCommunicator.send(
-        {
-          type: PUBLIC_EVENTS.STORAGE_SYNC,
-          data: { key: name, value: JSON.stringify(value) }
-        },
-        controlFrame
-      );
-    });
-  }
+  setItem(name: string, value: any): void {}
 
   select<T>(selector: (storage: { [p: string]: any }) => T): Observable<T> {

[Survived] BlockStatement
shared/services/storage/ParentFrameStorage.ts:28:81
 
   setItem(name: string, value: any): void {
     this.setItemWithoutSync(name, value);
-    this.framesHub.waitForFrame(CONTROL_FRAME_IFRAME).subscribe(controlFrame => {
-      this.interFrameCommunicator.send(
-        {
-          type: PUBLIC_EVENTS.STORAGE_SYNC,
-          data: { key: name, value: JSON.stringify(value) }
-        },
-        controlFrame
-      );
-    });
+    this.framesHub.waitForFrame(CONTROL_FRAME_IFRAME).subscribe(controlFrame => {});
   }
 

[Survived] ObjectLiteral
shared/services/storage/ParentFrameStorage.ts:30:9
     this.setItemWithoutSync(name, value);
     this.framesHub.waitForFrame(CONTROL_FRAME_IFRAME).subscribe(controlFrame => {
       this.interFrameCommunicator.send(
-        {
-          type: PUBLIC_EVENTS.STORAGE_SYNC,
-          data: { key: name, value: JSON.stringify(value) }
-        },
+        {},
         controlFrame
       );

[Survived] BlockStatement
shared/services/storage/ParentFrameStorage.ts:39:76
     });
   }
 
-  select<T>(selector: (storage: { [p: string]: any }) => T): Observable<T> {
-    return this.storage$.pipe(map(selector));
-  }
+  select<T>(selector: (storage: { [p: string]: any }) => T): Observable<T> {}
 
   initSynchronization(): void {

[Survived] BlockStatement
shared/services/storage/ParentFrameStorage.ts:43:31
     return this.storage$.pipe(map(selector));
   }
 
-  initSynchronization(): void {
-    this.interFrameCommunicator.incomingEvent$
-      .pipe(ofType(PUBLIC_EVENTS.STORAGE_SYNC), takeUntil(this.interFrameCommunicator.communicationClosed$))
-      .subscribe(event => {
-        const { key, value } = event.data;
-        this.setItemWithoutSync(key, this.parseEventData(value));
-      });
-  }
+  initSynchronization(): void {}
 
   private setItemWithoutSync(name: string, value: any): void {

[Survived] BlockStatement
shared/services/storage/ParentFrameStorage.ts:46:27
   initSynchronization(): void {
     this.interFrameCommunicator.incomingEvent$
       .pipe(ofType(PUBLIC_EVENTS.STORAGE_SYNC), takeUntil(this.interFrameCommunicator.communicationClosed$))
-      .subscribe(event => {
-        const { key, value } = event.data;
-        this.setItemWithoutSync(key, this.parseEventData(value));
-      });
+      .subscribe(event => {});
   }
 

[Survived] BlockStatement
shared/services/storage/ParentFrameStorage.ts:52:62
       });
   }
 
-  private setItemWithoutSync(name: string, value: any): void {
-    const storage = this.storage$.getValue();
-    this.storage$.next({ ...storage, [name]: value });
-  }
+  private setItemWithoutSync(name: string, value: any): void {}
 
   private parseEventData(jsonData: string): any {

[Survived] BlockStatement
shared/services/storage/ParentFrameStorage.ts:57:49
     this.storage$.next({ ...storage, [name]: value });
   }
 
-  private parseEventData(jsonData: string): any {
-    try {
-      return JSON.parse(jsonData);
-    } catch (e) {
-      return undefined;
-    }
-  }
+  private parseEventData(jsonData: string): any {}
 }
 

[Survived] BlockStatement
shared/services/storage/ParentFrameStorage.ts:58:9
   }
 
   private parseEventData(jsonData: string): any {
-    try {
-      return JSON.parse(jsonData);
-    } catch (e) {
+    try {} catch (e) {
       return undefined;
     }

[Survived] BlockStatement
shared/services/storage/ParentFrameStorage.ts:60:17
   private parseEventData(jsonData: string): any {
     try {
       return JSON.parse(jsonData);
-    } catch (e) {
-      return undefined;
-    }
+    } catch (e) {}
   }
 }
