[Survived] BlockStatement
shared/services/storage/SimpleStorage.ts:18:43
     return this.storage$.getValue()[name];
   }
 
-  setItem(name: string, value: any): void {
-    const storage = this.storage$.getValue();
-    this.storage$.next({ ...storage, [name]: value });
-  }
+  setItem(name: string, value: any): void {}
 
   select<T>(selector: (storage: { [p: string]: any }) => T): Observable<T> {
