[Survived] BlockStatement
shared/services/storage/StorageConfigProvider.ts:14:24
 
   constructor(private storage: BrowserLocalStorage) {}
 
-  getConfig(): IConfig {
-    return this.storage.getItem(StorageConfigProvider.STORAGE_KEY);
-  }
+  getConfig(): IConfig {}
 
   getConfig$(watchForChanges: boolean = false): Observable<IConfig> {

[Survived] BlockStatement
shared/services/storage/StorageConfigProvider.ts:18:69
     return this.storage.getItem(StorageConfigProvider.STORAGE_KEY);
   }
 
-  getConfig$(watchForChanges: boolean = false): Observable<IConfig> {
-    const config$ = this.storage
-      .select(storage => storage[StorageConfigProvider.STORAGE_KEY])
-      .pipe(distinctUntilChanged(), filter<IConfig>(Boolean), shareReplay(1));
-
-    return watchForChanges ? config$ : config$.pipe(first());
-  }
+  getConfig$(watchForChanges: boolean = false): Observable<IConfig> {}
 }
 

[Survived] BooleanLiteral
shared/services/storage/StorageConfigProvider.ts:18:41
     return this.storage.getItem(StorageConfigProvider.STORAGE_KEY);
   }
 
-  getConfig$(watchForChanges: boolean = false): Observable<IConfig> {
+  getConfig$(watchForChanges: boolean = true): Observable<IConfig> {
     const config$ = this.storage
       .select(storage => storage[StorageConfigProvider.STORAGE_KEY])

[Survived] ArrowFunction
shared/services/storage/StorageConfigProvider.ts:20:15
 
   getConfig$(watchForChanges: boolean = false): Observable<IConfig> {
     const config$ = this.storage
-      .select(storage => storage[StorageConfigProvider.STORAGE_KEY])
+      .select(() => undefined)
       .pipe(distinctUntilChanged(), filter<IConfig>(Boolean), shareReplay(1));
 
