[Survived] BlockStatement
shared/services/storage/StoreBasedStorage.ts:15:30
 export class StoreBasedStorage implements IStorage, ISynchronizedStorage {
   constructor(private store: Store, private interFrameCommunicator: InterFrameCommunicator) {}
 
-  getItem(name: string): any {
-    const { storage } = this.store.getState();
-
-    return storage[name];
-  }
+  getItem(name: string): any {}
 
   setItem(name: string, value: any): void {

[Survived] BlockStatement
shared/services/storage/StoreBasedStorage.ts:21:43
     return storage[name];
   }
 
-  setItem(name: string, value: any): void {
-    this.setItemWithoutSync(name, value);
-    this.interFrameCommunicator.send(
-      {
-        type: PUBLIC_EVENTS.STORAGE_SYNC,
-        data: { key: name, value: JSON.stringify(value) }
-      },
-      MERCHANT_PARENT_FRAME
-    );
-  }
+  setItem(name: string, value: any): void {}
 
   select<T>(selector: (storage: { [p: string]: any }) => T): Observable<T> {

[Survived] BlockStatement
shared/services/storage/StoreBasedStorage.ts:32:76
     );
   }
 
-  select<T>(selector: (storage: { [p: string]: any }) => T): Observable<T> {
-    return this.store.select$(state => selector(state.storage));
-  }
+  select<T>(selector: (storage: { [p: string]: any }) => T): Observable<T> {}
 
   initSynchronization() {

[Survived] ArrowFunction
shared/services/storage/StoreBasedStorage.ts:33:31
   }
 
   select<T>(selector: (storage: { [p: string]: any }) => T): Observable<T> {
-    return this.store.select$(state => selector(state.storage));
+    return this.store.select$(() => undefined);
   }
 

[Survived] BlockStatement
shared/services/storage/StoreBasedStorage.ts:36:25
     return this.store.select$(state => selector(state.storage));
   }
 
-  initSynchronization() {
-    this.interFrameCommunicator.incomingEvent$.pipe(ofType(PUBLIC_EVENTS.STORAGE_SYNC)).subscribe(event => {
-      const { key, value } = event.data;
-      this.setItemWithoutSync(key, this.parseEventData(value));
-    });
-  }
+  initSynchronization() {}
 
   private setItemWithoutSync(name: string, value: string): void {

[Survived] BlockStatement
shared/services/storage/StoreBasedStorage.ts:37:108
   }
 
   initSynchronization() {
-    this.interFrameCommunicator.incomingEvent$.pipe(ofType(PUBLIC_EVENTS.STORAGE_SYNC)).subscribe(event => {
-      const { key, value } = event.data;
-      this.setItemWithoutSync(key, this.parseEventData(value));
-    });
+    this.interFrameCommunicator.incomingEvent$.pipe(ofType(PUBLIC_EVENTS.STORAGE_SYNC)).subscribe(event => {});
   }
 

[Survived] BlockStatement
shared/services/storage/StoreBasedStorage.ts:43:65
     });
   }
 
-  private setItemWithoutSync(name: string, value: string): void {
-    this.store.dispatch({
-      type: 'STORAGE/SET_ITEM',
-      payload: { key: name, value }
-    });
-  }
+  private setItemWithoutSync(name: string, value: string): void {}
 
   private parseEventData(jsonData: string): any {
