[Survived] ConditionalExpression
js-payments/src/testing/ServicesOverrides.ts:8:5
 import { CardinalProvider } from '../application/core/integrations/cardinal-commerce/CardinalProvider';
 import { MockCardinalProvider } from './mocks/MockCardinalProvider';
 
-if (environment.testEnvironment) {
+if (true) {
   Container.set({ id: Cybertonica, type: CybertonicaMock });
   Container.set({ id: CardinalProvider, type: MockCardinalProvider });

[Survived] ConditionalExpression
js-payments/src/testing/ServicesOverrides.ts:8:5
 import { CardinalProvider } from '../application/core/integrations/cardinal-commerce/CardinalProvider';
 import { MockCardinalProvider } from './mocks/MockCardinalProvider';
 
-if (environment.testEnvironment) {
+if (false) {
   Container.set({ id: Cybertonica, type: CybertonicaMock });
   Container.set({ id: CardinalProvider, type: MockCardinalProvider });

[Survived] ObjectLiteral
js-payments/src/testing/ServicesOverrides.ts:10:17
 
 if (environment.testEnvironment) {
   Container.set({ id: Cybertonica, type: CybertonicaMock });
-  Container.set({ id: CardinalProvider, type: MockCardinalProvider });
+  Container.set({});
 }
 
