[Survived] ObjectLiteral
src/testing/mocks/CardinalMock.ts:8:23
 import { environment } from '../../environments/environment';
 
 export class CardinalMock implements ICardinal {
-  private callbacks = {
-    [PaymentEvents.SETUP_COMPLETE]: (...args: any[]): any => void 0,
-    [PaymentEvents.VALIDATED]: (...args: any[]): any => void 0,
-    [CardinalCommerce.UI_EVENTS.RENDER]: (...args: any[]): any => void 0,
-    [CardinalCommerce.UI_EVENTS.CLOSE]: (...args: any[]): any => void 0
-  };
+  private callbacks = {};
 
   configure(config: any) {

[Survived] ArrowFunction
src/testing/mocks/CardinalMock.ts:9:37
 
 export class CardinalMock implements ICardinal {
   private callbacks = {
-    [PaymentEvents.SETUP_COMPLETE]: (...args: any[]): any => void 0,
+    [PaymentEvents.SETUP_COMPLETE]: () => undefined,
     [PaymentEvents.VALIDATED]: (...args: any[]): any => void 0,
     [CardinalCommerce.UI_EVENTS.RENDER]: (...args: any[]): any => void 0,

[Survived] ArrowFunction
src/testing/mocks/CardinalMock.ts:10:32
 export class CardinalMock implements ICardinal {
   private callbacks = {
     [PaymentEvents.SETUP_COMPLETE]: (...args: any[]): any => void 0,
-    [PaymentEvents.VALIDATED]: (...args: any[]): any => void 0,
+    [PaymentEvents.VALIDATED]: () => undefined,
     [CardinalCommerce.UI_EVENTS.RENDER]: (...args: any[]): any => void 0,
     [CardinalCommerce.UI_EVENTS.CLOSE]: (...args: any[]): any => void 0

[Survived] ArrowFunction
src/testing/mocks/CardinalMock.ts:11:42
   private callbacks = {
     [PaymentEvents.SETUP_COMPLETE]: (...args: any[]): any => void 0,
     [PaymentEvents.VALIDATED]: (...args: any[]): any => void 0,
-    [CardinalCommerce.UI_EVENTS.RENDER]: (...args: any[]): any => void 0,
+    [CardinalCommerce.UI_EVENTS.RENDER]: () => undefined,
     [CardinalCommerce.UI_EVENTS.CLOSE]: (...args: any[]): any => void 0
   };

[Survived] ArrowFunction
src/testing/mocks/CardinalMock.ts:12:41
     [PaymentEvents.SETUP_COMPLETE]: (...args: any[]): any => void 0,
     [PaymentEvents.VALIDATED]: (...args: any[]): any => void 0,
     [CardinalCommerce.UI_EVENTS.RENDER]: (...args: any[]): any => void 0,
-    [CardinalCommerce.UI_EVENTS.CLOSE]: (...args: any[]): any => void 0
+    [CardinalCommerce.UI_EVENTS.CLOSE]: () => undefined
   };
 

[Survived] BlockStatement
src/testing/mocks/CardinalMock.ts:19:96
     // @ts-ignore
   }
 
-  continue(paymentBrand: string, continueObject: any, orderObject?: any, cardinalJwt?: string) {
-    ajaxGet(environment.CARDINAL_COMMERCE.MOCK.AUTHENTICATE_CARD_URL).subscribe(response => {
-      const { data, jwt } = response.response;
-      this.callbacks[PaymentEvents.VALIDATED](data, jwt);
-    });
-  }
+  continue(paymentBrand: string, continueObject: any, orderObject?: any, cardinalJwt?: string) {}
 
   off(event: string) {

[Survived] BlockStatement
src/testing/mocks/CardinalMock.ts:20:93
   }
 
   continue(paymentBrand: string, continueObject: any, orderObject?: any, cardinalJwt?: string) {
-    ajaxGet(environment.CARDINAL_COMMERCE.MOCK.AUTHENTICATE_CARD_URL).subscribe(response => {
-      const { data, jwt } = response.response;
-      this.callbacks[PaymentEvents.VALIDATED](data, jwt);
-    });
+    ajaxGet(environment.CARDINAL_COMMERCE.MOCK.AUTHENTICATE_CARD_URL).subscribe(response => {});
   }
 

[Survived] BlockStatement
src/testing/mocks/CardinalMock.ts:30:66
     // @ts-ignore
   }
 
-  on(eventName: string, callback: (...eventData: any[]) => void) {
-    this.callbacks[eventName] = callback;
-  }
+  on(eventName: string, callback: (...eventData: any[]) => void) {}
 
   setup(initializationType: 'init' | 'complete' | 'confirm', initializationData: any) {

[Survived] BlockStatement
src/testing/mocks/CardinalMock.ts:34:87
     this.callbacks[eventName] = callback;
   }
 
-  setup(initializationType: 'init' | 'complete' | 'confirm', initializationData: any) {
-    setTimeout(() => this.callbacks[PaymentEvents.SETUP_COMPLETE](), 100);
-  }
+  setup(initializationType: 'init' | 'complete' | 'confirm', initializationData: any) {}
 
   trigger(eventName: string, ...data: any[]) {

[Survived] ArrowFunction
src/testing/mocks/CardinalMock.ts:35:16
   }
 
   setup(initializationType: 'init' | 'complete' | 'confirm', initializationData: any) {
-    setTimeout(() => this.callbacks[PaymentEvents.SETUP_COMPLETE](), 100);
+    setTimeout(() => undefined, 100);
   }
 

[Survived] BlockStatement
src/testing/mocks/CardinalMock.ts:38:46
     setTimeout(() => this.callbacks[PaymentEvents.SETUP_COMPLETE](), 100);
   }
 
-  trigger(eventName: string, ...data: any[]) {
-    if (this.callbacks[eventName]) {
-      this.callbacks[eventName].apply(this, data);
-    }
-  }
+  trigger(eventName: string, ...data: any[]) {}
 
   start(paymentBrand: string, orderObject: IOrderObject, jwt?: string) {

[Survived] ConditionalExpression
src/testing/mocks/CardinalMock.ts:39:9
   }
 
   trigger(eventName: string, ...data: any[]) {
-    if (this.callbacks[eventName]) {
+    if (false) {
       this.callbacks[eventName].apply(this, data);
     }

[Survived] ConditionalExpression
src/testing/mocks/CardinalMock.ts:39:9
   }
 
   trigger(eventName: string, ...data: any[]) {
-    if (this.callbacks[eventName]) {
+    if (true) {
       this.callbacks[eventName].apply(this, data);
     }

[Survived] BlockStatement
src/testing/mocks/CardinalMock.ts:44:72
     }
   }
 
-  start(paymentBrand: string, orderObject: IOrderObject, jwt?: string) {
-    this.callbacks[PaymentEvents.VALIDATED](
-      {
-        ActionCode: 'ERROR',
-        ErrorDescription: '',
-        ErrorNumber: 4000,
-        Validated: false
-      },
-      ''
-    );
-  }
+  start(paymentBrand: string, orderObject: IOrderObject, jwt?: string) {}
 }
 

[Survived] BooleanLiteral
src/testing/mocks/CardinalMock.ts:50:20
         ActionCode: 'ERROR',
         ErrorDescription: '',
         ErrorNumber: 4000,
-        Validated: false
+        Validated: true
       },
       ''
