[Survived] BlockStatement
src/testing/mocks/MessageBusMock.ts:11:17
   private readonly source: Subject<IMessageBusEvent>;
   public readonly pipe: Observable<any>['pipe'];
 
-  constructor() {
-    this.source = new Subject<IMessageBusEvent>();
-    this.pipe = this.source.pipe.bind(this.source);
-  }
+  constructor() {}
 
   public publish<T>(event: IMessageBusEvent<T>, publishToParent?: boolean): void {

[Survived] BlockStatement
src/testing/mocks/MessageBusMock.ts:16:82
     this.pipe = this.source.pipe.bind(this.source);
   }
 
-  public publish<T>(event: IMessageBusEvent<T>, publishToParent?: boolean): void {
-    this.source.next(event);
-  }
+  public publish<T>(event: IMessageBusEvent<T>, publishToParent?: boolean): void {}
 
   public subscribe<T>(...args: any[]): Unsubscribable {

[Survived] BlockStatement
src/testing/mocks/MessageBusMock.ts:20:55
     this.source.next(event);
   }
 
-  public subscribe<T>(...args: any[]): Unsubscribable {
-    if (typeof args[0] === 'string' && typeof args[1] === 'function') {
-      const [eventType, callback] = args;
-
-      return this.source
-        .pipe(
-          ofType(eventType),
-          map((event: IMessageBusEvent<T>) => event.data)
-        )
-        .subscribe(callback);
-    }
-
-    return this.source.subscribe.apply(this.source, args);
-  }
+  public subscribe<T>(...args: any[]): Unsubscribable {}
 }
 

[Survived] BlockStatement
src/testing/mocks/MessageBusMock.ts:21:71
   }
 
   public subscribe<T>(...args: any[]): Unsubscribable {
-    if (typeof args[0] === 'string' && typeof args[1] === 'function') {
-      const [eventType, callback] = args;
-
-      return this.source
-        .pipe(
-          ofType(eventType),
-          map((event: IMessageBusEvent<T>) => event.data)
-        )
-        .subscribe(callback);
-    }
+    if (typeof args[0] === 'string' && typeof args[1] === 'function') {}
 
     return this.source.subscribe.apply(this.source, args);

[Survived] ConditionalExpression
src/testing/mocks/MessageBusMock.ts:21:40
   }
 
   public subscribe<T>(...args: any[]): Unsubscribable {
-    if (typeof args[0] === 'string' && typeof args[1] === 'function') {
+    if (typeof args[0] === 'string' && true) {
       const [eventType, callback] = args;
 
