[Survived] BlockStatement
src/testing/mocks/MockCardinalProvider.ts:9:60
 
 @Service()
 export class MockCardinalProvider implements ICardinalProvider {
-  getCardinal$(liveStatus: boolean): Observable<ICardinal> {
-    return of(new CardinalMock());
-  }
+  getCardinal$(liveStatus: boolean): Observable<ICardinal> {}
 }
 
