[Survived] ObjectLiteral
src/testing/mocks/TestConfigProvider.ts:11:67
 export class TestConfigProvider implements ConfigProvider {
   private static readonly SAMPLE_JWT =
-  private config$: BehaviorSubject<IConfig> = new BehaviorSubject({
-    ...DefaultConfig,
-    jwt: TestConfigProvider.SAMPLE_JWT
-  });
+  private config$: BehaviorSubject<IConfig> = new BehaviorSubject({});
 
   getConfig(): IConfig {

[Survived] BlockStatement
src/testing/mocks/TestConfigProvider.ts:20:62
     return this.config$.getValue();
   }
 
-  getConfig$(watchForChanges?: boolean): Observable<IConfig> {
-    return this.config$.asObservable();
-  }
+  getConfig$(watchForChanges?: boolean): Observable<IConfig> {}
 
   setConfig(config: IConfig): void {

[Survived] BlockStatement
src/testing/mocks/TestConfigProvider.ts:24:36
     return this.config$.asObservable();
   }
 
-  setConfig(config: IConfig): void {
-    this.config$.next(config);
-  }
+  setConfig(config: IConfig): void {}
 }
 
